[
    {
        "title": "Govt announces caste survey will be part of next census; Vaishnaw slams Cong",
        "link": "https://timesofindia.indiatimes.com/india/cabinet-decides-to-include-caste-census-in-the-main-census-key-decisions/articleshow/120762306.cms",
        "description": "The Union Cabinet has decided to include a caste enumeration in the upcoming national census, as announced by Union Minister Ashwini Vaishnaw. He criticized the Congress party for their alleged historical opposition to such a census, while also pointing out the non-transparent and politically motivated caste surveys conducted by some state governments.",
        "published_date": "Wed, 30 Apr 2025 16:16:14 +0530",
        "source": "Times of India",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "Union minister Ashwini Vaishnaw (File photo)\n\nNEW DELHI: In a Cabinet press briefing on Wednesday, Union minister Ashwini Vaishnaw said that the government has decided to include a caste survey in the main census.\"Cabinet Committee on Political Affairs has decided today that Caste enumeration should be included in the forthcoming census,\" said Ashiwini Vaishnaw.The minister also attacked the Congress party for \"opposing\" the caste census, claiming that late Dr Manmohan Singh had said in 2010 that \"the matter of caste census should be considered in the Cabinet\".\"Congress governments have always opposed the caste census. In 2010, the late Dr Manmohan Singh said that the matter of caste census should be considered in the Cabinet. A group of ministers was formed to consider this subject. Most of the political parties have recommended a caste census,\" he said.Vaishnaw, in a jab at the Congress party, said some state governments have conducted caste surveys from \"a political angle in a non-transparent way\". The minister's remark was in reference to surveys conducted in Congress-ruled Telangana and Karnataka.\"It is well understood that Congress and its INDI alliance partners have used the caste census only as a political tool. Some states have conducted surveys to enumerate castes. While some states have done this well, some others conducted such surveys only from a political angle in a non-transparent way. Such surveys created doubts in society. To ensure that our social fabric is not disturbed by politics, caste enumeration should be included in the census instead of surveys,\" the minister said.\"As per Article 246 of the Constitution of India, the subject of Census is listed at number 69 in the Union List of the Seventh Schedule, making it a Union subject. While some states have conducted caste-based surveys, the approach has varied significantly. In certain cases, these surveys have been carried out in a transparent and organised manner, while in others, they have appeared to serve political motives, lacking transparency and raising doubts in society. Such inconsistent efforts have the potential to disrupt social harmony,\" said the minister.\"Taking these concerns into account, and to ensure that the social fabric remains intact, the government has decided that caste enumeration should be conducted transparently as part of the official Census, rather than through fragmented state-level surveys. This move is aimed at strengthening the social and economic foundations of the country while continuing its path of development,\" he added.",
        "news_type": "Political"
    },
    {
        "title": "Bangladesh court gives bail to Chinmoy Das in sedition case",
        "link": "https://timesofindia.indiatimes.com/world/south-asia/bangladesh-court-gives-bail-to-former-iskcon-priest-chinmoy-das-in-sedition-case/articleshow/120760754.cms",
        "description": "A Bangladesh court granted bail to former Iskcon leader Chinmoy Krishna Das in a sedition case after his arrest sparked widespread outrage. The charges stemmed from the hoisting of a saffron flag above Bangladesh's official flag during a rally in Chattogram. Das, spokesperson for a minority rights group, advocates for Hindu community reforms and organized large public rallies.",
        "published_date": "Wed, 30 Apr 2025 15:05:20 +0530",
        "source": "Times of India",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Chinmoy Krishna Das (ANI photo)\n\nWho is Chinmoy Krishna Das?\n\nA Bangladesh court on Wednesday granted bail to former Iskcon leader Chinmoy Krishna Das in a sedition case , reported Bangladesh's The Daily Star.Das was arrested following a controversy that erupted when a sedition case was filed against him and 18 others in Chittagong on October 30 last year.The charges were linked to the hoisting of a saffron flag above Bangladesh's official flag during the October 25 rally at Laldighi Maidan in Chattogram.Das was presented before a Chittagong court on Tuesday, where his bail plea was denied, and he was sent into custody. The arrest has triggered widespread outrage, with many demanding his immediate release.Das serves as the spokesperson for the Bangladesh Sammilita Sanatani Jagran Jote , a group that champions the rights and security of minorities. He has been a vocal advocate for the Hindu (Sanatani) community in Bangladesh, calling for key reforms such as a minority protection law, a tribunal for fast-tracking cases of minority persecution, and the establishment of a dedicated ministry of minority affairs.He gained widespread attention for organising large public rallies, including one in Chittagong on October 25 and another in Rangpur on November 22, which sparked significant socio-political discussions across the country.Das hails from Satkania Upazila in Chittagong. From 2016 to 2022, he was the Chittagong divisional secretary of Iskcon. He gained popularity at an early age for his religious speeches and earned the nickname of ‘Shishu Bokta’, or ‘child orator’, reports Bangladeshi media.",
        "news_type": "Crime & Law"
    },
    {
        "title": "Watch: What happened after Kuldeep slapped Rinku Singh",
        "link": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/watch-what-happened-after-kuldeep-yadav-slapped-rinku-singh-on-the-field/articleshow/120763226.cms",
        "description": "Following a tense IPL match between Delhi Capitals and Kolkata Knight Riders, a playful interaction between Kuldeep Yadav and Rinku Singh went viral, showcasing their strong off-field camaraderie. Despite Rinku's earlier aggressive batting against Kuldeep, the video captured laughter and friendship, highlighting the positive spirit amidst the competition. KKR secured a 14-run victory, keeping their playoff hopes alive.",
        "published_date": "Wed, 30 Apr 2025 16:44:43 +0530",
        "source": "Times of India",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Kuldeep Yadav's friendly slap to Rinku Singh (Screengrab)\n\nGo Beyond The Boundary with our YouTube channel.\n\nEverything is special about Vaibhav Suryavanshi: Vikram Rathour\n\nNEW DELHI: Cricket fans were caught off guard after a playful moment between Kuldeep Yadav and Rinku Singh went viral following the intense IPL clash between Delhi Capitals and Kolkata Knight Riders at the Arun Jaitley Stadium on Tuesday.In a clip, Kuldeep was seen giving Rinku a friendly slap during the post-match greetings.While it may have sparked curiosity online, the gesture was clearly in jest.The video that followed put any doubts to rest, showing the duo sharing laughs, making the ‘L’ sign — symbolising ‘Love’ — and enjoying warm off-field camaraderie.Watch:Both Kuldeep and Rinku hail from Uttar Pradesh and share a strong bond off the field, often engaging in friendly banter.The video not only captured their humorous moment on the ground but also featured glimpses of their fun interactions behind the scenes.As for the match itself, KKR secured a thrilling 14-run win over DC, keeping their playoff hopes alive. Batting first, KKR posted a solid 204/9, with crucial contributions from Angkrish Raghuvanshi (44), Rinku Singh (36), and Andre Russell’s late fireworks.Rinku had earlier taken on Kuldeep Yadav in style, hammering two fours and a six in a single over.In reply, DC managed 190/9, despite fighting knocks from Faf du Plessis (62), Axar Patel (43), and Vipraj Nigam (38). Sunil Narine was the pick of the bowlers for KKR with 3/29, while Mitchell Starc delivered a dramatic final over, claiming two wickets and sealing the win.With this victory, KKR moved to 9 points, still in the playoff race, while DC held onto a top-four spot with 12 points.",
        "news_type": "Social Issues & Human Rights"
    },
    {
        "title": "Trump calls India-born Democrat Rep Shri Thanedar 'lunatic, dumb guy'",
        "link": "https://timesofindia.indiatimes.com/world/us/donald-trump-calls-india-born-democrat-rep-shri-thanedar-lunatic-dumb-guy-over-impeachment-filing/articleshow/120755092.cms",
        "description": "",
        "published_date": "Wed, 30 Apr 2025 13:48:05 +0530",
        "source": "Times of India",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "“Here we go again…”: Trump Blasts Congressman Thanedar over impeachment move\n\nNEW DELHI: US President Donald Trump on Tuesday lashed out at India-born Democrat Shri Thanedar , the Michigan congressman who filed impeachment articles against him, calling him a \" lunatic \" during a public appearance in Michigan.Speaking during a visit to Selfridge and later at a rally at Macomb County Community College, Trump mocked Thanedar, saying, \"They did it again. Some guy that I never heard of, (hey) John James, is he a congressman?\", as he turned to Michigan GOP Rep. John James.\"This guy, he said, he said, ladies and gentlemen, I am going to start the impeachment of Donald Trump. What the hell did I do?\"Thanedar had filed seven articles of impeachment against President Trump , citing issues like unlawful deportations, defying court orders, and harmful tariffs on Monday.\"Here we go again. They want to impeach me, this lunatic This lunatic is up, actually, I had the television way down. And I said to our great first lady, listen, did I just hear I was being impeached again?\" Trump said.\"We're getting good at this though,\" he added.Trump further criticised the Democratic Party leadership, referencing Thanedar and Texas Rep. Al Green, who was removed from Trump's Congressional address in March.\"They've gone totally crazy, these people. And you know what? They've totally lost their confidence. They can't even tell a lunatic like this dumb guy that said it,\" he said.The move comes just a day before Trump is set to hold a rally in Macomb County marking his first 100 days in office.Thanedar caused significant controversy by presenting impeachment articles against Trump, stating the President posed a direct threat to American democracy.He released a video condemning Trump for constitutional violations and ignoring a Supreme Court directive regarding deported immigrant Kilmar Armando Abrego Garcia.\"Donald Trump has repeatedly demonstrated that he is unfit to serve as President and represents a clear and present danger to our nation’s constitution and our democracy,\" the Congressman Thanedar said in a video posted on X.\"His unlawful actions have subverted the justice system, violated the separation of powers, and placed personal power and self-interest above public service. We cannot wait for more damage to be done. Congress must act.\"\"This is not about partisanship. It’s about protecting our democracy and ensuring that no one, not even a President, is above the law,\" Thanedar added.",
        "news_type": "Political"
    },
    {
        "title": "Google is making changes to its salary structure: Here's what it means",
        "link": "https://timesofindia.indiatimes.com/technology/tech-news/google-is-making-changes-to-its-salary-structure-heres-what-it-means-for-employees/articleshow/120761933.cms",
        "description": "Google is revamping its performance review system to allocate larger bonuses and equity awards to high-achieving employees, potentially decreasing compensation for those with lower performance ratings. This adjustment, set to influence end-of-year reviews and 2026 compensation, aims to incentivize top contributors. While some employees may receive reduced bonuses, Google maintains its commitment to competitive compensation and benefits.",
        "published_date": "Wed, 30 Apr 2025 15:35:02 +0530",
        "source": "Times of India",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "Google is revamping its performance review system to allocate larger bonuses and equity awards to high-achieving employees, potentially decreasing compensation for those with lower performance ratings. This adjustment, set to influence end-of-year reviews and 2026 compensation, aims to incentivize top contributors. While some employees may receive reduced bonuses, Google maintains its commitment to competitive compensation and benefits.",
        "news_type": "Economic & Business"
    },
    {
        "title": "21 Manipur MLAs Write To PM Modi, Ask To Form \"Popular Government\"",
        "link": "https://www.ndtv.com/india-news/21-manipur-mlas-write-to-pm-narendra-modi-ask-to-form-popular-government-8295163#publisher=newsstand",
        "description": "The Manipur legislative assembly has 60 seats",
        "published_date": "Wed, 30 Apr 2025 16:23:29 +0530",
        "source": "NDTV",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "Quick Take Summary is AI generated, newsroom reviewed. 21 Manipur MLAs urged PM Modi to establish a popular government in the state where President's rule has been imposed. They argue this is crucial for peace, while Congress criticise them for bypassing proper channels to form a government.\n\nTwenty-one MLAs from Manipur have written to Prime Minister Narendra Modi requesting him to form a \"popular government\" in the crisis-hit state that is under the President's rule. They said such a step would ensure peace and normalcy in the state.\n\nThe Centre on February 13 imposed President's rule in Manipur, where more than 260 people have been killed and thousands left homeless in ethnic violence between the Meiteis and Kuki tribes since May 2023.\n\nThe imposition of the President's rule came after chief minister N Biren Singh resigned. The state assembly, which has a tenure till 2027, has been put under suspended animation.\n\nThe letter, signed by 13 BJP MLAs, three National People's Party (NPP) MLAs, three Naga Peoples' Front (NPF) MLAs and two independents, said: \"The people of Manipur welcomed the President's rule... with lots of hope and expectation. However, it's going to be three months, but no visible actions to bring peace and normalcy have been seen so far.\"\n\n\"There is strong apprehension among the people that the violence may occur again in the state. Many civil organisations have come out openly against the imposition of the President's rule and (are) demanding installation of a popular government,\" they said.\n\n\"These organisations have started holding public rallies, street corner meetings, instigating the general public, blaming the ruling MLAs for not staking claim to form a popular government and fixing responsibility for the imposition of PR (President's rule) in the state,\" the MLAs said in the April 10 letter.\n\nThe Prime Minister's Office received the letter on April 29. The MLAs wrote the letter on April 10, a copy of the letter shows.\n\n\"We feel the installation of a popular government is the only means to bring peace and normalcy in Manipur,\" the letter said.\n\nThey asked PM Modi to \"take necessary steps to install a popular government at the earliest in the interests of the people of Manipur. We assure you we will work with full dedication and devotion to bring peace and normalcy after the installation of a popular government\".\n\nHowever, Manipur Congress chief Keisham Meghachandra Singh criticised the 21 MLAs for writing to the Centre, bypassing the Governor.\n\nHe alleged the MLAs bypassed the constitutional route in their \"attempt to form a government in the state\". Mr Meghachandra accused the MLAs of political insincerity and questioned their seriousness about ensuring democratic governance in the state.\n\n\"These legislators, who should have gone to Raj Bhavan in Imphal to stake claim a formation of a new government, had chosen to write not to the Manipur Governor. Instead, they chose to write to the Prime Minister and the Union Home Minister. The state is placed under President's Rule. Their actions show that they are not serious about meeting the Governor to stake claim to the new government in Manipur,\" Mr Meghachandra said in a post on X.\n\nHe said the political will of the people of Manipur must \"not be reduced to a matter of convenience for ruling parties\".\n\n\"The mandate of the people of Manipur can't be played for their political convenience. The people of Manipur want a change. The people of Manipur want a new alternative\", the Congress leader said.\n\n\"We must honour the new alternative and the change that the people of Manipur will bring for our better future.\"",
        "news_type": "Political"
    },
    {
        "title": "Hindu Monk Chinmoy Krishna Das Gets Bail In Bangladesh In Sedition Case",
        "link": "https://www.ndtv.com/world-news/hindu-monk-chinmoy-krishna-das-gets-bail-from-bangladesh-high-court-in-sedition-case-news-agency-ani-8294773#publisher=newsstand",
        "description": "Chinmoy Krishna Das was granted bail by the Bangladesh High Court",
        "published_date": "Wed, 30 Apr 2025 16:23:00 +0530",
        "source": "NDTV",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Quick Take Summary is AI generated, newsroom reviewed. Spiritual leader Chinmoy Krishna Das was granted bail by the Bangladesh High Court after six months in jail for sedition, following his arrest on charges of insulting the national flag of Bangladesh.\n\nSpiritual leader Chinmoy Krishna Das was granted bail by the Bangladesh High Court in a sedition case, after six months of arrest, per ANI. Mr. Das, a former ISKCON leader and spokesperson of the Bangladesh Sammilit Sanatani Jagran Jote was arrested on November 25 at Dhaka airport. He was charged for insulting the national flag of Bangladesh.\n\nAfter a lower court rejected his application for bail, he applied in the High Court where the order was passed by a bench of Justice Md Atoar Rahman and Justice Md Ali Reza.\n\nHis arrest had sparked protests, culminating in violent clashes between his followers and law enforcement outside the Chattogram Court Building on November 27, which resulted in the death of a lawyer, and further strained relations between India and Bangladesh.\n\nAs President of Pundarik Dham, Mr Das has long been a voice for those seeking religious freedom and minority protection. He previously held the position of divisional organising secretary for ISKCON in Chattogram but ISKCON Bangladesh said that he had been removed from all positions in the organisation.\n\nHe was born in May 1985 in Karianagar village, located in the Satkania Upazila of Chattogram. Chinmoy Krishna Das Brahmachari gained recognition for his skills as a child orator within religious circles. His spiritual journey began at a young age, and by 1997, at just 12 years old, he took diksha (initiation) and joined ISKCON as a brahmachari.\n\nIn response to Brahmachari's arrest last year, the Ministry of External Affairs (MEA) of India had expressed “deep concern” over the court's decision to deny him bail in January. An MEA statement emphasised that the arrest occurred against the backdrop of widespread violence against Hindus and other minority communities in Bangladesh. The MEA pointed out that these attacks, including arson, looting of minority-owned properties, theft, vandalism, and desecration of temples and deities, have continued unchecked. It was noted that despite these attacks, religious leaders like Chinmoy Krishna Das Brahmachari, who advocate for peaceful change, are facing charges, while the perpetrators of violence remain unpunished.\n\n",
        "news_type": "Crime & Law"
    },
    {
        "title": "Smell Of Change: Incense Industry On Path To A Child Labour-Free Future",
        "link": "https://www.ndtv.com/india-news/smell-of-change-incense-industry-on-path-to-a-child-labour-free-future-7984523#publisher=newsstand",
        "description": "While the overall positive trend was visible across all study states, there were regional variations.",
        "published_date": "Wed, 30 Apr 2025 16:19:32 +0530",
        "source": "NDTV",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Child labour in the incense manufacturing industry, a longstanding concern for India, is declining significantly and the sector is moving towards complete freedom from child labour in Karnataka, Andhra Pradesh, and Bihar, a study finds.\n\nThe study, 'Fragrance of Agarbatti: A Study on Extent of Child Labour in India's Incense Stick Manufacturing Industry', conducted by India Child Protection (ICP), found that 82 per cent of respondents had not witnessed any instances of child labour in the sector while only 8 per cent said that they had. ICP is a partner of Just Rights for Children (JRC) - a network of over 200 NGOs working in 416 districts for child protection and child rights.\n\nICP conducted the research with data from other JRC partners in these states including Anekal Rehabilitation Education and Development Centre, Margdarshi Society, Spandana Association, Prayas JAC Society, Janakalyan Welfare Society, Rural Education and Liberty, SAMANTHA Society for Rural Education and Development Society for Education and Environment Development.\n\nExpressing optimism about this positive trend, Ravi Kant, National Convenor of Just Rights for Children, stated, \"This finding is extremely encouraging for the country and a strong indication that India is on the right path to eliminating child labour. The steady decline in child labour across these three states reflects the effectiveness of recent policy initiatives and the commitment of the state and Central governments to end this crime. Now, we must ensure sustained efforts from all stakeholders - including government agencies, civil society, and industry leaders - to build on this momentum and achieve a child labour-free India.\"\n\nTo assess the extent of child labour in this sector, specific pockets in the states were identified which included Chikkaballapur and Kolar districts in Karnataka, Gaya in Bihar, and Alluri Seetha Rama Raju, Anakapalli, Chittoor and Sri Satya Sai districts in Andhra Pradesh. The data was collated after visits and consultations with stakeholders, engagement with residents and community leaders for geographical insights and data received from residents in the areas. Various researchers have found that inhaling dust, toxic chemicals and heavy metals present in incense sticks leads to respiratory and neurological effects, cardiovascular problems, cognitive dysfunction and potential long-term health issues like cancer.\n\nWhile this overall positive trend is visible across all study states, the trend showed regional variations. While in Bihar, an overwhelming 96 per cent of respondents said they had not witnessed any child labour in their neighbourhood incense stick industry, 61 per cent of Karnataka respondents had not seen any child labour in their neighbourhood factories and 77 per cent of respondents in Andhra Pradesh said that child labour did not exist in the incense stick factories around them.",
        "news_type": "Social Issues & Human Rights"
    },
    {
        "title": "21 Manipur MLAs Write To Amit Shah, Ask To Form \"Popular Government\"",
        "link": "https://www.ndtv.com/india-news/21-manipur-mlas-write-to-amit-shah-ask-to-form-popular-government-8294840#publisher=newsstand",
        "description": "Manipur is under the President's rule",
        "published_date": "Wed, 30 Apr 2025 16:13:03 +0530",
        "source": "NDTV",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "Twenty-one MLAs have written to Union Home Minister Amit Shah, asking him to form a \"popular government\" in Manipur, which is now under the President's rule, to ensure peace and normalcy in the state.\n\nThe Centre on February 13 imposed President's rule in Manipur, where more than 260 people have been killed and thousands left homeless in ethnic violence between the Meiteis and Kuki tribes since May 2023.\n\nThe imposition of the President's rule came after chief minister N Biren Singh resigned. The state assembly, which has a tenure till 2027, has been put under suspended animation.\n\nThe letter, signed by 13 BJP MLAs, three National People's Party (NPP) MLAs, three Naga Peoples' Front (NPF) MLAs and two independents, said: \"The people of Manipur welcomed the President's rule... with lots of hope and expectation. However, it's going to be three months, but no visible actions to bring peace and normalcy have been seen so far.\"\n\n\"There is strong apprehension among the people that the violence may occur again in the state. Many civil organisations have come out openly against the imposition of the President's rule and (are) demanding installation of a popular government,\" they said.\n\n\"These organisations have started holding public rallies, street corner meetings, instigating the general public, blaming the ruling MLAs for not staking claim to form a popular government and fixing responsibility for the imposition of PR (President's rule) in the state,\" the MLAs said in the April 10 letter.\n\nThe letter was received by the Ministry of Home Affairs (MHA) on April 29 and made public on Wednesday, one of the MLAs said.\n\n\"We feel the installation of a popular government is the only means to bring peace and normalcy in Manipur,\" the letter said.\n\nThey asked Mr Shah to \"take necessary steps to install a popular government at the earliest in the interests of the people of Manipur. We assure you we will work with full dedication and devotion to bring peace and normalcy after the installation of a popular government\".\n\nHowever, Manipur Congress chief Keisham Meghachandra Singh criticised the 21 MLAs for writing to the Centre, bypassing the Governor.\n\nHe alleged the MLAs bypassed the constitutional route in their \"attempt to form a government in the state\". Mr Meghachandra accused the MLAs of political insincerity and questioned their seriousness about ensuring democratic governance in the state.\n\n\"These legislators, who should have gone to Raj Bhavan in Imphal to stake claim a formation of a new government, had chosen to write not to the Manipur Governor. Instead, they chose to write to the Prime Minister and the Union Home Minister. The state is placed under President's Rule. Their actions show that they are not serious about meeting the Governor to stake claim to the new government in Manipur,\" Mr Meghachandra said in a post on X.\n\nHe said the political will of the people of Manipur must \"not be reduced to a matter of convenience for ruling parties\".\n\n\"The mandate of the people of Manipur can't be played for their political convenience. The people of Manipur want a change. The people of Manipur want a new alternative\", the Congress leader said.\n\n\"We must honour the new alternative and the change that the people of Manipur will bring for our better future.\"",
        "news_type": "Political"
    },
    {
        "title": "Schoolboy, 15, In UP's Aligarh Forced To Urinate On Pakistani Flag: Cops; Pahalgam Terror Attack",
        "link": "https://www.ndtv.com/india-news/school-boy-15-in-ups-aligarh-forced-to-urinate-on-pakistani-flag-cops-pahalgam-terror-attack-8294846#publisher=newsstand",
        "description": "In a police complaint, the 15-year-old student's family said he was returning home.",
        "published_date": "Wed, 30 Apr 2025 16:12:22 +0530",
        "source": "NDTV",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "A video circulating on social media purportedly showing a mob surrounding a schoolboy and coercing him into urinating on a Pakistani flag lying on a road in Uttar Pradesh's Aligarh has prompted police to launch a probe and book three people.\n\nThe Aligarh district unit of the Samajwadi Party condemned the incident, which it saw as an attempt at inciting communal discord in the wake of last week's Pahalgam terror attack in which 26 people, mostly tourists, were killed.\n\nIn a police complaint, the 15-year-old student's family said he was returning home from the Government Inter College with friends on Monday afternoon when he noticed the flag lying on the ground.\n\nMoments later, a mob accosted the boy, demanded to know his name, started abusing him and coerced him to urinate on the flag, it stated.\n\nAn FIR was registered late on Monday night at the Banna Devi police station and three accused, including one unnamed, were booked under various sections of the Bharatiya Nyaya Sanhita.\n\nA senior police officer said the matter was under investigation and asserted that strict action would be taken against those found guilty.\n\nReacting to the incident, Samajwadi Party district general secretary Manoj Yadav alleged that certain elements were trying to incite communal discord in the wake of the Pahalgam tragedy.\n\n\"It is a deeply disturbing video, but the incident is not an isolated one. We have received reports of similar incidents of harassment from other parts of the city. The administration must act decisively to prevent any attempts to disrupt peace,\" he said.\n\nIn a separate incident, police said an FIR has been registered against unidentified persons for allegedly ransacking the shop of Omar Husain, a fruit juice vendor, in the Suwarn Jayanti Nagar area under the Kuwarsi police station limits.\n\n\"We have taken cognisance of both incidents and investigations are underway, Circle Officer Abhay Pande told reporters and appealed to people to refrain from spreading rumours or inciting tension.\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
        "news_type": "Crime & Law"
    },
    {
        "title": "CBI dismantles child sexual abuse exploitation networks as part of Operation Hawk 2025",
        "link": "https://www.thehindu.com/news/national/karnataka/cbi-dismantles-child-sexual-abuse-exploitation-networks-as-part-of-operation-hawk-2025/article69509846.ece",
        "description": "International Operations Division of CBI registered a case against Sheik Muizz Ahmed, a resident of Mangaluru, and Mukul Saini, a resident of Delhi.",
        "published_date": "Wed, 30 Apr 2025 17:22:37 +0530",
        "source": "The Hindu",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "The Central Bureau of Investigation (CBI), on the basis of inputs received from Operation Hawk, launched by the US, has taken swift action to successfully dismantle the cybercrime networks involving online child sexual exploitation with international linkages.\n\nInternational Operations Division of CBI registered a case against Sheik Muizz Ahmed under Section 506 of Indian Penal Code, Section 66D of Information Technology Act, 2000, and Section 12 read with Section 11 of POCSO Act, 2012.\n\nArrest of Sheikh Muizz Ahmed\n\n“During March 2024, accused Sheikh Muizz Ahmed, a resident of Mangaluru, operated through social media platform ‘Discord’ under the username “heisenberg7343” and engaged in online chats with a minor girl from the USA. The accused induced the minor girl to engage in sexual chats with him and he further enticed her to share her obscene images, videos with him over the said platform,” said a release.\n\nThe accused also allegedly intimidated the minor victim to engage in obscene sexual activities online.\n\nFollowing the case, the CBI conducted extensive searches at various locations in Mumbai and Mangaluru linked to the accused, allegedly leading to the recovery of electronic devices including mobile phone and laptop which contained Child Sexual Abuse Material ( CSAM), obtained by the accused from the minor girl victim by way of inducement. Accused Shiekh Muizz Ahmed was arrested by CBI and sent to judicial custody.\n\nMukul Saini booked\n\nInternational Operations Division of the CBI registered another case against Mukul Saini under Section 506 of Indian Penal Code as well as Section 67 of Information Technology Act, 2000 and Section 12 read with Sections 11 and 15 of POCSO Act, 2012 and launched an investigation.\n\nDuring the period 2023-2024, accused Mukul Saini, a resident of Delhi, operated through social media platforms ‘Discord’ and ‘Arisu’ and chatted online with a minor girl from the US.\n\n“During chats, the accused induced the minor girl to engage in sexualized chats with him and share her obscene images/videos with him over the said platform. Accused also intimidated the minor victim to continue sharing her obscene images, videos, otherwise he will make her obscene images, videos viral on the internet. Following the registration of the case, the CBI conducted extensive searches at various locations in Delhi linked to the accused, leading to the recovery of electronic devices, mobile phones, and hard disks containing incriminating digital evidence relating to the case,” added the release.\n\nEarlier, the CBI had launched Operation Carbon in 2021 and Operation Megh Chakra in 2022 as part of its efforts for rapid response to online child sexual exploitation cases with international linkages as well as to trace the accused, suspects, and conspirators located across international jurisdictions, requiring a globally coordinated law enforcement response.",
        "news_type": "Crime & Law"
    },
    {
        "title": "Centre hikes sugarcane price by 4.41% to ₹355 per quintal for 2025-26",
        "link": "https://www.thehindu.com/news/national/centre-hikes-sugarcane-price-by-441-pc-to-rs-355qtl-for-2025-26/article69509957.ece",
        "description": "A premium of ₹3.46 per quintal for each 0.1% increase in sugar recovery over and above 10.25% will be provided to farmers. A reduction in FRP by ₹3.46 per quintal will be for every 0.1% decrease in recovery rate",
        "published_date": "Wed, 30 Apr 2025 17:22:02 +0530",
        "source": "The Hindu",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "The government on Wednesday (April 30, 2025) decided to increase the fair and remunerative price (FRP) of sugarcane by 4.41% to ₹355 per quintal for the upcoming 2025-26 season beginning October.\n\nA decision in this regard was taken in the meeting of the Cabinet Committee on Economic Affairs (CCEA) chaired by Prime Minister Narendra Modi keeping in mind the interest of sugarcane farmers, an official statement said.\n\nFor the current 2024-25 season, the sugarcane FRP has been fixed at ₹340 per quintal.\n\nFRP is the minimum price mandated by the Government of India that sugar mills are legally obligated to pay sugarcane farmers for their produce.\n\nBriefing media after the meeting, I&B Minister Ashwini Vaishnaw said the FRP of ₹355 per quintal has been approved for a basic recovery rate of 10.25%.\n\n“The FRP for sugar season 2025-26 is 4.41% higher than current sugar season 2024-25,” the statement said.\n\nA premium of ₹3.46 per quintal for each 0.1% increase in sugar recovery over and above 10.25% will be provided to farmers. A reduction in FRP by ₹3.46 per quintal will be for every 0.1% decrease in recovery rate.\n\nThe government has also decided that there will not be any deduction in case of sugar mills where recovery is below 9.5%. Such farmers will get ₹329.05 per cent for sugarcane in the ensuing 2025-26 season.\n\nAccording to the statement, the cost of production of sugarcane for the sugar season 2025-26 is ₹173 per quintal. The FRP of ₹355 per quintal fixed for 2025-26 at a recovery rate of 10.25% is higher by 105.2% over production cost.\n\nThe sugar sector is an important agro-based sector that impacts the livelihood of about five crore sugarcane farmers and their dependents and around five lakh workers directly employed in sugar mills, apart from those employed in various ancillary activities including farm labour and transportation.\n\nThe FRP has been determined on the basis of recommendations of the Commission for Agricultural Costs and Prices (CACP) and after consultation with state governments and other stakeholders.\n\nAs of April 28, about 87% of total cane dues of ₹97,270 crore have been paid to farmers in the 2024-25 season, while 99.92% of total cane dues of ₹1,11,782 crores were paid to farmers for 2024-25.",
        "news_type": "Economic & Business"
    },
    {
        "title": "Cabinet approves Shillong-Silchar highway project at an estimated cost of ₹22,864 crore",
        "link": "https://www.thehindu.com/news/national/cabinet-approves-shillong-silchar-highway-project-at-an-estimated-cost-of-22864-crore/article69509906.ece",
        "description": "An official statement said upon completion, the Shillong-Silchar Corridor will play a pivotal role in regional economic growth, improving connectivity between Guwahati, Shillong, Silchar, Imphal, Aizawl and Agartala",
        "published_date": "Wed, 30 Apr 2025 17:15:48 +0530",
        "source": "The Hindu",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "The Union Cabinet on Wednesday (April 30, 2025) approved the development of a 166.80 km greenfield high-speed corridor from Mawlyngkhung in Meghalaya to Panchgram in Assam on hybrid annuity mode at a total cost of ₹22,864 crore.\n\nAccording to an official statement, the project length of 166.80 km (NH-6) lies in Meghalaya (144.80 km) and Assam (22 km).\n\n\"The Cabinet Committee on Economic Affairs, chaired by Prime Minister Narendra Modi, has approved the proposal for the development, maintenance and management of four-lane greenfield access-controlled 166.80 km of National Highway No 06 from Mawlyngkhung (near Shillong) in Meghalaya to Panchgram (near Silchar) in Assam on hybrid annuity mode...at a total capital cost of Rs 22,864 crore,\" it added.\n\nThe proposed greenfield high-speed corridor will improve the service level for the traffic moving between Guwahati to Silchar, it noted.\n\n\"The development of this corridor will improve the connectivity to Tripura, Mizoram, Manipur and the Barak Valley region of Assam from mainland and Guwahati with substantially reduced travel distance and travel time,\" it said, adding that this will, in turn, contribute to the enhancement of logistics efficiency of the nation.\n\nThe corridor will improve connectivity between Assam and Meghalaya and spur economic development, including the development of industries in Meghalaya, as it passes through the cement and coal production areas of Meghalaya.\n\nAs per the statement, this corridor will cater to the national and international tourists coming from well-connected Guwahati Airport, Shillong Airport, and Silchar Airport (via existing NH-06), connecting Guwahati to Silchar. This would connect scenic places of tourist attraction in the Northeast and promote tourism.\n\nThis critical infrastructure project will improve inter-city connectivity between Guwahati, Shillong and Silchar, traversing through Ri Bhoi, East Khasi Hills, West Jaintia Hills, East Jaintia Hills in Meghalaya and Cachar district in Assam and reduce congestion on existing NH-06 and enhance transport infrastructure development in line with the PM Gati Shakti National Master Plan.\n\nThe statement said that upon completion, the Shillong-Silchar Corridor will play a pivotal role in regional economic growth, improving connectivity between Guwahati, Shillong, Silchar, Imphal, Aizawl and Agartala.\n\nThe project aligns with the government's vision of Atmanirbhar Bharat, enhancing infrastructure while generating employment and fostering socio-economic development in Meghalaya, Assam, Manipur, Mizoram and Tripura, it added.",
        "news_type": "Economic & Business"
    },
    {
        "title": "NHRC notices to Karnataka government, DGP over Hubballi minor’s ‘rape, killing’, death of accused in ‘police encounter’",
        "link": "https://www.thehindu.com/news/national/karnataka/nhrc-notices-to-karnataka-government-dgp-over-hubballi-minors-rape-killing-death-of-accused-in-police-encounter/article69509823.ece",
        "description": "Taking “suo-motu cognisance of a media report”, the commission has observed that the contents of the report, if true, indicate a “serious violation of the human rights of the victim minor girl, and the arrested suspected perpetrator, killed in an alleged encounter”.",
        "published_date": "Wed, 30 Apr 2025 17:02:25 +0530",
        "source": "The Hindu",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "The National Human Rights Commission (NHRC) on Wednesday (April 30, 2025) said it has issued notices to the Karnataka government and the State’s police chief over reports alleging the abduction, rape and killing of a girl and the death of the accused in a “police encounter” in Hubballi.\n\nThe report, sought within four weeks, is expected to include the “post-mortem examination” and “magisterial inquiry reports” of both the deceased, the NHRC said in a statement.\n\nThe NHRC has taken “suo-motu cognisance of a media report about the abduction, rape and murder of a minor girl and the death of the arrested accused in a police encounter in Hubballi, Karnataka. Reportedly, the incident happened on April 14,” it said.\n\nThe commission has observed that the contents of the news report, if true, indicate a “serious violation of the human rights of the victim minor girl, and the arrested suspected perpetrator, killed in an alleged encounter”.\n\nTherefore, the NHRC has issued notices to the chief secretary and director general of police of Karnataka, seeking a detailed report within four weeks, the rights panel said.\n\nAccording to the media report, published on April 14, soon after the girl’s body was found, people protested outside the Ashok Nagar police station, demanding the arrest of the accused, the statement said.\n\n“Reportedly, he was nabbed by the police within hours of the incident and was being taken for questioning when he tried to attack them, resulting in gunshot injuries to him, leading to his death,” it added.",
        "news_type": "Social Issues & Human Rights"
    },
    {
        "title": "Birth anniversary of 12th century social reformer Basaveshwar celebrated in Yadgir ",
        "link": "https://www.thehindu.com/news/national/karnataka/birth-anniversary-of-12th-century-social-reformer-basaveshwar-celebrated-in-yadgir/article69509785.ece",
        "description": "MLA Channareddy Patil Tunnur paid a floral tribute to the social reformer in Yadgir on April 30",
        "published_date": "Wed, 30 Apr 2025 16:48:54 +0530",
        "source": "The Hindu",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "The 12th century’s social reformer Basaveshwar fought against inequality to bring equality in society, MLA Channareddy Patil Tunnur said after inaugurating the 892th birth anniversary celebrations of Basaveshwar. He paid a floral tribute to the social reformer in Yadgir on April 30.\n\nMr. Tunnur said that Basaveshwar has struggled against social inequality by gathering saints from different castes through ‘Anubhava Mantap’. Because of his initiatives and awareness, many social evils were eradicated, he added.\n\n“Basaveshwar wasn’t only a philosopher and social reformer, but also a good administrator who protected the interests of the people under Bijjala’s rule. His dedication and honesty as a Minister under King Bijjala was highly appreciable. His thoughts brought many changes to society. He wrote vachanas (expression of thoughts via short passages) to eradicate social evils and superstitions,” the MLA said.\n\nCMC Chairperson Lalita Anapur and Deputy Commissioner B. Susheela also addressed the gathering.\n\nSubhashchandra Koulagi, principal of government degree college, gaven a special lecture on Basaveshwar.\n\nYUDA Chairperson Vinayak Malipatil, Superintendent of Police Pruthvik Shankar, Additional Deputy Commissioner Sharanabasappa Koteppagol, Assistant Commissioner of Yadgir sub-division Hampanna Sajjan, and district president of Veerashaiva Lingayat Mahasabha were among those present",
        "news_type": "Social Issues & Human Rights"
    },
    {
        "title": "Donald Trump blasts ‘not good at his job’ Jerome Powell again, claims to know more about interest rates — What he said",
        "link": "https://www.livemint.com/politics/trump-bashes-powell-touts-tariffs-at-rally-marking-100-days-11745975173775.html",
        "description": "Donald Trump's 100 Days: POTUS renewed criticism of Fed Chair Chairman Jerome Powell on April 29, while defending his own economic policies, incuding tariffs, at a rally in Michigan. &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp;",
        "published_date": "Wed, 30 Apr 2025 06:36:13 +0530",
        "source": "Mint Politics",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "United States President Donald Trump on April 29 has again taken jabs at Federal Reserve Chairman Jerome Powell for his economic policies, while touting his own tariffs policy during a rally to mark his 100th day in office, according to a Bloomberg report.\n\nSpeaking at the rally near Detroit, Michigan, Donald Trump blasted Jerome Powell saying: “Inflation is basically down and interest rates came down despite the fact that I have a Fed person who’s not really doing a good job.”\n\n“You’re not supposed to criticise the Fed. You’re supposed to let him do his own thing — but I know much more than he does about interest rates,” he added.\n\n‘Give Them Time Before Slaughter’, Says Donald Trump Donald Trump went on to tout his tariffs policy, calling it a flexible move aimed at giving companies time to comply before action is taken. He said tariffs are “a little flexibility” designed to offer companies time to move their manufacturing back to the US and warned: “We gave them a little bit of time before we slaughter them.”\n\nDonald Trump's Repeats Attacks on Jerome Powell The attacks came even after earlier in April Donald Trump said despite his criticisms over Jerome Powell's pace on interest rate cuts, he would not fire the central bank chief, the report noted.\n\nHis clarification came after already volatile markets (shaken by Trump tariffs) tumbled more over liklihood of Jerome Powell being replaced.\n\nDonald Trump Calls Plummeting Popularity in Surveys ‘Biased’ Donald Trump also addressed falling popularity in various polls on his economic agenda, calling them “biased”. He also framed tariffs as “necessary” ahead of his planned tax cuts legislation, which would remove income tax on tips, overtime pay and social security.\n\nHe also warned about possible Republican detractors, saying they should be challenged if they fail to support his agenda. “Remember who those grandstanders are and vote them the hell out of office,” Donald Trump said.\n\nDonald Trump's 100th Day Rally in Michigan — Highlights Donald Trump's 100 Days event marked the fabled benchmark of early presidential success before an audience caught squarely in the middle of his campaign to overhaul global trade and rebuild the US industrial base.\n\nMacomb County — which split 56 per cent for Trump in the 2024 presidential race — is emblematic of many former Democratic, blue-collar strongholds that were receptive to the president’s economic promises on the campaign trail. Winning those areas helped him easily return to the White House, sweeping all seven swing states and securing the popular vote.\n\nMany residents in places like suburban Detroit — home to plants tied to General Motors Co. and Stellantis NV — have championed Trump’s aggressive trade policy, seizing on his promises of revitalised domestic manufacturing and the resurgence of good-paying factory jobs.\n\nBut automakers are warning that stiff levies could cause plant shutdowns and job losses instead.\n\nAuto Plants: It wasn’t immediately clear whether the changes announced Tuesday would be enough to restart production halted in the wake of Trump’s earlier import duty announcements. Stellantis had previously paused production to adapt to the changes, causing temporary layoffs in Michigan and Indiana, as well as at a Canadian plant across the Detroit River.\n\nAnother potential test case for Trump lies just down the road at Stellantis’ Warren Truck Assembly Pant, where workers build the company’s Jeep Wagoneer and Grand Wagoneer SUVs. Sales have been underwhelming, and output was temporarily halted this month because of a shortage of engines, with a restart expected in early May.\n\nThe United Auto Workers, whose president Shawn Fain has praised Trump’s automotive tariffs, has pointed to Warren as evidence that Stellantis has capacity to build more cars and trucks in the US — and summon laid-off members back to work.\n\nDoug King, 30-year-old Stellantis employee attending Trump’s rally, said he was excited by the president’s trade vision and believes a boost to US manufacturing will happen “quicker than you think.”\n\n“He doesn’t want to hurt the companies. He’s trying to save the companies,” King said. “He’ll tweak deals — he’ll tweak everything — to make it work.”\n\nTrump told rallygoers his tariffs “haven’t even really kicked in yet,” but reiterated his belief he’d be able to broker deals even with countries such as China that thus far have refused to engage in serious negotiations. “I think it’s going to work out,” Trump said.\n\nApproval Rating: Trump’s 100-day victory lap comes despite polls showing his approval ratings sinking to the lowest level in decades for presidents at this milestone in their terms. Those marks have been driven down over concerns about his handling of the economy and fears of a potential recession.\n\nJust 39% of respondents in an ABC News/Washington Post/Ipsos poll said they approve of Trump’s performance as president, while a CNN survey marked a 41% approval rating.\n\nImmigration remains an area of relative strength for the Republican president who has intensified the government effort to deter border crossings and deport foreign nationals in the US illegally.\n\nTrump’s second term has also been marked by a campaign to rapidly remake the government, with billionaire Elon Musk leading a sweeping effort to slash federal spending and downsize the workforce.\n\nThe president has moved at breakneck speed to overhaul federal policy, having issued scores of executive orders setting in motion regulatory shifts and other changes on subjects ranging from appliance standards and artificial intelligence, to communications and coal.\n\nTrump is also presiding over a broad effort to overhaul Washington’s relationships overseas, having renewed his first-term push for European allies to boost NATO contributions, while demanding free passage for US vessels at the Panama Canal, discussing a potential acquisition of Greenland and musing about how Canada should serve as the 51st US state.\n\nTrump’s speech followed a visit to Selfridge Air National Guard Base with Michigan’s Democratic Governor Gretchen Whitmer. Later this week, the president is set to deliver a commencement address at the University of Alabama.",
        "news_type": "Political"
    },
    {
        "title": "Trump’s Confident He’ll Sign Ukraine Minerals Deal, Leavitt Says",
        "link": "https://www.livemint.com/politics/trumps-confident-he-ll-sign-ukraine-minerals-deal-leavitt-says-11745954515936.html",
        "description": "Donald Trump is “confident” a deal on critical minerals will be signed with Ukraine, the White House said, a move that could bolster US support for Kyiv as the US president grows frustrated over delays in clinching a ceasefire in Russia’s war on Ukraine.",
        "published_date": "Wed, 30 Apr 2025 00:51:55 +0530",
        "source": "Mint Politics",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "Donald Trump is “confident” a deal on critical minerals will be signed with Ukraine, the White House said, a move that could bolster US support for Kyiv as the US president grows frustrated over delays in clinching a ceasefire in Russia’s war on Ukraine.\n\n“It’s not just good for the United States to recoup the billions of tax dollars we’ve spent and onshore some of those critical minerals, but certainly it’s good for the Ukrainian people when this war is over, to rebuild their country,” White House Press Secretary Karoline Leavitt told reporters Tuesday.\n\n“He wants Ukraine to sign that deal, and he’s confident that they will,” she said.\n\nUkrainian and US negotiators are aiming to sign the minerals deal, which will govern postwar plans to exploit the country’s mineral deposits and rebuild its infrastructure, as soon as this week, a person familiar with the matter said.\n\nWashington and Kyiv are still trying to iron out some legal questions, including ensuring the text of the deal wouldn’t conflict with Ukraine’s prospects to join the European Union, the person said, speaking on condition of anonymity about the sensitive negotiations.\n\nThe US Treasury Department didn’t immediately respond to a request for comment.\n\nUS and Ukrainian officials signed a memorandum of intent earlier in April, and they continue to hash out the technical details of the accord, which would grant the US first claim on profits transferred into a special reconstruction investment fund that would be controlled by Washington. A previous attempt to clinch the minerals deal fell through earlier this year after Ukrainian President Volodymyr Zelenskiy clashed with Trump and Vice President JD Vance in the Oval Office.\n\nBoth sides overcame a key hurdle last week, when they agreed that the previously provided US aid to Kyiv won’t be calculated into the future economic partnership deal between the two countries, Ukrainian Prime Minister Denys Shmyhal said Sunday.\n\nThe push for the US-Ukraine minerals deal comes as the White House struggles to get Russia to agree to end Moscow’s three-year-long war on its neighbor. Russian President Vladimir Putin continues to make maximalist demands, insisting that Russia must take control of four regions of Ukraine it doesn’t fully occupy as part of any agreement to end his war, Bloomberg News reported earlier.\n\nLeavitt reiterated that Trump was getting frustrated with the difficulty in both Ukraine and Russia agreeing to a peace deal, but that “he remains optimistic that we can get this done.”\n\nWith assistance from Piotr Skolimowski, Daryna Krasnolutska, Daniel Flatley and Hadriana Lowenkron.\n\n©2025 Bloomberg L.P.",
        "news_type": "Political"
    },
    {
        "title": "Spain’s Toxic Politics Clouds Investigation Into Power Blackout",
        "link": "https://www.livemint.com/politics/spains-toxic-politics-clouds-investigation-into-power-blackout-11745954332783.html",
        "description": "Squabbles between Spain’s minority government and opposition parties are muddling efforts to find out and explain what caused a massive blackout that left Spain, Portugal and parts of France in the dark on Monday.",
        "published_date": "Wed, 30 Apr 2025 00:48:52 +0530",
        "source": "Mint Politics",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "(Bloomberg) -- Squabbles between Spain’s minority government and opposition parties are muddling efforts to find out and explain what caused a massive blackout that left Spain, Portugal and parts of France in the dark on Monday.\n\nWhile Spanish grid operator Red Eléctrica gathered millions of data points in a highly technical probe to determine what caused about two thirds of the country’s power supply to disappear from the grid, Prime Minister Pedro Sánchez drew the political battle lines of the blame game that’s already brewing, pushing back against claims that his government’s expansion of wind and solar was at fault.\n\n“It wasn’t a problem of an excess of renewables,” he told the media on Tuesday. Political rivals who are linking the network’s vulnerability to a Socialist-led withdrawal from nuclear power are “either lying or showing their ignorance.”\n\nWidespread confusion and a lack of clear leadership in the aftermath of a nationwide event aren’t new in Spain. Last October, a muddled response from local, regional and state authorities to unprecedented rains that killed over 200 people in Valencia led to such outrage that politicians on both sides of the aisle and even King Felipe II had actual mud thrown at them when they visited hard-hit villages.\n\nThe door to more frustration was opened as the causes for the worst outage in Europe in years remain murky more than 24 hours after millions were plunged into darkness.\n\nThe clearest response came from Red Eléctrica, which pointed a rapid combination of events over a five-second span. On Monday, with Spaniards reeling, technical personnel from the grid operator spoke to the public just over two hours after the power went out, while Sánchez appeared almost three hours later.\n\n“More than 20 hours have gone by and we have no explanation of what happened,” Alberto Núñez Feijóo, leader of the conservative People’s Party, told local media. “The impression we are giving is disgraceful.”\n\nThe hours of silence stoked fears of a cyberattack from a foreign power. It wasn’t until Tuesday morning that Red Eléctrica ruled that option out, based on preliminary analysis done with national cyber and security agencies.\n\nThat didn’t alleviate the confusion, as Sanchez said it was too soon to tell when the cause might be, and a judge on the country’s national court opened an investigation, saying “cyber terrorism is among the possibilities.”\n\nSanchez himself was asked about the likelihood that the blackout had been caused by a cyber attack at a press conference in Madrid.\n\n“It would be foolish to rule out any hypothesis,” the prime minister said, despite insisting that renewables weren’t to blame. “I’m not ruling it out, I’m not pointing to it.”\n\nSanchez is a polarizing figure in Spain after almost seven years, during which he’s managed to survive at the head of increasingly fragile coalitions through skillful maneuvering and, at times, seeking to demonize his conservative opponents. Last year, he threatened to quit politics over a criminal probe of his wife’s business affairs which he decried as a right-wing stitch-up.\n\nThe blackout on Monday shone an uncomfortable spotlight on the Sanchez government’s controversial position on phasing out nuclear power at a time when many countries are extending the lives of reactors or planning to build new ones. Núñez Feijóo said nuclear plants need to be retained as “backup power” for volatile solar and wind capacity.\n\nIn the meantime, experts are trying to gather the facts about what happened, and Portugal isn’t waiting for Spain and plans to request an independent audit of the incident from the European Union.\n\nThe longer the uncertainty persists, the more pressure Sanchez will face. Experts are already at odds about the role that solar and wind played. Spain had reported an unprecedented number of hours with negative power prices in recent months, a fallout from insufficient storage capacity available to soak up increasing amounts of solar and wind supply.\n\nSolar farms in particular inject large amounts of power into the grid during the day and go dark at night. While these swings can create instability for the grid, the variations haven’t previously caused blackouts in the country.\n\nFor critics of renewables, the blackout represents an opportunity to go the attack. They’ve argued that limited fossil-fueled generation in Spain meant there was insufficient inertia to help maintain the grid’s frequency. But that ignores the other sources of stabilizing inertia available, including nuclear, hydro and solar thermal.\n\n“A lack of inertia was therefore not the main driver for the blackout,” said Adam Bell, a power analyst in the UK. “Indeed, post the frequency event no fossil generation remained online — but wind, solar and hydro did.”\n\nOn Monday, just after noon and again about 15 minutes before the outage, the frequency of the grid started shifting unusually, indicating that the grid was under stress and needed to be stabilized, according to data provided to Bloomberg by Gridradar.\n\nOne clear lesson is that more investment is needed to ensure resilience of the system. More battery storage would have definitely helped as the technology could have responded “in a split second,” said Kesavarthiniy Savarimuthu, an analyst with BloombergNEF.\n\nOther European nations are watching closely, as they could face similar issues as the continent transition to clean energy to protect environment but also reduce dependencies on fossil fuel exporters.\n\n“The massive blackout here in Spain and Portugal is a brutal reminder of the importance of security of supply,” Ebba Busch, Sweden’s energy minister, said in a post on social media. “Renewables and more grids alone will not build the strong power system that the EU needs for our security and our competitiveness.”\n\n--With assistance from Daniel Basteiro, Thomas Gualtieri, Macarena Muñoz, William Mathis, John Ainger and Rachel Morison.\n\nMore stories like this are available on bloomberg.com",
        "news_type": "Political"
    },
    {
        "title": "‘Gayab’ and gone wild: Congress poster triggers BJP fury; netizens turn to Grok",
        "link": "https://www.livemint.com/politics/news/gayab-and-gone-wild-congress-poster-triggers-bjp-fury-netizens-turn-to-grok-11745916662089.html",
        "description": "Congress and the BJP locked horns in a fiery war of words, all sparked by a poster shared by the grand old party just days after the Pahalgam attack. As the political banter heated up, curious netizens turned to Grok to decode who exactly the ‘Gayab’ poster was throwing shade at",
        "published_date": "Tue, 29 Apr 2025 16:00:54 +0530",
        "source": "Mint Politics",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "Pahalgam terror attack: It has barely a week since the gruesome terror attacks in Jammu and Kashmir's Pahalgam, that killed 26 people. Now, the Congress and BJP have landed in a wild verbal duel on social media, after the grand old party came up with a new poster.\n\nTrying to decode what the Congress's message was, netizens even turned to AI tool Grok.\n\nWhat was the Congress' post about? Coming to the poster, that triggered the heated debate between the two parties, the highlight of the post is the word ‘gayab’ (missing), positioned over a headless figure.\n\nAlthough the figure has no face, it seemingly ‘wore’ a bandhgala kurta, churidar pyjama, and black footwear as its outfit.\n\nThe controversy escalated when Pakistan’s former minister reshared the poster with hashtag ‘Naughty Congress’. Since then the Congress has been receiving severe backlash from both the BJP and the internet users.\n\nFawad Hussain's post\n\n‘Acting like Pakistan’s sleeper cells': BJP In response, national in-charge of BJP's Information & Technology department, Amit Malviya slammed the Congress, claiming that the party leaders acted like “Pakistan's sleeper cells.”\n\n“ Congress leaders are acting like Pakistan’s sleeper cells. Just look at their irresponsible and reprehensible statements — going so far as to deny the victims’ families even dignity in death. Despite voluminous evidence and firsthand accounts from witnesses to the killings, the Congress, like an ostrich, seems to have buried its head in the sand,” Amit Malviya posted on X.\n\nHe even shared a poster, stating “ Congress = Pakistan's PR agents.”\n\nAmit Malviya slams Congress\n\nAnother BJP leader Lakshmi Singh wrote on X: “Gayab toh Congress and pakistan hoga bohut jald,” which loosely translates to: “Very soon, Pakistan and Congress will go missing.”\n\nWho is ‘gayab’? Grok answers Netizens, meanwhile, turned to Grok for an answer, asking the AI tool, who the Congress party was referring to as ‘Gayab’.\n\nGrok's reply to 'gayab' poster",
        "news_type": "Political"
    },
    {
        "title": "EU Bans Sale of ‘Golden Passports’ as Trump Opens Doors",
        "link": "https://www.livemint.com/politics/news/eu-bans-sale-of-golden-passports-as-trump-opens-doors-11745920410347.html",
        "description": "Malta’s “golden passports” program for wealthy investors violates European Union rules on citizenship, the bloc’s top court ruled in a case that could have transformed the EU into a haven for affluent foreigners at a time when President Donald Trump wants to entice them to the US.",
        "published_date": "Tue, 29 Apr 2025 15:23:29 +0530",
        "source": "Mint Politics",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "Malta’s “golden passports” program for wealthy investors violates European Union rules on citizenship, the bloc’s top court ruled in a case that could have transformed the EU into a haven for affluent foreigners at a time when President Donald Trump wants to entice them to the US.\n\nThe tiny island nation’s offer, which granted nationality to investors, among them Russian and Middle Eastern tycoons, celebrities and sports stars is illegal, the EU’s Court of Justice ruled on Tuesday.\n\nAn EU nation “cannot grant its nationality – and indeed European citizenship – in exchange for predetermined payments or investments, as this essentially amounts to rendering the acquisition of nationality a mere commercial transaction,” the Luxembourg-based EU court said.\n\nPresident Trump has recently made moves to lure rich foreign investors stateside. The so-called Trump Gold Card offers residency and a path to citizenship to investors who pay $5 million to the US treasury. U.S. Secretary of Commerce Howard Lutnick has claimed the government sold more than 1,000 visas on a single day in March.\n\nExplainer: What’s a Golden Visa and Where Can You Still Get One?\n\nMalta’s investor citizenship program, meanwhile, has allowed individuals to obtain citizenship so they can live and work there, with a minimum donation of €600,000 . The required investments also include buying a house, and voluntary donations are encouraged. As an EU nation, Maltese passports grant holders the freedom to live and work anywhere inside the 27-member bloc.\n\nThe Mediterranean island is one of a handful of European countries that have over recent years offered golden visas and passports, which gained popularity during the European debt crisis when nations started selling residency to attract foreign investment.\n\nPortugal, Ireland, Greece, Hungary had in recent years also launched such programs for the wealthy to get their hands on much-prized EU freedom of movement. But the offerings caused uproar from the European Commission — the bloc’s executive arm — which claimed cash-for-citizenship policies expose the EU to money laundering and security risks.\n\n“Countless cases have shown how these schemes have granted safe haven to corrupt actors from around the world and other suspicious individuals in the EU,” said Transparency International’s Chief Executive Officer Maíra Martini. “The ruling stops not only Malta from selling EU citizenship, but will also prevent other member states from doing the same.”\n\nIn September 2022, the Brussels-based authority filed a legal challenge against Malta’s program, claiming that “granting EU citizenship in return for pre-determined payments” is “not compatible with the principle of sincere cooperation enshrined” in the bloc’s rules.\n\nTuesday’s judgment is at odds with the non-binding opinion of an adviser to the EU tribunal, who said last year that it was for EU countries themselves to “determine who is entitled to be one of their nationals and, as a consequence, who is an EU citizen.”\n\n©2025 Bloomberg L.P.",
        "news_type": "Political"
    },
    {
        "title": "Australian woman sparks massive debate on cultural differences between India and the West. Find out why",
        "link": "https://www.livemint.com/news/india/australian-woman-sparks-debate-over-cultural-differences-between-india-and-the-west-indian-professionals-dependence-on-11746004559025.html",
        "description": "Australian woman’s video comparing cultural differences between India and the West has sparked a debate. The video highlights the dependence on domestic help in India and work-life balance issues. Reactions are mixed, with some agreeing and others offering contrasting views on chores and lifestyle",
        "published_date": "Wed, 30 Apr 2025 16:53:25 +0530",
        "source": "Mint News",
        "source_country": "India",
        "countries_mentioned": [
            "India",
            "Australia"
        ],
        "content": "An Australian woman has sparked a debate on social media after posting a video on Instagram discussing cultural differences between India and the West, particularly Indian professionals' dependence on domestic help for household chores.\n\nShe also mentioned that people in India lack work-life balance.\n\nWhat did the Australian woman say? Along with the video, Bree Steele, a podcast producer, wrote in her Instagram post: “Chores? Hardly know ‘em! This is one of the least talked-about cultural differences between India and the West.”\n\nComparing daily life in India with the West, Steele said that in the West, most people manage cooking and household chores alongside full-time jobs.\n\nBut, in India, most families have domestic workers for such tasks. “I don't cook or clean in India. Chores? I don't know them,” she said in her video.\n\n“Most middle-class to wealthy households in India have house help. Most people have someone who does their cleaning, maybe their washing and cooking,” she added.\n\nSteele further said: “I was like, that's what we do in the west. We do everything ourselves with full-time jobs.”\n\nAcknowledging that Indian professionals work for longer hours as compared to their counterparts in the West, the podcast producer said: “Over time, I've observed that my friends get work calls at like 9.30 in the night, and there's no work-life balance here. The expectation on corporate workers is just so high that if you're single, of course you don't have time to do your own cooking and cleaning (sic).”\n\n“And for better or for worse, labour is cheap in India, so it makes sense that everyone has their own house help,” she added.\n\nConcluding her video, Steele admitted that she feels “ashamed” at how much she enjoys not having to cook or clean every day.\n\nSocial media reactions In reaction to Steele’s video, users on social media were divided. While some agreed with her, others expressed different opinions.\n\nHere are some reactions:\n\n“What a keen observation and so well expressed, my girl!! It’s really not talked about enough, but you’ve nailed both sides!!!”\n\n“Don’t forget, y’all have machines: dishwashers, vacuum cleaners, etc. Also, it’s very dusty here, so we have to clean our floors every day.”\n\n“Sometimes I feel we have it easy in India, and yet I don’t know why we keep chasing Western standards. But maybe it’s because we’ve always seen the glamourised end of it, never the hard-hitting reality. Thanks for putting it out here. I hope you're having fun in India.”\n\n“As someone who grew up in India with so-called privileges and then moved to the West and does all the chores, I’ll pick the West every single time. Despite the chores, I still have a LOT of spare time that I spend on my hobbies and health. Despite all the help in India, I lived an unhealthy and tired life.”",
        "news_type": "Social Issues & Human Rights"
    },
    {
        "title": "SC stays CBI probe against Kerala CM's top advisor in a DA case. Who is KM Abraham?",
        "link": "https://www.livemint.com/news/india/sc-stays-cbi-probe-against-kerala-cms-top-advisor-in-a-da-case-who-is-km-abraham-11746009844787.html",
        "description": "Since May 2021, Abraham has been attached to the Chief Minister’s Office (CMO). In 2024, the Vijayan government accorded Cabinet minister rank to Abraham, making him even more powerful than a serving chief secretary of the state.",
        "published_date": "Wed, 30 Apr 2025 16:53:23 +0530",
        "source": "Mint News",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "The Supreme Court on 30 April stayed an order directing the Central Bureau of Investigation (CBI) to file an FIR and start a probe against Kerala Chief Minister Pinarayi Vijayan's chief principal secretary KM Abraham in a disproportionate assets (DA) case.\n\nA bench of Justices Dipankar Datta and Manmohan issued notice to the CBI, Kerala government and the complainant on an appeal filed by Abraham, a retired IAS officer and the CM's chief principal secretary.\n\nSenior advocate R Basant, appearing for Abraham, said that the FIR under the Prevention of Corruption Act cannot be registered without mandatory sanction under Section 17A of the law.\n\nThe Kerala High Court on 11 April ordered a CBI probe against Abraham on the plea filed by activist Jomon Puthenpurackal.\n\nThe high court observed a careful analysis of the preliminary inquiry report, other materials and Abraham's defence \"prima facie indicated he possessed \"movable and immovable properties disproportionate to his known sources of income\".\n\nThe probe by the Vigilance and Anti-Corruption Bureau (VACB) in the matter, it said, wouldn't \"instil confidence in the public\" and the credibility of its enquiry was \"doubtful\".\n\nThe high court, while ordering the CBI probe, set aside a 2017 order of the enquiry commissioner-cum-special judge in Thiruvananthapuram, who rejected the petitioner's complaint against Abraham.\n\nThe high court said the special judge ought to have appreciated the petitioner's contentions with regard to the various properties, worth crores, acquired by Abraham that were excluded from consideration by the VACB enquiry officer.\n\nWho is KM Abraham? Abraham is a 1982-batch IAS officer of Kerala cadre, who has been the chief secretary of the state too. Abraham is also a former whole-time member of the market regulator Securities and Exchange Board of India (SEBI).\n\nSince May 2021, Abraham has been attached to the Chief Minister’s Office (CMO). In 2024, the Vijayan government accorded Cabinet rank to Abraham, making him even more powerful than a serving chief secretary of the state.\n\nAbraham shot to the limelight for the first time many years ago. As a whole-time director of SEBI from 2008-2011, Abraham, the then in charge of secondary markets, probed the Sahara India investor fraud scandal about raising funds from the stock market. Abraham directed the Sahara Group to refund the money mobilised from investors. His direction was later upheld by the Supreme Court of India.\n\nAbraham holds an MTech degree from IIT-Kanpur and a PhD degree from the University of Michigan in the US. During his service as IAS officer, he was posted with the Kerala's finance department. During the Congress regime in Kerala (2011-2016), Abraham served as additional chief secretary for finance. Even after the Vijayan-led Left government came to power, Abraham continued at the helm of the finance department. He became the chief secretary in 2017.\n\nIn the news as CEO of KIIFB Abraham has been in the news recently as CEO of Kerala Infrastructure Investment Fund Board or KIIFB, floated in 2016 to mobilise funds from the open market to invest in infrastructure.\n\nIn 2022, the ED registered a case against KIIFB alleging violations of the Foreign Exchange Management Act (FEMA) in connection with raising ₹ 2,150 crore masala bonds listed on the London Stock Market. The ED served a summons to Abraham, among others, in the case.\n\nThe petitioner in the now-stayed CBI case alleged Abraham, during service, acquired an apartment worth ₹3 crore in Mumbai, another apartment worth ₹1 crore at Thycaud in Thiruvananthapuram and constructed a three-storey shopping complex at Kadappakkada in Kollam district worth ₹8 crore.\n\nThe FIR under the Prevention of Corruption Act cannot be registered without mandatory sanction under Section 17A of the law.\n\nAbraham has denied all the allegations.",
        "news_type": "Crime & Law"
    },
    {
        "title": "Company faces backlash after live-streaming employees working over the weekend, ‘We are corporate slaves’",
        "link": "https://www.livemint.com/news/world/company-faces-backlash-after-live-streaming-employees-working-over-the-weekend-we-are-corporate-slaves-11746011514692.html",
        "description": "The company faced criticism for live-streaming weekend work to demonstrate transparency. While some employees appreciate the benefits, others worry about the implications of voicing dissatisfaction in a monitored environment.",
        "published_date": "Wed, 30 Apr 2025 16:48:59 +0530",
        "source": "Mint News",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "A snack company in China called Miaohuo Net has faced strong criticism after live-streaming its employees working in the office on the weekend. The company, based in Zhengzhou, Henan province, said the idea was to build customer trust by showing their real working process.\n\nThey used a popular video app to stream about 15 staff members working. According to the company’s owner, Mr Xing, this has been done before. It shows they are “honest and transparent” in their work.\n\n“Some companies claim to have a team but actually outsource their work; we want to assure people that we are a legitimate company with a dedicated team,” the South China Morning Post quoted Xing as saying.\n\nMiaohuo Net has 50 employees, but 2023 data shows insurance was provided for only 13. The company gives two-day weekends, but some workers choose to work extra on weekends to finish tasks. They are paid for the overtime.\n\nOwner Xing said the cameras were clearly visible during the live-streams, and no staff complained. An employee named Duan said he was fine being filmed and compared it to people live-streaming at tourist spots.\n\nAccording to the employee, the company offers good benefits like overtime pay and yearly trips. Such things keep him happy.\n\nSocial media reactions The decision to live-stream, however, did not go well with social media users.\n\nOne of them commented, “How can any employee voice dissatisfaction in this environment? It would imply that they are not committed to working hard enough.”\n\nOne of them wrote, “We are corporate slaves, expected to follow our bosses’ orders without the ability to say no.”\n\nWhat does the law say? China’s Civil Code bans using someone’s image without consent. Labour laws say overtime should not cross three hours a day or 36 hours a week. As per the law, they should get at least one day off.",
        "news_type": "Social Issues & Human Rights"
    },
    {
        "title": "‘Caste census to be part of National Census’: Union Minister Ashiwini Vaishnaw",
        "link": "https://www.livemint.com/news/india/centre-announces-caste-census-to-be-part-of-census-11746010038080.html",
        "description": "Union Minister Ashiwini Vaishnaw said that the Centre will include caste enumeration in the upcoming national census, criticising opposition parties for conducting politically motivated caste surveys. He asserted the need for transparency and integration of caste data within the census framework.",
        "published_date": "Wed, 30 Apr 2025 16:20:08 +0530",
        "source": "Mint News",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "The central government on Wednesday announced that caste enumeration will be a part of the National Census, an ANI report said.\n\nAccording to the report, Union Minister for Railways and Information & Broadcasting, Electronics & Information Technology Ashwini Vaishnaw said, “Cabinet Committee on Political Affairs has decided today that Caste enumeration should be included in the forthcoming census.” Vaishnaw did not announce a date for beginning the census.\n\nHe also said that the census comes under the purview of the Centre but some states have done caste enumeration in the name of surveys.\n\nVaishnaw slams Congress Alleging that the states ruled by opposition parties have done caste surveys for political reasons, the minister said it is PM Modi government's resolve to transparently include caste enumeration in the forthcoming pan-India census exercise, the report added.\n\nVaishnaw also accused the Congress and its INDI alliance parties to have “used the caste census only as a political tool”. “Congress governments have always opposed the caste census. In 2010, the late Dr Manmohan Singh said that the matter of caste census should be considered in the Cabinet. A group of ministers was formed to consider this subject,” he said.\n\n“Most of the political parties have recommended a caste census. Despite this, the Congress government decided to conduct a survey of caste or a caste census. It is well understood that Congress and its INDI alliance partners have used the caste census only as a political tool,” Vaishnaw was quoted as saying in the report.\n\n“Some states have conducted surveys to enumerate castes. While some states have done this well, some others conducted such surveys only from a political angle in a non-transparent way. Such surveys created doubts in society. To ensure that our social fabric is not disturbed by politics, caste enumeration should be included in the census instead of surveys,” he added.\n\nThe population survey, which is conducted once every decade, was due in 2021, but was delayed by the pandemic and technical and logistical hurdles.\n\nWhat is Caste Census? Just like a national census collects data on the age, gender, and demographical composition, a caste census is a population survey that collects data on the caste composition of a region or a country.\n\nIndia has published caste data (from 1951 to 2011) of the Scheduled Castes and Scheduled Tribes only. In October 2023, findings of Bihar's caste survey were released by then state CM Nitish Kumar. The survey had said that Other Backward Classes and Extremely Backward Classes constituted 63 per cent of the state's total population.\n\nThe EBCs (36 per cent) were the largest social segment in Bihar followed by the OBCs at 27.13 per cent.\n\nKarnataka's original caste census report 'missing’? The BJP in Karnataka on Tuesday alleged that the original caste census report, prepared by the state government is missing, and claimed that it was currently with Chief Minister Siddaramaiah.\n\nAccording to a PTI report, the BJP, along with some ruling party MLAs, raised some concerns over the alleged shortcomings in the original socio-economic and educational survey report, also referred to as the caste census report.\n\nLeader of Opposition in the Karnataka Assembly R Ashoka had alleged that the entire report was \"bogus\" and called for a judicial probe into it. He further alleged that the original report is with the CM.\n\nHe was referring to the purported letter written to the government by former chairperson of the Karnataka State Backward Commission K Jayaprakash Hegde stating that the original copy of the caste census report was not available.",
        "news_type": "Political"
    },
    {
        "title": "Courts can modify arbitral awards, rules the Supreme Court",
        "link": "https://www.livemint.com/news/india/supreme-court-arbitration-in-india-arbitral-awards-modification-judicial-intervention-in-arbitration-dispute-resolution-11746005580356.html",
        "description": "The Supreme Court clarified courts can make changes, such as correcting calculation errors, adjusting interest, or making other simple changes, without nullifying the entire arbtiral award.",
        "published_date": "Wed, 30 Apr 2025 15:48:44 +0530",
        "source": "Mint News",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "Indian courts can, under limited circumstances, modify arbitral awards, ruled a Constitution Bench of the Supreme Court on Wednesday. So far, Indian courts could only uphold or set them aside.\n\nThe five-judge bench, led by Chief Justice of India Sanjiv Khanna, ruled that courts can modify arbitral awards in accordance with Sections 34 and 37 of the Arbitration and Conciliation Act, 1996. Section 34 allows parties to apply for setting aside an arbitral award, while Section 37 deals with appeals against such orders.\n\nThe other four members of the bench hearing Gayatri Balasamy v. ISG Novasoft Technologies Ltd were Justices B.R. Gavai, Sanjay Kumar, K.V. Viswanathan, and Augustine George Masih.\n\nThe apex court clarified that courts can do so in rare instances, such as correcting calculation errors, adjusting interest, or making other simple changes, without nullifying the entire award. In exceptional cases, Article 142 of the Constitution can also be invoked, but only in a limited manner.\n\nJustice K.V. Viswanathan dissented. He expressed concerns about the court’s authority to modify post-award interest and use Article 142 for such modifications, suggesting that any necessary changes should be handled by remitting the matter back to the arbitral tribunal.\n\nThe majority ruling can reshape India's arbitration landscape, as it eliminates the need for businesses to re-arbitrate disputes from scratch, reducing costs and delays.\n\nAlso Read: Supreme Court could reshape arbitration. Businesses are watching. At the same time, the ruling could also lead to more litigation, undermining the utility of arbitration as an alternative to court battles.\n\nThe case diary Gayatri Balasamy, a senior executive at ISG Novasoft Technologies, resigned in 2005, alleging sexual harassment by chief executive Krishna Srinivasan. The company did not accept her resignation and instead issued three termination letters. Balasamy filed criminal complaints, while ISG countered with defamation and extortion charges.\n\nThe dispute went to arbitration, where the tribunal awarded Balasamy ₹2 crore in compensation. She challenged the award in the Madras high court, claiming it ignored key parts of her case. In 2014, a single judge increased the award by ₹1.6 crore. However, in 2019, a division bench reduced the award drastically to ₹50,000, calling the increase excessive.\n\nBalasamy appealed to the Supreme Court, which in 2024 referred the issue of judicial power to modify arbitral awards to the five-judge Constitution Bench.\n\nAlso Read: India's bid to be arbitration hub hit by mediator council delay The top court ruling comes as the Union law ministry considers amendments to the Arbitration and Conciliation Act. Public consultations on a draft bill closed last November.\n\nExperts believe that granting courts greater power over arbitration outcomes may push businesses to adjust their dispute resolution strategies, potentially favouring arbitration hubs such as Singapore, London, or Dubai over India to minimise legal uncertainty.\n\nCountries like the UK, US, and Singapore already allow courts to adjust domestic arbitration awards, but India's legal framework does not distinguish between domestic and international arbitration, treating both types of cases the same.",
        "news_type": "Crime & Law"
    },
    {
        "title": "Andhra Congress chief YS Sharmila alleges being under house arrest in Vijayawada",
        "link": "https://www.cnbctv18.com/india/politics/andhra-congress-chief-ys-sharmila-alleges-being-under-house-arrest-in-vijayawada-19596733.htm",
        "description": "No description",
        "published_date": "Wed, 30 Apr 2025 11:42:04 +0530",
        "source": "CNBC Politics",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "\n\nAndhra Pradesh Chief Minister garu,\n\nWhy am I house arrested in my villa in Vijaywada? for what reason ? Pls tell the people of AP.\n\nJust going to my work place- the PCC office @INC_Andhra is a crime now? Why are you trying to curtail our constitutional rights? What is your govt…\n\n— YS Sharmila (@realyssharmila) April 30, 2025\n\nAndhra Pradesh Congress President YS Sharmila on Wednesday alleged being under house arrest at her residence in Vijayawada. Addressing Chief Minister Chandrababu Naidu, she questioned the reason behind the restriction on her movement.In an X Post, she wrote, “Andhra Pradesh Chief Minister garu, Why am I house arrested in my villa in Vijayawada? For what reason? Pls tell the people of AP.” She also tagged Chief Minister Chandrababu Naidu, Deputy Chief Minister Pawan Kalyan and the Andhra Pradesh police.Sharmila further asked if going to her workplace at the PCC office was a crime and wondered what the government feared. “Just going to my workplace- the PCC office @INC_Andhra is a crime now? Why are you trying to curtail our constitutional rights? What is your govt afraid of?” she added.Earlier, she asked the state government to complete the Polavaram Project in its original capacity, as specified in Section 90 of the Andhra Pradesh Reorganisation Act of 2014, which makes it a national project. Sharmila added that the plans to cut the project's size, and therefore its storage capacity, from 194 TMC (Thousand Million Cubic feet) to 114 TMC were a ‘gross injustice’.Speaking with ANI, she said, “Be it Jagan Mohan Reddy or Chandrababu Naidu, they are acting in coalition with the BJP, and everybody is scheming to reduce the project size. This is a gross injustice. We demand that Chandrababu Naidu and PM Modi finish the project and execute the project at the original 194 TMC water capacity.\"\"Together, we have gathered with the Polavaram Project victims. They have come here to explain to us how injustice is being done to them. 1 lakh 6 thousand families have given up their lands to make the Polavaram Project a reality.\"“After almost 20 years, even 10% of those families have not received any benefits. Rehabilitation packages have been given to fewer than 9,000 families, so many are still waiting for the government. Girijans, from the Girija tribe, have given up their lands,” she added.",
        "news_type": "Political"
    },
    {
        "title": "Congress writes to PM Modi for a special Parliament session in wake of Pahalgam terror attack",
        "link": "https://www.cnbctv18.com/india/politics/congress-writes-to-pm-narendra-modi-for-special-parliament-session-pahalgam-terror-attack-rahul-gandhi-mallikarjun-kharge-19596014.htm",
        "description": "No description",
        "published_date": "Tue, 29 Apr 2025 10:30:15 +0530",
        "source": "CNBC Politics",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "\n\nMy letter to PM Modi requesting a special session of both houses of Parliament to be convened at the earliest.\n\nAt this critical time, India must show that we always stand together against terrorism. pic.twitter.com/7AIXGqBqTl\n\n\n\n— Rahul Gandhi (@RahulGandhi) April 29, 2025\n\n\n\nMy letter to @PMOIndia, Shri @narendramodi, on convening a special session of both houses of the Parliament at the earliest.\n\n“At this moment, when unity and solidarity is essential, Opposition believes that it is important to convene a special session of both houses of… pic.twitter.com/DPsGhAPJhr\n\n\n\n— Mallikarjun Kharge (@kharge) April 29, 2025\n\nCongress President Mallikarjun Kharge and Leader of Opposition in Lok Sabha Rahul Gandhi have written separately to Prime Minister Narendra Modi, requesting for a special session of Parliament to address the recent Pahalgam terror attack.The call for a special sessions comes in the aftermath of the tragic assault on April 22, that left 26 people dead, most of them tourists, which prompted national grief and widespread condemnation.India has pointed to \"cross-border linkages\" in connection with the Pahalgam attack and has pledged stringent action against those responsible.Gandhi sent a letter to prime Minister Modi, underlining the need for Parliament to show a unified stand against acts of terror.\"The terrorist attack in Pahalgam has outraged every Indian. At this critical time, India must show that we will always stand together against terrorism,\" he said in the letter.\"The Opposition believes that a special session of both Houses of Parliament should be convened, where the representatives of the people can show their unity and determination,\" Gandhi added.Sharing the letter on X (formerly Twitter), Gandhi reiterated that \"India must show that we always stand together against terrorism.\"The Congress President also wrote a letter to PM Modi emphasising the need for a prompt and united political response. \"At this moment, when unity and solidarity is essential, Opposition believes that it is important to convene a special session of both houses of Parliament at the earliest,\" he said.Highlighting the importance of demonstrating collective political will, Kharge added, \"This will be a powerful demonstration of our collective resolve and will to deal with the brutal terror attack in Pahalgam on innocent citizens on 22 April 2025. It is our fond hope that the session will be accordingly convened.\"",
        "news_type": "Political"
    },
    {
        "title": "Pahalgam Terror: Congress issues gag order on members in 'most sensitive of times' — what sparked the row",
        "link": "https://www.cnbctv18.com/india/politics/pahalgam-terror-attack-congress-gag-order-on-members-what-sparked-the-row-mla-comments-backlash-bjp-rahul-gandhi-kharge-jairam-ramesh-19595675.htm",
        "description": "No description",
        "published_date": "Mon, 28 Apr 2025 17:54:40 +0530",
        "source": "CNBC Politics",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "\n\nThe Congress Working Committee had met on April 24th 2025 and passed a resolution on the brutal terror attack on tourists in Pahalgam two days earlier. Therafter on April 25th 2025 the Congress President and the Leader of the Opposition in the Lok Sabha attended the all-party…\n\n— Jairam Ramesh (@Jairam_Ramesh) April 28, 2025\n\nFollowing the backlash over remarks by several Congress leaders regarding the Pahalgam terror attack, the party has issued a directive asking its members to refrain from making independent statements.Congress MP and Spokesperson Jairam Ramesh took to X (formerly Twitter) to clarify the party's stance, while asking other members to show restraint while speaking to media in what he called as \"most sensitive of times.\"\"The Congress Working Committee (CWC) had met on April 24th 2025 and passed a resolution on the brutal terror attack on tourists in Pahalgam two days earlier. Thereafter on April 25th 2025 the Congress President and the Leader of the Opposition in the Lok Sabha attended the all-party meeting and put forward the party's views,\" Ramesh wrote on X.\"Some Congress leaders have been speaking to the media. They speak for themselves and do not reflect the INC's views. There should be absolutely no doubt whatsoever at this most sensitive of times that the CWC resolution, the views expressed by Shri Mallikarjun Kharge and Shri Rahul Gandhi and the views of authorised AICC office-bearers ALONE represent the position of the INC,\" he added.Kharge and Gandhi had reiterated their support for the government's response at the all-party meeting, called on by the government.Congress MLA Vijay Wadettiwar stirred a controversy with his comments questioning the account of the victims.\"The government should take responsibility for the Pahalgam terrorist attack. They (government) are saying that terrorists killed people after asking them (about their religion). Do terrorists have time for all this? Some people say that this did not happen,\" he was quoted as saying by ANI.\"Terrorists have no caste or religion. Catch those who are responsible and take action. This is the sentiment of the country,\" he added. However, after facing criticism over the remarks, he clarified on X, stating that the party supports \"whatever action the government takes.\"\"Conspiracy to attack the unity of India. The main purpose of the terrorist attack in Pahalgam is to create a rift between two religions, disrupt the unity of India and create instability in the country. Strictest action should be taken against terrorists and those who support them,\" he wrote on X, sharing a video of himself, clarifying for his comments.\"Congress supports whatever action the government takes. It is imperative to break such anti-national tendencies for the integrity and national security of India. India is one and will remain one,\" he added.Congress MP Jairam Ramesh told ANI that the party has nothing to do with such views. \"What individual Congress leaders are saying is their view. The views of the Congress are the views expressed in the resolution of the CWC,\" he said.Ramesh also stated that though there have been security lapses and intelligence failures, we need \"unity, solidarity, a collective will, a collective response and constant communication\" between the central government and the Opposition.The Bharatiya Janata Party (BJP) criticised the Congress leaders' statements, calling them shameless and irresponsible.Union Minister Ravi Shankar Prasad called out Karnataka CM Siddaramaiah, Vijay Wadettiwar, Karnataka minister RB Timmapur and Gandhi's brother-in-law Robert Vadra.\"Do Rahul Gandhi and Mallikarjun Kharge have no control over their party? Or both of them made pro forma comments while letting others the freedom to speak as they wished,\" Prasad was quoted as saying by PTI.",
        "news_type": "Political"
    },
    {
        "title": "Pahalgam terror attack hollowed us, have no words to seek apology, says J&K CM Omar",
        "link": "https://www.cnbctv18.com/india/politics/pahalgam-terror-attack-hollowed-us-have-no-words-to-seek-apology-says-j-k-cm-omar-19595517.htm",
        "description": "No description",
        "published_date": "Mon, 28 Apr 2025 14:16:17 +0530",
        "source": "CNBC Politics",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "Jammu and Kashmir Chief Minister Omar Abullah condemned the Pahalgam terror attack while seeking an apology from the family of victims in the deadly strike.On April 22 afternoon, 26 people, mostly tourists, were killed by a group of armed terrorists opened fire in Jammu and Kashmir's Pahalgam town. The attack happened in Baisaran, about six kilometres from the resort town of Pahalgam.Addressing a special session of the Assembly, Omar said, \"Neither of us supports this attack. This attack has hollowed us. We are trying to find a ray of light in this...In the last 26 years, I have never seen people come out to protest against an attack like this...\"Omar is also the tourism minister of J&K. He admitted his failure to send tourists safely back home. \"An attack of such a large scale has been carried out after 21 years in Baisaran... I did not know how to apologise to the families of the deceased... Being the host, it was my duty to send the tourists back safely. I couldn't do it. I do not have the words to seek an apology.\"He added that he won't demand statehood for Jammu and Kashmir at the cost of 26 lives. \"I will not use this moment to demand statehood. After Pahalgam, with what face can I ask for statehood for Jammu and Kashmir? Meri kya itni sasti siyasat hai? (Is my governance so cheap?) We have talked about statehood in the past and will do so in the future too, but it will be shameful on my part if I go and tell the central government that 26 people have died, now give me statehood,\" he said.The Assembly passed a resolution condemning the Pahalgam attack. The resolution was moved by Deputy Chief Minister Surinder Choudhary during a special session of the Assembly which began with the members observing a two-minute silence to pay homage to those killed in the tragedy last week.\"The Legislative Assembly of Jammu and Kashmir reaffirms its unwavering commitment to foster an environment of peace, development, and inclusive prosperity for all its citizens, and to resolutely defeat the nefarious designs of those who seek to disturb the communal harmony and progress of the nation and of Jammu and Kashmir,\" the resolution stated.The deputy chief minister said, \"This House expresses its profound shock and anguish over the barbaric and inhumane attack perpetrated on innocent civilians at Pahalgam on April 22.\" This House unequivocally condemns the heinous, cowardly act that resulted in the loss of innocent lives, he said.",
        "news_type": "Conflict & War"
    },
    {
        "title": "TN ministers Senthil Balaji and Ponmudy resign, Mano Thangaraj makes comeback",
        "link": "https://www.cnbctv18.com/india/politics/tn-ministers-senthil-balaji-and-ponmudy-resign-mano-thangaraj-makes-comeback-dmk-stalin-19595411.htm",
        "description": "No description",
        "published_date": "Mon, 28 Apr 2025 11:57:12 +0530",
        "source": "CNBC Politics",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Tamil Nadu Ministers V Senthil Balaji and K Ponmudy resigned from the MK Stalin-led state cabinet, and the Governor has accepted the same, the Raj Bhavan said on Sunday (April 27).Governor RN Ravi has approved Chief Minister Stalin's recommendation on their resignation, a Raj Bhavan communique said.Opposition AIADMK claimed victory for its protests against Ponmudy, while its ally BJP said the \"removal\" of the two from the state cabinet was \"late.\" Senthil Balaji, facing ED probe in a cash-for-jobs scam in an earlier AIADMK regime, had been asked by the Supreme Court on Wednesday to make a choice \"between post and freedom\" as it had warned him of cancelling bail if he did not step down as minister.\"When you were a minister, categorical findings have been recorded against you in the manner in which you brought about the settlement, and the proceedings are quashed. The grant of bail does not mean the power to influence witnesses. In the past, you have influenced witnesses,\" the bench had said.The top court, as a result, offered him a choice.\"So, you have to choose between the post and the freedom. Such drastic findings are recorded against you in your capacity as a minister,\" the bench had said while hearing pleas to recall Balaji's bail on the ground that he influenced witnesses in the case.Balaji was sworn in as a minister by Ravi on September 29, 2024, after being granted bail by the SC. He had earlier resigned in February 2024, months after remaining as a minister without portfolio in the wake of his June 2023 arrest by the Enforcement Directorate (ED).Upon his re-induction last year, he was assigned the same key portfolios — electricity, non-conventional energy development, prohibition, and excise that he held previously in the Stalin cabinet.Ponmudy, a senior DMK leader, had courted a major controversy recently over his Shaivite-Vaishnavite remarks made in the context of a sex worker, drawing widespread criticism, even as the Madras High Court later initiated proceedings on its own on the matter.Though he had been removed from a key party post, there were demands from opposition parties and other quarters for his ouster from the cabinet.Transport Minister S S Sivasankar will handle the Electricity portfolio, held by Senthil Balaji. Further, Housing Minister S Muthusamy has been allotted Excise and Prohibition, held by Senthil Balaji.RS Rajakannappan has been allotted Ponmudy's Forests and Khadi, in addition to his existing Milk and Dairy Development portfolio, the release said.Further, the Governor has accepted the CM's recommendation to include Padmanabhapuram MLA T Mano Thangaraj in the cabinet, it said. He was dropped in an earlier cabinet rejig.The swearing-in of the minister designate will be held at 6 PM on Monday, it added.Responding to the development, principal opposition party AIADMK said Ponmudy stepping down was a victory for its various protests against him.Balaji's exit was a \"justice\" ensured through the court, it said on its official 'X' handle.BJP state vice-president Narayanan Thirupathy said, \"Removal of Senthil Balaji & Ponmudi from Tamil Nadu ministry is expected, though late.\" \"It is not a shame on them but on Chief Minister MK Stalin for his misrule, corrupt government, maladministration and mismanagement,\" he said in a social media update.",
        "news_type": "Political"
    },
    {
        "title": "Inside India's richest state's new plan to boost shipbuilding",
        "link": "https://www.cnbctv18.com/photos/budget/maharashtra-shipbuilding-repair-and-recycling-policy-2025-details-19596911.htm",
        "description": "No description",
        "published_date": "Wed, 30 Apr 2025 14:48:32 +0530",
        "source": "CNBC Economics",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "1 / 9\n\nIn a significant step towards boosting India’s maritime capabilities, the government of Maharashtra has unveiled a comprehensive Shipbuilding, Ship Repair, and Ship Recycling Policy 2025, aimed at making India's richest state a leader in maritime manufacturing and services. (A grab from the livestream of the IMEC summit in Mumbai on April 28).\n\n2 / 9\n\nThe new policy aims to take Maharashtra’s share of shipbuilding and repair capacity within India from 11% to 33% by 2030. It will promote dedicated shipyards, and ship recycling, facilities, and build a favourable ecosystem by leveraging the state’s coastal infrastructure. File image: Garden Reach Shipbuilders.\n\n3 / 9\n\nThe state will offer capital subsidies of up to 15% of project costs and financial support for workforce training and R&D — including up to ₹5 crore for technological innovation. The policy encourages private sector participation through transparent land allotments by the Maharashtra Maritime Board and offers land at concessional rates or long-term leases to incentivise investment. File image: Chowgule shipyard\n\n4 / 9\n\nThe government will also focus on building strategic infrastructure such as integrated maritime clusters, modern dry docks, and support facilities. It also promises to simplify approvals, ensure water, electricity, and road connectivity, and support green recycling in line with international environmental standards.\n\n5 / 9\n\nBy 2030, the policy aims to attract ₹6,600 crore in investment and generate over 40,000 jobs. This figure is projected to rise sharply by 2047, with anticipated investments of ₹18,000 crore and over 3.3 lakh new employment opportunities in the maritime sector. Stock image source: Canva\n\n6 / 9\n\nMaking India one of the top 10 shipbuilding nations by 2030, and one of the top five by 2047, is the government’s stated goal. China, Japan, and South Korea own over 93% of all the ships in the world. India ranks 21st globally in building ships. However, the country ranks second in ship recycling with a 32.6% share. Stock image source: Canva\n\n7 / 9\n\nTo address these, the Union government has already set aside ₹25,000 crore under the Maritime Development Fund and provided ₹4,000 crore under the shipbuilding support policy from 2016 to 2026. Indian ships are also now given preference in tenders and charters, along with tax reliefs. Stock image source: Canva\n\n8 / 9\n\nWhile the opportunities in the shipbuilding ecosystem are vast, the challenges are equally complex. Low labour productivity, a lack of ancillary industries, limited capital, and outdated technology have all held back India’s progress in this sector. FILE PHOTO: A vessel under construction at a shipyard of Huanghai Shipbuilding Co in Weihai, Shandong province, China November 6, 2018. REUTERS/Stringer\n\n9 / 9",
        "news_type": "Economic & Business"
    },
    {
        "title": "Coldplay’s Ahmedabad concert brought ₹641 crore economic impact, finds EY-Parthenon",
        "link": "https://www.cnbctv18.com/entertainment/coldplay-music-of-spheres-ahmedabad-concert-economic-impactindia-ey-parthenon-report-19596747.htm",
        "description": "No description",
        "published_date": "Wed, 30 Apr 2025 11:53:06 +0530",
        "source": "CNBC Economics",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Coldplay’s two-night concert at the Narendra Modi Stadium in January 2025 generated an estimated ₹641 crore in economic impact, according to a report jointly released by EY-Parthenon and BookMyShow Live. The report, titled India’s Rising Concert Economy, assesses the financial, infrastructural, and policy ripple effects of one of India’s largest-ever live music events.The concert — part of Coldplay’s Music of the Spheres world tour — saw an audience of over 222,000 people from across India and abroad, marking a significant moment in the evolution of India’s live entertainment sector.Direct contribution to Ahmedabad’s economy through consumer spending on hotels, local transport, dining, and retail.GST revenue collected by the government.The remaining impact includes indirect and induced economic activity such as employment generation, logistical support, and ancillary services.According to the report, the concert resulted in over 15,000 jobs, including security, logistics, F&B, housekeeping, and volunteers. Around 9,000 personnel were sourced from Ahmedabad alone, highlighting the event's impact on local employment.The event led to record numbers at Sardar Vallabhbhai Patel International Airport, which handled 138,000 travellers over a three-day period. Hotel room tariffs surged — in some cases by over 400% — and platforms like Cleartrip and Agoda reported spikes in accommodation bookings of over 1,000%.Rail and road traffic also hit peak levels. Train routes from Mumbai and Delhi were fully booked well in advance. Ride-hailing fares surged, and public transport services were extended.The concert triggered higher consumer spending across lifestyle and retail sectors:68% of attendees made concert-specific purchases.Fashion platforms like Myntra and AJIO reported up to a three times increase in merchandise sales during the concert period.Local F&B vendors reported up to 40% growth in footfall and 30% revenue gains.On average, attendees spent ₹12,400 on accommodation, ₹10,800 on interstate travel, and nearly ₹2,000 on food and beverages outside the venue.India’s organised live event segment surpassed ₹12,000 crore in 2024 and is projected to grow at about a 19% compound annual growth rate (CAGR) over the next three years. The Coldplay concert is being cited in the report as a possible blueprint for future large-scale events in non-metro cities.Prime Minister Narendra Modi also referenced the concert in a public address, encouraging investments in cultural infrastructure to support India's growing youth and entertainment market.",
        "news_type": "Economic & Business"
    },
    {
        "title": "Private corporate sector capex expected to drop 25% in FY26, states government survey",
        "link": "https://www.cnbctv18.com/economy/private-corporate-sector-capex-expected-drop-25-pc-fy26-government-survey-19596601.htm",
        "description": "No description",
        "published_date": "Wed, 30 Apr 2025 07:44:14 +0530",
        "source": "CNBC Economics",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Private sector capex is likely to witness 25% lower growth in the current financial year 2026, as per a survey conducted by the Ministry of Statistics.The private sector intends to spend ₹4.88 lakh crore as capex in the financial year 2026 compared to ₹6.56 lakh crore in the previous fiscal, a decline of 25%, the forward-looking survey on Private Sector Capex Investment Intention stated.The ministry surveyed 3,064 enterprises between November 2024 and January 2025, of which 2,172 shared their capex plans for the financial year 2026.The survey showed that 43% of the enterprises did not report their capex for FY26 as no capital expenditure is intended to be incurred. Against this, 32% of the enterprises intend to increase their capex.While 20% of the enterprises see no change in their capex plans from the previous year, 4% intend to lower their capital formation in FY26.Mining and quarrying, electricity, gas, and air conditioning supply, wholesale and retail trade and repair of motor vehicles and motorcycles sectors are among the biggest contributors to zero capital expenditure in the current financial year.Against this, the manufacturing, health and education sectors intend to increase their capex by over 50%.Despite the tepid outlook for the current fiscal, the same enterprises showed a 24% increase in investment since FY21 indicating long-term growth momentum, although the actual capital spend was lower in FY24, compared to FY23.The actual capex reported by the private corporate sector stood at ₹3.94 lakh crore in 2021-22, ₹5.72 lakh crore in 2022-23, and ₹4.22 lakh crore in 2023-24.The report also urged caution in interpreting the FY26 capex projections, noting that many companies have adopted a conservative stance in declaring their investment plans.",
        "news_type": "Economic & Business"
    },
    {
        "title": "Finance Ministry warns of private capex stalling due to prolonged global uncertainties",
        "link": "https://www.cnbctv18.com/economy/finance-ministry-march-economy-review-private-capex-stalling-due-to-prolonged-global-uncertainties-trade-tensions-upside-risk-commodities-19596598.htm",
        "description": "No description",
        "published_date": "Wed, 30 Apr 2025 07:21:43 +0530",
        "source": "CNBC Economics",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "The finance ministry in its March economy review has said uncertainties stemming from global developments pose a key risk to the financial year 2026 growth outlook, which in turn could hurt private sector capex.“More than trade, the perception of prolonged uncertainty may cause the private sector to put its capital formation plans on hold,\" the ministry said.To guard against this risk, both companies and policymakers must “act urgently to avoid making uncertainty feed upon itself,\" it added.The review noted that as the world's fifth-largest economy, India remains vulnerable to spillover effects from geopolitical events, with substantial integration into global trade and financial networks.However, the domestic economy is large and capital formation can lead to a “mutually reinforcing” cycle of investment-income , growth-demand and additional capacity creation, the ministry said.“In contrast to normal times, action and execution have greater impacts now. It is an opportunity not to be missed, “ the economy review stated.It also flagged that the danger of “trade tensions and geopolitical risks, pose upside risks to commodity prices and may put pressure on supply chains”So while the current outlook for the Indian economy appears positive, supported by fiscal discipline, a resilient financial market, growing consumption demand as some of the key factors — global developments could upset this balance.",
        "news_type": "Economic & Business"
    },
    {
        "title": "RBI's debt buying binge to act as de facto rate cut, analysts say",
        "link": "https://www.cnbctv18.com/economy/rbi-debt-buying-binge-to-act-as-de-facto-rate-cut-analysts-say-19596445.htm",
        "description": "No description",
        "published_date": "Tue, 29 Apr 2025 18:46:52 +0530",
        "source": "CNBC Economics",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "The Reserve Bank of India's plan to buy ₹1.25 lakh crore ($14.66 billion) of bonds in May will likely lower the cost of overnight interbank funds, effectively acting as a rate cut, according to analysts.The debt purchases are likely to increase the liquidity in the banking system, helping transmit the two rate cuts announced this year and also keep the effective cost of funds below the policy repo rate of 6.00%.When the RBI buys bonds, it injects liquidity into the banking system, making it cheaper for lenders to borrow from each other overnight. This reduces overnight interbank lending rates, which are key short-term interest rates in the economy.The RBI, under Governor Sanjay Malhotra, who took charge in December, has flooded the banking system with liquidity. The bond purchase plan in May will follow purchases of ₹1.20 lakh crore in April and 2.83 trillion rupees in January-March.The central bank is targeting bond purchases amounting to a surplus of around 1% of deposits, Malhotra said earlier this month, which works out to about 2.30 trillion rupees to 2.50 trillion rupees.The weighted average overnight call money rate was at 5.93% on Tuesday (April 29) but is expected to ease to 5.75%, the rate offered by the RBI to banks parking excess funds at the Standing Deposit Facility (SDF).Indian government bond yields declined on Tuesday after the May debt purchase plan was announced, with the 10-year bond yield hitting a low of 6.32%, after rising to 6.40% a day prior.With sufficient domestic liquidity, we can expect the weighted average call rate to fall further and align closely to the SDF rate, said Aditi Gupta, economist at Bank of Baroda.It seems that for now, the RBI's intent is to target the quantum of durable liquidity and take it to at least 1% of deposits, with enough tolerance for higher values, Samiran Chakraborty, Citi's India chief economist, said.",
        "news_type": "Economic & Business"
    },
    {
        "title": "Switzerland enacts law to curb Hamas activities, effective May 15",
        "link": "https://www.cnbctv18.com/world/switzerland-enacts-law-to-curb-hamas-activities-effective-may-15-ws-l-19597057.htm",
        "description": "No description",
        "published_date": "Wed, 30 Apr 2025 17:32:33 +0530",
        "source": "CNBC World",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "A new Swiss law targeting Hamas and affiliated organisations is set to take effect on May 15, the government announced on Wednesday. The legislation is aimed at preventing the Palestinian militant group from using Switzerland as a haven by simplifying the implementation of entry bans and expulsions.Approved by the Swiss parliament in December 2023, the law was introduced following Hamas' attack on Israel on October 7, 2023. According to the government, this law provides authorities with the \"necessary tools to combat Hamas activities or support for the organisation within Switzerland.\"The Gaza conflict erupted after the October attack, which left 1,200 people dead and led to 251 hostages being taken to Gaza, according to Israeli reports. In response, Israel’s offensive on Gaza has resulted in over 52,000 deaths, based on local Palestinian health officials' accounts.The new legislation also enables preventive actions by Swiss authorities, such as imposing entry bans or carrying out expulsions. Additionally, it aims to restrict Hamas' ability to use Switzerland as a financial hub for its operations.",
        "news_type": "Political"
    },
    {
        "title": "Iran, UK, France, and Germany to hold nuclear talks on Friday",
        "link": "https://www.cnbctv18.com/world/iran-uk-france-and-germany-to-hold-nuclear-talks-on-friday-19597089.htm",
        "description": "No description",
        "published_date": "Wed, 30 Apr 2025 17:16:09 +0530",
        "source": "CNBC World",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "Iran will hold talks in Rome on Friday with European parties to their now moribund 2015 nuclear deal, its foreign minister said on Wednesday, as both sides seek to position themselves ahead of a new round of US-Iranian negotiations on Saturday.Reuters reported on Monday that Tehran had proposed meeting Britain, France and Germany, collectively known as the E3, who stuck to the 2015 deal meant to curb Iran's nuclear activity, which unravelled in 2018 when U.S. President Donald Trump walked out of it during his first term in the White House.\"In my opinion, the three European countries have lost their role (in the nuclear file) due to the wrong policies they have adopted. Of course, we do not want this and are ready to hold talks with them in Rome,\" Iranian Foreign Minister Abbas Araqchi told state media on Wednesday.There was initial hesitation within the E3 over concern that such talks could create a parallel track and hijack the negotiations pursued by Trump's second administration that Washington says aim to prevent Iran from developing nuclear weapons.But three European diplomats told Reuters that the E3 decided it was ultimately in their interest to maintain dialogue with Iran and reaffirm how they envisaged the parameters of a new nuclear deal.Foreign ministry political directors were meeting US officials in Berlin on Wednesday to be briefed on previous rounds of US-Iranian talks and prepare for the Rome meeting, and will head there on Friday, two diplomats said.Iran is looking to build on the momentum of nuclear negotiations with the Trump administration that resumed in Oman on Saturday and after its talks with Russia and China last week. US and Iranian negotiators will reconvene in Rome on Saturday.Iran's approach to the E3 suggests it is keeping its options open but also wants to assess where the Europeans stand on the possible reimposition of United Nations sanctions against Tehran before October, known in diplomatic circles as the \"snapback mechanism\", when a resolution ratifying the 2015 accord expires.Relations between the E3 and Iran have worsened over the last year despite sporadic meetings since last September against a backdrop of new sanctions imposed on the Islamic Republic over its ballistic missile programme, its detention of foreign citizens and support for Russia in its war against Ukraine.Highlighting those tensions, French Foreign Minister Jean-Noel Barrot said on Tuesday that Paris would not think twice if the current negotiations failed about launching the snapback of sanctions, which he said would have \"devastating effects.”He accused Tehran of being on the cusp of covertly developing a nuclear weapon. Iran has long denied this, saying its accelerating uranium enrichment programme is only for civilian energy purposes.In a letter distributed to the UN Security Council and seen by Reuters, Iran's permanent representative to the United Nations, Amir Saeid Iravani, said Barrot's comments were \"unfounded and politically irresponsible\".He said that applying the snapback would be \"legally and procedurally flawed, inadmissible, and invalid\".\"(Barrot's) open threat to reimpose sanctions with 'devastating effects' on Iran’s economy constitutes a blatant act of political and economic coercion,\" the letter said.",
        "news_type": "Political"
    },
    {
        "title": "German SPD backs coalition, paving way for Chancellor Friedrich Merz",
        "link": "https://www.cnbctv18.com/world/german-spd-backs-coalition-paving-way-for-chancellor-friedrich-merz-ws-l-19597036.htm",
        "description": "No description",
        "published_date": "Wed, 30 Apr 2025 16:17:30 +0530",
        "source": "CNBC World",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "Germany’s Social Democrats voted in favour of the coalition deal with Friedrich Merz’s conservatives, clearing the way for the Christian Democratic leader to be confirmed as chancellor next week.About 85% of SPD members who participated in the online ballot backed the blueprint for government that was agreed earlier this month with the CDU/CSU alliance, the party said on Wednesday in Berlin.“The SPD is ready to take on responsibility in the next government,” Matthias Miersch, the party’s general secretary, said at a news conference in Berlin. “It’s about setting the right path to take Germany forward and above all about investing in the future of this country.”Of the roughly 360,000 members, just 56% took part, with 15% voting against the accord. The SPD youth wing, which accounts for just over 10% of the membership, had led internal opposition to the agreement but failed to muster enough support to block it.To revive growth, Merz campaigned for lower taxes and tighter spending, but abandoned his hawkish fiscal stance shortly after the Feb. 23 election to pass constitutional changes that will unlock hundreds of billions of euros in debt for defense and infrastructure investment. He’s also promised to clamp down on migration and rein in Germany’s bureaucracy.On foreign policy, Merz aims to take a more active role in Europe in contrast to the more tepid approach of his predecessar Olaf Scholz. Once he is sworn in, he is expected to travel to Paris and Warsaw to meet counterparts Emmanuel Macron and Donald Tusk. He’s also likely to soon visit Kyiv to show support for Ukraine in its defense against Russia’s invasion.The 69-year-old Merz is due to be voted in by Bundestag lawmakers next Tuesday, after which he’ll take his oath of office along with the members of his cabinet. The Christian Democrats and their Bavarian sister party, the CSU, have already nominated their 10 ministers, while the SPD is expected to name its seven on Monday.Lars Klingbeil, an SPD co-leader, will take over the key finance portfolio as expected and will also be Merz’s deputy as vice chancellor, according to people familiar with the planning. His twin roles were formally approved Wednesday at an SPD leadership meeting, said the people, who asked not to be identified before a public announcement.Merz, a former corporate lawyer with no experience in government, is set to take over the running of Europe’s biggest economy at a time of domestic and geopolitical turmoil.His approval rating is only at around 36% and support for the parties in the next government have slumped further in polls, with combined support at about 40%, while the far-right Alternative for Germany has become the strongest force in some opinion polls. That puts pressure on Merz to act fast.“How quickly the new government draws up the budget — and whether it will be passed before the summer break — will be decisive” for bolstering the economy, said Marion Muehlberger, economist and political analyst at Deutsche Bank Research.Germany’s gross domestic product has shrunk the past two years and is in danger of doing so again this year. In the first quarter, the economy grew by 0.2% from the previous three months, the statistics office said on Wednesday, but more challenging times are ahead as the impact from US trade levies has yet to be fully felt.As well as restoring economic growth, coalition officials have pledged to strengthen the military and domestic security in the face of Russian aggression and tackle irregular migration, a key concern among AfD voters.While it’s still unclear how the trade conflict will affect export-dependent Germany, a giant investment package the conservatives and the SPD secured last month with the support of the Greens is expected to help propel growth next year to around 1%.Merz’s center-right bloc didn’t hold membership ballots on the coalition deal, which was approved instead by party officials.Merz will lead a so-called “Grand Coalition” with the SPD, the fifth such alliance since World War II — three of them under former conservative Chancellor Angela Merkel. The last time the SPD gave members a vote on a coalition deal was in 2018 before they joined Merkel’s government as junior partner.",
        "news_type": "Political"
    },
    {
        "title": "PM Modi won't attend May 9 celebrations in Russia, says Kremlin spokesperson",
        "link": "https://www.cnbctv18.com/world/pm-modi-wont-attend-may-9-celebrations-in-russia-says-kremlin-spokesperson-19596860.htm",
        "description": "No description",
        "published_date": "Wed, 30 Apr 2025 17:36:05 +0530",
        "source": "CNBC World",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Prime Minister Narendra Modi will not be travelling to Russia for the Victory Day celebrations, according to the Kremlin spokesperson. The clarification came after multiple reports claimed PM Modi was expected to attend the May 9 parade in Moscow to mark the 80th anniversary of victory over Germany in World War II.Defence Minister Rajnath Singh may attend the event in Moscow on May 9, as per a report by the Russian news agency TASS earlier this month. Singh's visit to Moscow for the parade is possible, it reported, citing sources in the Indian government.Ministry of External Affairs (MEA) spokesperson Randhir Jaiswal earlier said that the Prime Minister received an invitation to participate in Victory Day celebrations. During a press briefing, he said, “We will be announcing our participation in the Victory Day celebration at the appropriate time. As far as the participation of the Indian contingent is concerned, again, we will let you know as and when we have an update.”TASS in February reported that the PM was likely to visit Russia for the May 9 parade at Moscow's Red Square. “Prime Minister Narendra Modi is planning a visit to the May 9 parade in Moscow. It is highly likely that it will take place,” it quoted sources as saying.The Russian side was informed earlier that India would be represented by Defence Minister Rajnath Singh.Last year in October, PM Modi visited Russia at the invitation of President Vladimir Putin to attend the 16th BRICS Summit. Before this, in July, he visited the country to attend the 22nd India-Russia Annual Summit.The Soviet Army fought World War II alongside the Allies against the Nazi Germany. On May 9, the commanders-in-chief signed the Act of Unconditional Surrender of Germany, effectively ending the war.",
        "news_type": "Political"
    },
    {
        "title": "US dollar has more room to weaken, says JPMorgan's Oganes",
        "link": "https://www.cnbctv18.com/market/us-dollar-room-to-weaken-treasury-market-jpmorgans-oganes-19596741.htm",
        "description": "No description",
        "published_date": "Wed, 30 Apr 2025 13:48:17 +0530",
        "source": "CNBC World",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "The US dollar might lose more value in the future, according to Luis Oganes, the Head of Global Macro Research at JPMorgan.Oganes doesn't fully agree with the idea that the dollar's global dominance is ending. He believes this because there isn't another currency or bond market that can easily replace the size and ease of trading found in the US dollar and the US Treasury market.“This de-dollarisation, and this reduction in dollar exposure by the investors around the world will continue, but it is going to have a limit. But in that continuation that we are talking about here, in moving, let us say, from overweight to neutral, probably the dollar has more weakness to experience.”Regarding the euro's value compared to the dollar, Oganes mentioned their forecast that one euro could be worth between $1.20 and $1.22 by the end of the year.He added, “We had a forecast that was already out of consensus of 1.14-1.16, and literally, we saw that being hit last week already, and we are still April. So probably, for the time being, we see weakness for the dollar.”Oganes believes that the uncertainty generated by the tariffs is likely to lead to a slowdown in growth, though it remains unclear if this will result in a full-blown recession.He added, “At this minute you are going to see a global growth slowdown pretty much happening everywhere, some places more than others.”Oganes expects inflation to remain higher in the US, primarily due to the increased cost of imports. Replacing imports, especially those from China, will take time as businesses adjust their supply chains and find alternative sources for goods. This process won't be quick, meaning inflationary pressures will persist for a while.Estimating the exact impact is challenging, but with the recent delay of tariff increases and some of the most significant hikes, Oganes predicts inflation in the US could stay around 4%, possibly 3.8%, by the end of the year.Globally, the situation will be more mixed. Slower growth in the US and other countries will bring deflationary pressures due to weaker demand. However, Oganes highlights concerns that China, unable to sell products to the US, may redirect these goods to other markets, potentially flooding the world with cheap exports. This could lead to deflation in many countries.Some nations may also respond by increasing tariffs on Chinese imports to protect their own industries. The impact on inflation will depend largely on the policy decisions made in response.One factor that could help energy-importing countries, like India, is the decline in oil prices. If local authorities allow international price drops to be reflected in domestic fuel prices, it could help offset some of the inflation caused by tariffs.",
        "news_type": "Economic & Business"
    },
    {
        "title": "SEBI over-regulating in parts, admits Chairman Tuhin Kanta Pandey; bats for smarter oversight",
        "link": "https://www.cnbctv18.com/market/sebi-chairman-tuhin-kanta-pandey-on-over-regulating-oversight-exclusive-ws-l-19597084.htm",
        "description": "No description",
        "published_date": "Wed, 30 Apr 2025 17:32:47 +0530",
        "source": "CNBC Market",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "In an exclusive interview with CNBC-TV18, SEBI Chairman Tuhin Kanta Pandey admitted that the market regulator may be over-regulating in some areas and stressed the need to simplify and re-evaluate several rules in light of changing contexts and technological progress.\n\n“I think SEBI is over-regulating,” Pandey said, candidly acknowledging that there are many areas where regulations could be made simpler. “Regulations are contextual in nature — and in some of them, the context has changed.”\n\nHe pointed out that advances in technology now allow for more intelligent and targeted regulatory approaches. “Many times, a better way of regulation is possible because you have better technology now,” he said.\n\nDrawing a distinction between rule-making and implementation, Pandey noted, “SEBI can’t be in everyone’s boardroom.” He emphasised the need to focus oversight on areas of higher risk instead of adopting a one-size-fits-all approach.\n\nAlso Read: ‘Disclosure norms for employees and board need updating,’ says SEBI chair Pandey\n\n“Are our rules too much tick-boxing?” he asked, calling for a move towards more meaningful checks that can effectively flag false disclosures at an early stage. “When you seek too much information, you have to process too much information,” he cautioned.\n\nDescribing the ongoing review of SEBI’s regulatory framework as a form of “Diwali-cleaning,” Pandey credited his predecessors for routinely updating the rulebook. “All our staff are engaged and energised into relooking rules,” he said, underlining a larger effort to make SEBI a “smarter regulator.”",
        "news_type": "Economic & Business"
    },
    {
        "title": "Sona BLW Precision Forgings Q4 Results | Net profit up 10% at ₹164 crore despite 2% revenue dip",
        "link": "https://www.cnbctv18.com/market/stocks/sona-blw-precision-forgings-share-price-q4-fy25-results-net-profit-up-revenue-dip-ebitda-margin-electric-vehicles-19597074.htm",
        "description": "No description",
        "published_date": "Wed, 30 Apr 2025 17:18:44 +0530",
        "source": "CNBC Market",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Auto component maker Sona BLW Precision Forgings Ltd (Sona Comstar) on Wednesday (April 30) reported a 10.3% year-on-year (YoY) increase in net profit at ₹164 crore for the fourth quarter that ended March 31, 2025. In Q4FY24, Sona BLW Precision Forgings had posted a net profit of ₹148.7 crore.\n\nRevenue from operations dipped 2.2% to ₹864.8 crore against ₹884 crore in the year-ago period. At the operating level, EBITDA fell 6.3% YoY to ₹231.3 crore in the fourth quarter from ₹246.9 crore.\n\nAlso Read: Sona BLW shares jump 6% after Tesla production of key model returns to normal\n\nThe EBITDA margin shrank slightly to 26.8% versus 27.9%. EBITDA is earnings before interest, tax, depreciation, and amortisation.\n\nSona BLW reported that battery electric vehicles (BEVs) accounted for 35% of its revenue in Q4FY25, with BEV revenue rising 8% YoY to ₹294 crore. The company’s EV programmes now form 77% of its total order book, which stood at ₹24,200 crore as of March 31, 2025.\n\nFor the full year FY25, the company posted a revenue of ₹3,555 crore, reflecting a 12% increase over FY24. BEV revenue for the year grew by 38% YoY, contributing 36% to the annual revenue.\n\nAlso Read: Citi says 'buy' Sona BLW due to this key differentiator, but sees lesser upside\n\nThe company added four new EV programmes and two new customers during the year, taking its total EV programme count to 58 across 32 clients. EBITDA for FY25 came in at ₹975 crore, representing an 8% YoY growth. The margin for the full year stood at 27.4%. Profit after tax rose 16% to ₹601 crore, translating to a net profit margin of 16.9%.\n\nThe results came after the close of the market hours. Shares of Sona BLW Precision Forgings Ltd are at ₹481.35, down by ₹10.35, or 2.10%, on the BSE.",
        "news_type": "Economic & Business"
    },
    {
        "title": "Federal Bank Q4 results: Net profit rises 14%; beats estimates",
        "link": "https://www.cnbctv18.com/market/earnings/federal-bank-q4-results-net-profit-interest-income-shares-price-dividends-19597069.htm",
        "description": "No description",
        "published_date": "Wed, 30 Apr 2025 17:11:59 +0530",
        "source": "CNBC Market",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Kerala-based Federal Bank on Wednesday (April 30) reported a 13.7% year-on-year (YoY) rise in net profit to ₹1,030.2 crore for the fourth quarter ended March 31, 2025.\n\nThe lender beat the CNBC-TV18 poll estimate of ₹977.5 crore.\n\nIn the same quarter last year, it had posted a profit of ₹906.3 crore.\n\nNet interest income (NII) increased 8.3% YoY to ₹2,377.4 crore from ₹2,195.2 crore. However, it came in slightly below street expectations of ₹2,431.9 crore.\n\nThe net interest margin (NIM) improved to 3.12% during the quarter, supported by strategic initiatives.\n\nGross non-performing assets (GNPA) declined to ₹4,375.5 crore from ₹4,553.3 crore in the previous quarter, while net NPA fell to ₹1,040.4 crore from ₹1,131.2 crore sequentially. In percentage terms, the gross NPA ratio eased to 1.84% from 1.95%, and net NPA ratio improved to 0.44% from 0.49% quarter-on-quarter.\n\nThe provision coverage ratio, excluding technical write-offs, stood at 75.37%.\n\nThe bank’s total business stood at ₹5.18 lakh crore as of March 31, 2025, registering a 12.24% YoY growth. Net advances rose to ₹2.35 lakh crore from ₹2.09 lakh crore, driven by strong momentum across loan segments.\n\nRetail advances were up 14.5% to ₹77,212 crore. Business banking loans increased 11.44% to ₹19,064 crore, commercial banking loans surged 26.76% to ₹27,199 crore, and corporate loans rose 8.39% to ₹79,774 crore.\n\nThe commercial vehicle and construction equipment (CV/CE) segment witnessed 34.93% growth to ₹4,644 crore, while gold loans, including agricultural gold loans (ADLG), rose 20.93% to ₹30,505 crore.\n\nOn the liabilities side, total deposits stood at ₹2.84 lakh crore, up 12.32% over the previous year.\n\nFederal Bank’s net worth rose 13.86% YoY to ₹33,122 crore. Its capital adequacy ratio (CAR), under Basel III norms, stood at 16.40%.\n\nThe board has recommended a dividend of ₹1.20 per share (60% of face value ₹2), subject to shareholder approval at the upcoming annual general meeting (AGM).\n\nThe results were announced after market hours. Shares of Federal Bank closed at ₹196.60 on the BSE, down 3.3% from the previous close.",
        "news_type": "Economic & Business"
    },
    {
        "title": "Exclusive | SEBI keeps T+0 settlement optional amid investor and FPI adaptation challenges: Tuhin Kanta Pandey",
        "link": "https://www.cnbctv18.com/market/sebi-chief-tuhin-kanta-pandey-t0-same-day-settlement-equity-cash-market-19597012.htm",
        "description": "No description",
        "published_date": "Wed, 30 Apr 2025 16:58:45 +0530",
        "source": "CNBC Market",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "SEBI Chairman Tuhin Kanta Pandey has confirmed that the T+0 settlement framework will remain optional for now, prioritising flexibility in market operations. Speaking in an exclusive CNBC-TV18 interview on Wednesday, April 30, Pandey highlighted the regulator's neutral stance on immediate settlement.“We will keep it optional and are neutral about it,” he stated, indicating that SEBI will monitor how the system adapts and whether investors find it suitable.Pandey also acknowledged that foreign portfolio investors (FPIs) face multiple procedural challenges with T+0 settlements, which could impact adoption rates.T+0 settlement, where trades are executed and settled on the same day, aims to enhance liquidity and efficiency in the market by ensuring instant transaction completion.The capital markets regulator on Tuesday, April 29 extended the timeline for implementation of the optional T+0 rolling settlement cycle for qualified stock brokers (QSBs) to November 1.Earlier, the deadline for operational readiness as mandated under the SEBI's December 10, 2024, circular was May 1, 2025.The extension came after SEBI received feedback from QSBs and subsequent consultations with stock exchanges, clearing corporations, depositories and the brokers themselves.\"In order to ensure smooth implementation, it has been decided to extend the timeline for QSBs for putting in place the necessary systems and processes for enabling seamless participation of investors in the optional T+0 settlement cycle to November 1, 2025,\" as per a SEBI circular.SEBI's earlier framework said, \"stock brokers who are designated as QSBs and meet the parameter of minimum number of active clients for qualification as QSB as on December 31, 2024 shall put in place necessary systems and processes for enabling seamless participation of investors in optional T+0 settlement cycle\".Further, new QSBs have three months to adopt these systems after any list updates.While extending the deadline, the regulator clarified that all other provisions of the December 10, 2024, circular will remain unchanged.In December last year, SEBI expanded the optional T+0 (same day) settlement in the equity cash market to the top 500 scrips by market capitalisation.The Securities and Exchange Board of India (SEBI) introduced an optional T+0 settlement cycle for 25 scrips in March 2024. Initially, it was available only to non-custodian clients.",
        "news_type": "Economic & Business"
    },
    {
        "title": "ED-A-MAMMA opens its first store in Bengaluru at mall of Asia",
        "link": "https://www.cnbctv18.com/business/ed-a-mamma-opens-its-first-store-in-bengaluru-at-mall-of-asia-19597049.htm",
        "description": "No description",
        "published_date": "Wed, 30 Apr 2025 16:53:05 +0530",
        "source": "CNBC Market",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Ed-a-Mamma, the homegrown sustainable clothing and lifestyle brand for children and mothers, has opened its first standalone store in Bengaluru.Located at the Mall of Asia, this marks the brand’s fourth physical store in India and the first in the South. This comes at a time when the brand is scaling in partnership with Reliance Retail Ventures Ltd. (RRVL).Founded by actor and entrepreneur Alia Bhatt, Ed-a-Mamma has captured the hearts of conscious families across India with its joyful, earth-friendly approach to kids' wear, maternity wear, and early learning products. With every product rooted in storytelling and sustainability, the brand inspires young children and their carers to engage with nature in meaningful ways.“Ed-a-Mamma’s first offline store in Bengaluru is a significant milestone for our brand and a dream come true for me!” said Alia Bhatt, Founder. “We began as a small, homegrown business, and with the right partnership with Reliance and a shared purpose, we’ve been able to grow our world to include clothing, books, toys, and so much more—all designed to nurture a love for the planet.I’m excited for Bengaluru’s families to experience everything we’ve built with so much heart.”Located on the second floor of Mall of Asia, the 805 sq ft store has been thoughtfully constructed using sustainable materials, including eco-conscious fixtures and natural textures. It reflects Eda-Mamma’s “forest-first” philosophy, where nature is both inspiration and intention. What makes this store truly magical is how it brings to life the whimsical world of Ed Finds A Home, Alia Bhatt’s debut children’s book.The visual merchandising playfully recreates the journey of Ed, a hopeful dog in search of a family, and Alia, a compassionate girl with a secret superpower, echoing the brand’s deeper values of empathy, environmentalism, and wonder. Each storytelling zone is designed to immerse young visitors in the universe of Ed and his friends.• Kidswear (ages 0–14) made with natural fabrics and plastic-free trims• Maternity and nursing wear that’s as comfortable as it is conscious• Toys, including plush and upcycled linen dolls, with wooden toys launching soon• Lifestyle accessories such as bags, hair clips, bedding, and gift setsEvery wear garment comes with a seed ball potli, encouraging children to plant trees and connect with the planet—one outfit at a time.Since its launch in 2020, Ed-a-Mamma has grown into a full-fledged ecosystem of conscious living.What began as a sustainable kidswear brand has now expanded to include maternity collections, books, toys, and seasonal gifting—all designed around the idea that childhood is better when rooted in nature.",
        "news_type": "Economic & Business"
    },
    {
        "title": "Caste census to be part of next population survey: Centre takes big move",
        "link": "https://www.dnaindia.com/india/report-caste-census-to-be-part-of-next-population-survey-union-cabinet-s-big-move-3148649",
        "description": "The decision was taken at the high-powered cabinet committee on political affairs chaired by PM Modi.",
        "published_date": "Wed, 30 Apr 2025 11:29:00 GMT",
        "source": "DNA India",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "The decision was taken at the high-powered cabinet committee on political affairs chaired by PM Modi.\n\nThe Union Cabinet Committee on Political Affairs has decided that caste enumeration should be included in the forthcoming census, said Union Minister Ashiwini Vaishnaw on Union Cabinet decisions. Briefing the media, Vaishnaw said that some states have done caste surveys and conducting a census is in the domain of the central government. Vaishnaw alleged that Congress governments \"have always opposed caste census\".\n\n\"Caste was not included in all the census operations conducted since independence. In 2010, the then Prime Minister Manmohan Singhji had assured the Lok Sabha that the matter of caste census should be considered in the cabinet. A group of ministers was formed to consider this subject. Most political parties recommended a caste census. Despite this, the Congress government decided to conduct only a survey of caste instead of a census. That survey is known as SECC,\" Vaishnaw said.\n\n\"It is well understood that Congress and its INDI alliance partners have only used the caste census as a political tool. As per Article 246 of the Constitution of India, the subject census is listed at 69 in the Union list in the 7th schedule. According to the Constitution of India, census is a Union subject. Some states have conducted surveys to enumerate caste. Some states have done this well, while some others have conducted such surveys purely from a political angle in a non-transparent way. Considering all these facts and to ensure that a social fabric is not disturbed by politics, caste enumeration should be transparently included in the census instead of surveys,\" he added.\n\nREAD | Who is Alok Joshi, former RAW chief, now appointed head of revamped NSA Board after Pahalgam terror attack?\n\nVaishnaw said this will strengthen the social and economic structure of the society while the nation continues to progress. \"Under the leadership of PM Modi, the Cabinet Committee of Political Affairs has decided today that Caste enumeration should be included in the forthcoming census. This demonstrates that the government is committed to the values and interests of the society and the country,\" he said.\n\nThe minister said that the Modi government had earlier introduced ten per cent reservation for the Economically Weaker Sections without causing any stress on any section of the society. Congress has been demanding a caste census, with party leaders repeatedly making the demand in their speeches.\n\n(Except for the headline, this story has not been edited by DNA staff and is published from ANI)",
        "news_type": "Political"
    },
    {
        "title": "BIG update on India's first bullet train for Mumbai-Ahmedabad corridor: Commuters will be able to travel by...,check features and other details",
        "link": "https://www.dnaindia.com/india/report-big-update-on-india-s-first-bullet-train-high-speed-train-corridor-for-mumbai-ahmedabad-corridor-commuters-will-be-able-to-travel-bycheck-features-and-other-details-3148648",
        "description": "Mumbai-Ahmedabad Bullet Train: For a long time the government has been envisioning a fastest train for India and now the wait is over as Maharashtra Chief Minister Devendra Fadnavis has said that the bullet train will be operational by 2028.",
        "published_date": "Wed, 30 Apr 2025 11:02:00 GMT",
        "source": "DNA India",
        "source_country": "India",
        "countries_mentioned": [
            "USA",
            "India"
        ],
        "content": "Mumbai-Ahmedabad Bullet Train: For a long time the government has been envisioning a fastest train for India and now the wait is over as Maharashtra Chief Minister Devendra Fadnavis has said that the bullet train will be operational by 2028.\n\nMumbai-Ahmedabad Bullet Train: For a long time the government has been envisioning a fastest train for India and now the wait is over as Maharashtra Chief Minister Devendra Fadnavis has said that the bullet train will be operational by 2028. The much awaited high-speed train corridor is being built in collaboration with Japan, Fadnavis said. The USD 15 billion Mumbai-Ahmedabad bullet train project suffered during a two-year rule until 2022, but now the work is on in full swing, added Fadnavis without naming Shiv Sena's Uddhav Thackeray. Fadnavis also said that neighbouring state Gujarat is ahead of Maharashtra on the project development.\n\nPrior to this, Railways Minister Ashwini Vaishnaw had announced the project's deadline to be 2026, and that the operations would begin between Surat and Bilimora. Vaishnaw assured of a boost in the economy of the areas which would be covered in the journey.\n\nIn a significant milestone for the Mumbai-Ahmedabad Bullet Train project, the first 100-metre span of a 2 X 100 metre long steel bridge was successfully launched over the bustling NH-48 near Nadiad, Gujarat, the National High Speed Rail Corporation Limited (NHSRCL) announced. \"This 'Make in India' steel bridge comprising two 100 m long steel spans is planned for crossing NH-48 for the Bullet Train corridor, out of which one has been successfully launched,\" as per a National High Speed Rail Corporation Limited release. There are 28 steel bridges planned for the entire corridor. Out of which, 11 steel bridges are in Maharashtra and 17 are in Gujarat.\n\nVadhavan port project in Maharashtra\n\nFadnavis also said the state is looking to raise USD 50 billion from international financiers for infrastructure development in the state, and announcements for the same will be done in four months. The CM said creating infrastructure is very important to achieve the goal of USD 1 trillion GSDP, and that USD 30 billion was invested in infrastructure creation during his first stint as the chief minister between 2014-19, and more money is being put into important projects now. Speaking at an event on the India-Middle East Europe Economic Corridor (IMEEC) project organized by VRF here, he said the Vadhavan port will be operatioal in the next 3-4 years.\n\nHe said the port, being built on reclaimed land, will help reduce the cost of logistics, pointing out that the turnaround time at JNPA, India's largest container port located nearby, is higher. The Vadhavan port will also have an adjoining airport which will be built through land reclamation on the sea, Fadnavis said, adding that many major cities in the world have such airports. It will also have a halt for the bullet train, he said. The chief minister said Maharashtra is building a highway from Nashik to Vadhavan port which will ensure that 17 districts of the state get connected with the modern port.\n\nNagpur to Goa road project\n\nThe state is building the Shaktipeeth highway to connect Nagpur with Goa, Fadnavis said, adding that this road project passing through the backward regions will also help boost the economic growth. He said Mumbai and Maharashtra will play an important role in the IMEEC, and assured that the state will create the facilitating ecosystem for the project to be a success. Speaking at the same event, Sanjeev Krishan, the country chairperson of consulting firm PwC said the corridor, when combined with existing trade routes, will have a multiplier effect on the global economy.\n\n(With inputs from PTI and ANI)",
        "news_type": "Economic & Business"
    },
    {
        "title": "Pahalgam Attack: Why did Taliban-ruled Afghanistan support India, not Pakistan?",
        "link": "https://www.dnaindia.com/india/report-pahalgam-attack-why-did-taliban-ruled-afghanistan-support-india-not-pakistan-3148638",
        "description": "Afghanistan's acting Foreign Minister Mawlawi Amir Khan Muttaqi strongly condemned the Pahalgan attack. Earlier too, the Taliban condemned the terrorist attack and said that such incidents undermine efforts to ensure regional security and stability.",
        "published_date": "Wed, 30 Apr 2025 10:23:53 GMT",
        "source": "DNA India",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Afghanistan's acting Foreign Minister Mawlawi Amir Khan Muttaqi strongly condemned the Pahalgan attack. Earlier too, the Taliban condemned the terrorist attack and said that such incidents undermine efforts to ensure regional security and stability.\n\nTaliban-ruled Afghanistan shocked Islamabad when it chose to support India in the aftermath of the Pahalgam terrorist attack. After meeting an Indian delegation headed by MEA joint secretary Anand Prakash, who handles Pakistan, Afghanistan, and Iran, acting Foreign Minister Mawlawi Amir Khan Muttaqi strongly condemned the attack on April 22, in which 26 people were killed. Earlier too, the Taliban condemned the terrorist attack and said that such incidents undermine efforts to ensure regional security and stability.\n\nIndia reaches out to Taliban\n\nAs India has changed its policy on the Taliban and reached out to them on earlier occasions also, it is believed that the militant outfit will not allow Pakistan the strategic depth in Afghanistan so that anti-India elements sneak into Jammu and Kashmir and attack them or target Indian diplomats or others as in the past. Taliban has also assured Indian diplomats of providing enough security to carry out their activities fearlessly.\n\nPakistan deports Afghan refugees\n\nThe Pahalgam attack came a few days after Islamabad launched the operation of forcefully deporting more than three million Afghans living in the country as refugees. The Shehbaz Sharif-led Pakistan government has decided to send all of these Afghan refugees in three phases. Confirming this, the United Nations International Organisation for Migration (IOM) said that it had assisted more than one million people returning from Pakistan and Iran.\n\nIslamabad announced in March that it would send about 800,000 people in April. These are the people carrying Afghan Citizen Cards (ACC) issued by Pakistani authorities. Afghanistan is not happy with this decision.\n\nClashes over Durand Line\n\nPakistan-Afghanistan relations took a nosedive soon after the militants captured Kabul in August 2021. The Durand Line, which separates the two countries, became a sticky point, and the two sides got engaged in skirmishes on many occasions. Afghanistan under the Taliban rejected the line established in 1893 by British civil servant Sir Henry Mortimer Durand and Afghan Emir Abdur Rahman Khan. Earlier too, Kabul rejected it as an international border, but with the Taliban at the helm of affairs, Islamabad had hoped to make it accept its hegemony.\n\nPakistan-Afghanistan and TTP\n\nThe two sides have also quarreled openly over the Tehrik-e-Taliban Pakistan, a terrorist outfit based in Khyber Pakhtoonkhwa of Pakistan with sympathisers living on the other side of the border. The outfit aims to establish a Sharia-based rule in Pakistan; it is encouraged by the success of the Taliban in Afghanistan. They have made daring raids in Pakistan and targeted security forces, killing hundreds of its personnel. Islamabad wants the Taliban to rein in the Islamic outfit, while Afghanistan says the militants are not under its control.\n\nIndia has still not recognised the Taliban officially; however, it has reached out to the rulers in Afghanistan and assured them of continuing with the development projects started earlier. It is a big bargain for the Taliban, which needs to get support and recognition from outside to claim its legitimacy. It was a big relief for Afghanistan to receive an Indian delegation on their soil. Kabul was quick to receive the Indian diplomats with open arms and slam Pakistan for the terrorist attack in Jammu and Kashmir.",
        "news_type": "Political"
    },
    {
        "title": "Who is Alok Joshi, former RAW chief, now appointed head of revamped NSA Board after Pahalgam terror attack?",
        "link": "https://www.dnaindia.com/india/report-who-is-alok-joshi-former-raw-chief-now-appointed-head-of-revamped-nsa-board-after-pahalgam-terror-attack-3148634",
        "description": "Alok Joshi will lead a seven-member board comprising retired senior officers from India's military, police, and foreign services.",
        "published_date": "Wed, 30 Apr 2025 10:06:00 GMT",
        "source": "DNA India",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "Alok Joshi will lead a seven-member board comprising retired senior officers from India's military, police, and foreign services.\n\nDays after the Pahalgam terror attack, the Union government has revamped the National Security Advisory Board (NSAB). Alok Joshi, a former Chief of the Research and Analysis Wing (RAW), has been appointed as the head of the NSAB. This decision comes after Prime Minister Narendra Modi held a Cabinet Committee on Security (CCS) meeting at his residence in New Delhi on Wednesday. Six more members have also been inducted into the NSA board.\n\nThe other six members include former Western Air Commander Air Marshal PM Sinha, former Southern Army Commander Lieutenant General AK Singh, and Rear Admiral Monty Khanna, all retired military officers. Rajiv Ranjan Verma and Manmohan Singh are the two retired members of the Indian Police Service (IPS). B Venkatesh Varma is a retired IFS officer in the seven-member board.\n\nWho is Alok Joshi?\n\nAlok Joshi is a former chief of the Research and Analysis Wing (RAW). He has now been appointed as the head of National Security Advisory Board (NSAB). He hails from Lucknow and graduated from Jawaharlal Nehru University (JNU) with a postgraduate degree in political science. Joshi joined the Indian Police Service (IPS), Haryana cadre in 1976, reports suggest. He rose through his ranks and later in 2005 became the joint director of the Intelligence Bureau (IB). In 2010, he was appointed as a Special Secretary at R&AW. He took over as RAW Secretary in 2012.\n\nWhat is National Security Advisory Board?\n\nIt is a multi-disciplinary body comprising persons of eminence from outside government. Its principal function is to provide long-term analysis to the National Security Council and recommend solutions and policy options for the issues raised by it.\n\nREAD | 57 transfers in 34 years: Meet IAS Ashok Khemka, IIT graduate, who is retiring today, came to limelight in 2012 due to...\n\nAlong with the CCS meeting, two additional committee meetings--the Cabinet Committee on Political Affairs (CCPA) and the Cabinet Committee on Economic Affairs (CCEA)--were convened at the Prime Minister's residence. The CCS last met on April 23 and was briefed in detail on the terrorist attack in Pahalgam, in which 25 Indians and one Nepali citizen were killed. Earlier on Tuesday, PM Modi chaired a meeting attended by Defence Minister Rajnath Singh, Chief of Defence Staff Gen. Anil Chauhan, and the three service chiefs.\n\nThe sources said PM Modi expressed complete faith and confidence in the professional abilities of the Indian Armed Forces. PM Modi stated that the Indian Armed Forces have complete operational freedom to decide on the mode, targets, and timing of India's response.\n\n(With inputs from ANI)",
        "news_type": "Military & Defense"
    },
    {
        "title": "Meet new Mumbai Police Commissioner Deven Bharti, super cop who led 26/11 attacks investigation, he has replaced Vivek Phansalkar",
        "link": "https://www.dnaindia.com/india/report-meet-new-mumbai-police-commissioner-deven-bharti-super-cop-who-led-2611-attacks-investigation-he-has-replaced-vivek-phansalkar-3148632",
        "description": "He will take charge as the city's top cop later in the evening from incumbent Vivek Phansalkar, who is retiring after serving the force for 35 years.",
        "published_date": "Wed, 30 Apr 2025 09:26:00 GMT",
        "source": "DNA India",
        "source_country": "India",
        "countries_mentioned": [
            "India"
        ],
        "content": "INDIA\n\nMeet new Mumbai Police Commissioner Deven Bharti, super cop who led 26/11 attacks investigation, he has replaced Vivek Phansalkar\n\nHe will take charge as the city’s top cop later in the evening from incumbent Vivek Phansalkar, who is retiring after serving the force for 35 years.",
        "news_type": "Crime & Law"
    },
    {
        "title": "Markets digest bank earnings after recent turmoil",
        "link": "https://www.cnn.com/business/live-news/stock-market-bank-earnings/index.html",
        "description": "No description",
        "published_date": "Fri, 14 Apr 2023 20:00:28 GMT",
        "source": "CNN",
        "source_country": "USA",
        "countries_mentioned": [
            "USA"
        ],
        "content": "Chief executives at some of the largest banks in the United States were forced to address the elephant in the room as they reported first-quarter earnings on Friday morning: The regional banking crisis that brought Silicon Valley Bank and Signature Bank to ruin last month.\n\n> Banking industry turmoil has added to risks of recessionary “storm clouds” on the horizon, said JPMorgan Chase CEO Jamie Dimon Friday in a release. He added that “the banking situation is distinct from 2008 as it has involved far fewer financial players and fewer issues that need to be resolved.”\n\nStill, said Dimon, who leads the country’s largest bank, “financial conditions will likely tighten as lenders become more conservative, and we do not know if this will slow consumer spending.”\n\n>“We are glad to have been in a strong position to help support the US financial system during the recent events that impacted the banking industry,” commented Wells Fargo CEO Charlie Scharf in a statement. “Regional and community banks are an important part of our financial system and are uniquely positioned to serve their customers and communities.”\n\n> “I believe today’s crisis of confidence in the regional banking sector will further accelerate capital markets growth, and BlackRock will be a central player,” wrote BlackRock CEO Larry Fink on Friday.\n\n“Increased financing through the capital markets will require the scale, multi-asset capabilities and excellence in portfolio construction that BlackRock consistently delivers across market cycles,” he said in a statement.\n\nThat means bad news for regional banks could be good news for BlackRock – the lack of trust in regional banks will drive more investment into capital markets and BlackRock is poised to benefit as that happens.\n\n“Throughout our history, moments of market dislocation and disruption have served as inflection points for BlackRock,” he explained.\n\nRegulators also hired BlackRock in early April to help the US government in the sale of the $114 billion in assets it collected from the collapse> Citigroup and PNC did not address the banking crisis in their releases, but will likely answer questions about how they’ve weathered the turmoil and what they see ahead at their first-quarter presentations, planned for 11 a.m. ET.",
        "news_type": "Economic & Business"
    },
    {
        "title": "Still haven't filed your taxes? Here's what you need to know",
        "link": "https://www.cnn.com/2023/04/13/success/tax-filing-tips/index.html",
        "description": "So far this tax season, the IRS has received more than 90 million income tax returns for 2022. ",
        "published_date": "Fri, 14 Apr 2023 20:07:40 GMT",
        "source": "CNN",
        "source_country": "USA",
        "countries_mentioned": [
            "USA"
        ],
        "content": "New York CNN —\n\nSo far this tax season, the IRS has received more than 100 million income tax returns for 2022.\n\nThat means tens of millions of households have yet to file their returns. If yours is among them, here are some last-minute tax-filing tips to keep in mind as the Tuesday, April 18 deadline approaches.\n\nNot everyone has to file on April 18: If you live in a federally declared disaster area, have a business there — or have relevant tax documents stored by businesses in that area — it’s likely the IRS has already extended the filing and payment deadlines for you. Here is where you can find the specific extension dates for each disaster area.\n\nThanks to many rounds of extreme weather in recent months, for instance, tax filers in most of California — which accounts for 10% to 15% of all federal filers — have already been granted an extension until Oct. 16 to file and to pay, according to an IRS spokesperson.\n\nIf you’re in the armed forces and are currently or were recently stationed in a combat zone, the filing and payment deadlines for your 2022 taxes are most likely extended by 180 days. But your specific extended filing and payment deadlines will depend on the day you leave (or left) the combat zone. This IRS publication offers more detail.\n\nLastly, if you made little to no money last year (typically less than $12,950 for single filers and $25,900 for married couples), you may not be required to file a return. But you may want to anyway if you think you are eligible for a refund thanks to, for instance, refundable tax credits such as the Earned Income Tax Credit. (Use this IRS tool to gauge whether you are required to file this year.) You also are likely eligible to use IRS Free File (intended for those with adjusted gross income of $73,000 or less) so it won’t cost you to submit a return.\n\nYour paycheck may not be your only source of income: If you had one full-time job you may think that is the only income you made and have to report. But that’s not necessarily so.\n\nOther potentially taxable and reportable income sources include:\n\nInterest on your savings\n\nInvestment income (e.g., dividends and capital gains)\n\nPay for part-time or seasonal work, or a side hustle\n\nUnemployment income\n\nSocial Security benefits or distribution from a retirement account\n\nTips\n\nGambling winnings\n\nIncome from a rental property you own\n\nOrganize your tax documents: By now you should have received every tax document that third parties are required to send you (your employer, bank, brokerage, etc.).\n\nIf you don’t recall receiving a hard copy of a tax form in the mail, check your email and your online accounts — a document may have been sent to you electronically.\n\nHere are some of the tax forms you may have received:\n\nW-2 from your wage or salaried jobs\n\nfrom your wage or salaried jobs 1099-B for capital gains and losses on your investments\n\nfor capital gains and losses on your investments 1099-DIV from your brokerage or company where you own stock for dividends or other distributions from their investments\n\nfrom your brokerage or company where you own stock for dividends or other distributions from their investments 1099-INT for interest over $10 on your savings at a financial institution\n\nfor interest over $10 on your savings at a financial institution 1099-NEC from your clients, if you worked as a contractor\n\nfrom your clients, if you worked as a contractor 1099-K for payments for goods and services through third-party platforms like Venmo, CashApp or Etsy. The 1099-K is required if you made more than $20,000 in over 200 transactions during the year. (Next year the reporting threshold drops to $600.) But even if you didn’t get a 1099-K you still must report all the income that you made over third-party platforms in 2022.\n\nfor payments for goods and services through third-party platforms like Venmo, CashApp or Etsy. The 1099-K is required if you made more than $20,000 in over 200 transactions during the year. (Next year the reporting threshold drops to $600.) But even if you didn’t get a 1099-K you still must report all the income that you made over third-party platforms in 2022. 1099-Rs for distributions over $10 that you received for a pension, annuity, retirement account, profit-sharing plan or insurance contract\n\nfor distributions over $10 that you received for a pension, annuity, retirement account, profit-sharing plan or insurance contract SSA-1099 or SSA-1042S for Social Security benefits received.\n\n“Be aware that there’s no form for some taxable income, like proceeds from renting out your vacation property, meaning you’re responsible for reporting it on your own,” according to the Illinois CPA Society.\n\nOne very last-minute way to reduce your 2022 tax bill: If you’re eligible to make a tax-deductible contribution to an IRA and haven’t done so for last year, you have until April 18 to contribute up to $6,000 ($7,000 if you’re 50 or older). That will reduce your tax bill and augment your retirement savings.\n\nProofread your return before submitting it: Do this whether you’re using tax software or working with a professional tax preparer.\n\nLittle mistakes and oversights delay the processing of your return (and the issuance of your refund if you’re owed one). You want to avoid things like having a typo in your name, birth date, Social Security number or direct deposit number; choosing the wrong filing status (e.g., married vs single); making a simple math error; or leaving a required field blank.\n\nWhat to do if you can’t file by April 18: If you’re not able to file by next Tuesday, fill out Form 4868 electronically or on paper and send it in by April 18. You will be granted an automatic six-month extension to file.\n\nNote, however, that an extension to file is not an extension to pay. You will be charged interest (currently running at 7%) and a penalty on any amount you still owe for 2022 but haven’t paid by April 18.\n\nSo if you suspect you still owe tax — perhaps you had some income outside of your job for which tax wasn’t withheld or you had a big capital gain last year — approximate how much more you owe and send that money to the IRS by Tuesday.\n\nYou can choose to do so by mail, attaching a check to your extension request form. Make sure your envelope is postmarked no later than April 18.\n\nOr the more efficient route is pay what you owe electronically at IRS.gov, said CPA Damien Martin, a tax partner at EY. If you do that, the IRS notes you will not have to file a Form 4868. “The IRS will automatically process an extension of time to file,” the agency notes in its instructions.\n\nIf you opt to electronically pay directly from your bank account, which is free, select “extension” and then “tax year 2022” when given the option.\n\nYou can also pay by credit or debit card, but you will be charged a processing fee. Doing so, though, may become much more costly than just a fee if you charge your tax payment but don’t pay your credit card bill off in full every month, since you likely pay a high interest rate on outstanding balances.\n\nIf you still owe income taxes to your state, remember that you may need to go through a similar exercise of filing for an extension and making a payment to your state’s revenue department, Martin said.\n\nUse this interactive tax assistant for basic questions you may have: The IRS provides an “interactive tax assistant” that can help you answer more than 50 basic questions pertaining to your individual circumstance on income, deductions, credits and other technical questions.",
        "news_type": "Economic & Business"
    },
    {
        "title": "Retail spending fell in March as consumers pull back",
        "link": "https://www.cnn.com/2023/04/14/economy/march-retail-sales/index.html",
        "description": "Spending at US retailers fell in March as consumers pulled back amid recessionary fears fueled by the banking crisis.",
        "published_date": "Fri, 14 Apr 2023 14:29:52 GMT",
        "source": "CNN",
        "source_country": "USA",
        "countries_mentioned": [
            "USA"
        ],
        "content": "Washington, DC CNN —\n\nSpending at US retailers fell in March as consumers pulled back after the banking crisis fueled recession fears.\n\nRetail sales, which are adjusted for seasonality but not for inflation, fell by 1% in March from the prior month, the Commerce Department reported on Friday. That was steeper than an expected 0.4% decline, according to Refinitiv, and above the revised 0.2% decline in the prior month.\n\nInvestors chalk up some of the weakness to a lack of tax returns and concerns about a slowing labor market. The IRS issued $84 billion in tax refunds this March, about $25 billion less than they issued in March of 2022, according to BofA analysts.\n\nThat led consumers to pull back in spending at department stores and on durable goods, such as appliances and furniture. Spending at general merchandise stores fell 3% in March from the prior month and spending at gas stations declined 5.5% during the same period. Excluding gas station sales, retail spending retreated 0.6% in March from February.\n\nHowever, retail spending rose 2.9% year-over-year.\n\nThe effect of smaller tax returns\n\nSmaller tax returns likely played a role in last month’s decline in retail sales, along with the expiration of enhanced food assistance benefits, economists say.\n\n“March is a really important month for refunds. Some folks might have been expecting something similar to last year,” Aditya Bhave, senior US economist at BofA Global Research, told CNN.\n\nCredit and debit card spending per household tracked by Bank of America researchers moderated in March to its slowest pace in more than two years, which was likely the result of smaller returns and expired benefits, coupled with slowing wage growth.\n\nEnhanced pandemic-era benefits provided through the Supplemental Nutrition Assistance Program expired in February, which might have also held back spending in March, according to a Bank of America Institute report.\n\nA slowing labor market\n\nAverage hourly earnings grew 4.2% in March from a year earlier, down from the prior month’s annualized 4.6% increase and the smallest annual rise since June 2021, according to figures from the Bureau of Labor Statistics. The Employment Cost Index, a more comprehensive measure of wages, has also shown that worker pay gains have moderated this past year. ECI data for the first quarter of this year will be released later this month.\n\nStill, the US labor market remains solid, even though it has lost momentum recently. That could hold up consumer spending in the coming months, said Michelle Meyer, North America chief economist at Mastercard Economics Institute.\n\n“The big picture is still favorable for the consumer when you think about their income growth, their balance sheet and the health of the labor market,” Meyer said.\n\nEmployers added 236,000 jobs in March, a robust gain by historical standards but smaller than the average monthly pace of job growth in the prior six months, according to the Bureau of Labor Statistics. The latest monthly Job Openings and Labor Turnover Survey, or JOLTS report, showed that the number of available jobs remained elevated in February — but was down more than 17% from its peak of 12 million in March 2022, and revised data showed that weekly claims for US unemployment benefits were higher than previously reported.\n\nThe job market could cool further in the coming months. Economists at the Federal Reserve expect the US economy to head into a recession later in the year as the lagged effects of higher interest rates take a deeper hold. Fed economists had forecast subdued growth, with risks of a recession, prior to the collapses of Silicon Valley Bank and Signature Bank.\n\nFor consumers, the effects of last month’s turbulence in the banking industry have been limited so far. Consumer sentiment tracked by the University of Michigan worsened slightly in March during the bank failures, but it had already shown signs of deteriorating before then.\n\nThe latest consumer sentiment reading, released Friday morning, showed that sentiment held steady in April despite the banking crisis, but that higher gas prices helped push up year-ahead inflation expectations by a full percentage point, rising from 3.6% in March to 4.6% in April.\n\n“On net, consumers did not perceive material changes in the economic environment in April,” Joanne Hsu, director of the surveys of consumers at the University of Michigan, said in a news release.\n\n“Consumers are expecting a downturn, they’re not feeling as dismal as they were last summer, but they’re waiting for the other shoe to drop,” Hsu told Bloomberg TV in an interview Friday morning.\n\nThis story has been updated with context and more details.",
        "news_type": "Economic & Business"
    },
    {
        "title": "Analysis: Fox News is about to enter the true No Spin Zone",
        "link": "https://www.cnn.com/2023/04/14/media/fox-news-dominion-hnk-intl/index.html",
        "description": "This is it. ",
        "published_date": "Fri, 14 Apr 2023 06:41:00 GMT",
        "source": "CNN",
        "source_country": "USA",
        "countries_mentioned": [
            "USA"
        ],
        "content": "CNN —\n\nThis is it.\n\nThe media defamation trial of the century is on the precipice of kicking off in Wilmington, Delaware, in just days.\n\nJury selection in Dominion Voting Systems’ monster $1.6 billion defamation lawsuit took place all of Thursday, with 300 potential jurors being summoned to court. Good progress was made and the presiding judge noted that there were “more than enough jurors” to start the trial as scheduled on Monday.\n\nIt is there, in Courtroom 7E, where the biggest figures in Murdoch Media, accompanied by a throng of high-powered lawyers, will attempt to mount their defense after repeatedly failing to convince a judge to toss the now-historic case.\n\nA version of this article first appeared in the “Reliable Sources” newsletter. Sign up for the daily digest chronicling the evolving media landscape here.\n\nIt’s, frankly, extraordinary to write those words. When I watched Fox News broadcast election lies in the aftermath of the 2020 election, never did I expect the network to be held accountable in a meaningful way.\n\nI’ve covered Fox News for a while now. I’ve watched thousands and thousands of hours of the right-wing channel’s programming. I’ve seen its hosts over the years undermine public health, make gross anti-immigrant remarks, peddle lies and propaganda and push deranged conspiracy theories that were once reserved for the right-wing’s furthest fringes.\n\nThe network has always seemed to find a way to sail through the controversy, even the most hellish storms it has faced. Sometimes it has emerged even stronger and more emboldened than before.\n\nBut this time is different. This time, the normal tricks the network turns to during times of crisis will not free it from trouble. This time, in a court of law, the network will need to put forward an honest, fact-driven argument.\n\nFox News is about to enter the true No Spin Zone, where deception is strictly prohibited. Where it is not in charge. And where its top executives like Rupert Murdoch and Suzanne Scott and hosts like Tucker Carlson and Sean Hannity cannot simply ignore a request for comment and resort to, instead, attacking “the media” on-air.\n\nIn this setting, where lies cannot be casually told and truth cannot be distorted beyond reality to fit a dishonest narrative, it will be fascinating to see how the network fares. If the pre-trial hearings are any indicator, it won’t be pretty. The case hasn’t even started and the presiding judge has already lost his patience with Fox’s legal team and put them on notice.\n\nPerhaps the winds will shift for Fox News when the judge gavels in the trial on Monday. But if they play out like the last few weeks of court have, Fox News is in for a brutal ride.",
        "news_type": "Crime & Law"
    },
    {
        "title": "Silicon Valley Bank collapse renews calls to address disparities impacting entrepreneurs of color ",
        "link": "https://www.cnn.com/2023/04/13/business/silicon-valley-bank-entrepreneurs-of-color-reaj/index.html",
        "description": "When customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.",
        "published_date": "Thu, 13 Apr 2023 21:13:04 GMT",
        "source": "CNN",
        "source_country": "USA",
        "countries_mentioned": [
            "USA"
        ],
        "content": "CNN —\n\nWhen customers at Silicon Valley Bank rushed to withdraw billions of dollars last month, venture capitalist Arlan Hamilton stepped in to help some of the founders of color who panicked about losing access to payroll funds.\n\nAs a Black woman with nearly 10 years of business experience, Hamilton knew the options for those startup founders were limited.\n\nSVB had a reputation for servicing people from underrepresented communities like hers. Its failure has reignited concerns from industry experts about lending discrimination in the banking industry and the resulting disparities in capital for people of color.\n\nHamilton, the 43-year-old founder and managing partner of Backstage Capital, said that when it comes to entrepreneurs of color, “we’re already in the smaller house. We already have the rickety door and the thinner walls. And so, when a tornado comes by, we’re going to get hit harder.”\n\nEstablished in 1983, the midsize California tech lender was America’s 16th largest bank at the end of 2022 before it collapsed on March 10. SVB provided banking services to nearly half of all venture-backed technology and life-sciences companies in the United States.\n\nHamilton, industry experts and other investors told CNN the bank was committed to fostering a community of minority entrepreneurs and provided them with both social and financial capital.\n\nA bank run took down Silicon Valley Bank on March 10, as depositors withdrew $42 billion in a single day. Jeff Chiu/AP\n\nSVB regularly sponsored conferences and networking events for minority entrepreneurs, said Hamilton, and it was well known for funding the annual State of Black Venture Report spearheaded by BLK VC, a nonprofit organization that connects and empowers Black investors.\n\n“When other banks were saying no, SVB would say yes,” said Joynicole Martinez, a 25-year entrepreneur and chief advancement and innovation officer for Rising Tide Capital, a nonprofit organization founded in 2004 to connect entrepreneurs with investors and mentors.\n\nMartinez is also an official member of the Forbes Coaches Council, an invitation-only organization for business and career coaches. She said SVB was an invaluable resource for entrepreneurs of color and offered their clients discounted tech tools and research funding.\n\nMany women and people of color say they are turned away\n\nMinority business owners have long faced challenges accessing capital due to discriminatory lending practices, experts say. Data from the Small Business Credit Survey, a collaboration of all 12 Federal Reserve banks, shows disparities on denial rates for bank and nonbank loans.\n\nIn 2021, about 16% of Black-led companies acquired the total amount of business financing they sought from banks, compared to 35% of White-owned companies, the survey shows.\n\n“We know there’s historic, systemic, and just blatant racism that’s inherent in lending and banking. We have to start there and not tip-toe around it,” Martinez told CNN.\n\nAsya Bradley is an immigrant founder of multiple tech companies like Kinley, a financial services business aiming to help Black Americans build generational wealth. Following SVB’s collapse, Bradley said she joined a WhatsApp group of more than 1,000 immigrant business founders. Members of the group quickly mobilized to support one another, she said.\n\nImmigrant founders often don’t have Social Security numbers nor permanent addresses in the United States, Bradley said, and it was crucial to brainstorm different ways to find funding in a system that doesn’t recognize them.\n\n“The community was really special because a lot of these folks then were sharing different things that they had done to achieve success in terms of getting accounts in different places. They also were able to share different regional banks that have stood up and been like, ‘Hey, if you have accounts at SVB, we can help you guys,’” Bradley said.\n\nMany women, people of color and immigrants opt for community or regional banks like SVB, Bradley says, because they are often rejected from the “top four banks” — JPMorgan Chase, Bank of America, Wells Fargo and Citibank.\n\nIn her case, Bradley said her gender might have been an issue when she could only open a business account at one of the “top four banks” when her brother co-signed for her.\n\n“The top four don’t want our business. The top four are rejecting us consistently. The top four do not give us the service that we deserve. And that’s why we’ve gone to community banks and regional banks such as SVB,” Bradley said.\n\nNone of the top four banks provided a comment to CNN. The Financial Services Forum, an organization representing the eight largest financial institutions in the United States has said the banks have committed millions of dollars since 2020 to address economic and racial inequality.\n\nLast week, JPMorgan Chase CEO Jamie Dimon told CNN’s Poppy Harlow that his bank has 30% of its branches in lower-income neighborhoods as part of a $30 billion commitment to Black and Brown communities across the country.\n\nWells Fargo specifically pointed to its 2022 Diversity, Equity, and Inclusion report, which discusses the bank’s recent initiatives to reach underserved communities.\n\nThe bank partnered last year with the Black Economic Alliance to initiate the Black Entrepreneur Fund — a $50 million seed, startup, and early-stage capital fund for businesses founded or led by Black and African American entrepreneurs. And since May 2021, Wells Fargo has invested in 13 Minority Depository Institutions, fulfilling its $50 million pledge to support Black-owned banks.\n\nBlack-owned banks work to close the lending gap and foster economic empowerment in these traditionally excluded communities, but their numbers have been dwindling over the years, and they have far fewer assets at their disposal than the top banks.\n\nOneUnited Bank, the largest Black-owned bank in the United States, manages a little over $650 million in assets. By comparison, JPMorgan Chase manages $3.7 trillion in assets.\n\nSVB’s collapse could spark future change, entrepreneur says\n\nBecause of these disparities, entrepreneurs also seek funding from venture capitalists. In the early 2010s, Hamilton intended to start her own tech company — but as she searched for investors, she saw that White men control nearly all venture capital dollars. That experience led her to establish Backstage Capital, a venture capital fund that invests in new companies led by underrepresented founders.\n\n“I said, ‘Well, instead of trying to raise money for one company, let me try to raise for a venture fund that will invest in underrepresented — and now we call them underestimated — founders who are women, people of color, and LGBTQ specifically,’ because I am all three,” Hamilton told CNN.\n\nSince then, Backstage Capital has amassed a portfolio of nearly 150 different companies and has made over 120 diversity investments, according to data from Crunchbase.\n\nBut Bradley, who is also an ‘angel investor’ of minority-owned businesses, said she remains “really hopeful” that community banks, regional banks and fintechs “will all stand up and say, ‘Hey, we are not going to let the good work of SVB go to waste.’”",
        "news_type": "Economic & Business"
    },
    {
        "title": "Why Nigel Farage Is Bringing MAGA-Style Rallies to the UK",
        "link": "https://www.nytimes.com/2025/04/30/world/europe/nigel-farage-rallies-uk-local-elections.html",
        "description": "Nigel Farage, a right-wing populist ally of President Trump, has been touring England ahead of local elections, hoping to convert a polling surge for his party into power.",
        "published_date": "Wed, 30 Apr 2025 04:01:08 +0000",
        "source": "NewYorkTimes",
        "source_country": "USA",
        "countries_mentioned": [
            "USA"
        ],
        "content": "Thursday’s elections, while limited in number, are the first test of Reform’s ability to convert that polling into power. Analysts expect the party to emerge with hundreds of municipal seats and two regional mayors. It’s also favored to win a closely fought special election for a parliamentary seat the same night.\n\nMr. Farage is a charismatic, fluent speaker who, like Mr. Trump, embraces an “us-versus-them” rhetoric when it comes to undocumented immigrants and other political parties. His rallies stand out in a country where the bulk of politics long ago switched from public speechmaking to TV and now social media.\n\nBritish politicians tend to address large crowds now only during election campaigns or at their annual party conferences. Jeremy Corbyn, the hard-left former leader of the Labour Party, was a notable exception in 2017 when he spoke at the Glastonbury music festival and was serenaded enthusiastically by concertgoers.\n\n“Rallies have gone out of political fashion,” said Neil Kinnock, who led Labour from 1983 to 1992, and was one of the most accomplished orators of his era. He was famed for his platform speeches, including his 1983 warning against voting Conservative and his passionate denunciation of the hard left in 1985. He’s also cited in Britain as an example of oratory’s dangers: An arena rally he held before the 1992 election was seen by some critics as contributing to Labour’s defeat that year, though polling evidence contradicts the theory.",
        "news_type": "Political"
    },
    {
        "title": "Out of War’s Shadow: Vietnam on the Move",
        "link": "https://www.nytimes.com/2025/04/30/world/asia/vietnam-country-progress-growth.html",
        "description": "Nothing defines Vietnam more right now than the desire to be seen anew, to have the country and its people recognized for their strengths.",
        "published_date": "Wed, 30 Apr 2025 04:01:26 +0000",
        "source": "NewYorkTimes",
        "source_country": "USA",
        "countries_mentioned": [
            "USA"
        ],
        "content": "On April 30, 1975, Vu Dang Toan commanded the first tank to smash through the main gate of Saigon’s Independence Palace. After seeing so many die — after grinding away his youth battling the Americans and the forces of South Vietnam — he was there, alive and surprised, for the war’s weary end.\n\nIt was a full surrender. At the United States Embassy nearby, helicopters had already carried away the last Americans as the South’s fighters disappeared, ditching their uniforms and boots in the streets.\n\n“I’m proud,” Mr. Toan said, “that as a soldier, I completed the mission.”\n\nFifty years later, he was a long way from that moment, sitting in his comfortable home north of Hanoi, encircled by rice fields, not far from factories pumping out Apple Watches.\n\nPhotos on the wall showed his tank on the palace lawn. Wearing his military uniform, he sipped tea in a dark wood chair beside his grandson Dang Hoang Anh, 14, a bright-eyed soccer fan wearing a school uniform in Chelsea blue.\n\nThe boy pictured his life in different terms.\n\nHis goal? “To study in Canada.”\n\nHis mission? “To make money.”\n\n“My grandparents’ generation, they had to go to war and people died,” Hoang Anh said. “Now we don’t worry about that. We worry about school and jobs.”",
        "news_type": "Political"
    },
    {
        "title": "How Francis Challenged and Embraced Africa’s Rising Catholic Population",
        "link": "https://www.nytimes.com/2025/04/30/world/africa/next-pope-francis.html",
        "description": "Nowhere in the world is the Roman Catholic Church growing faster than in Africa, a continent Francis showered with attention.",
        "published_date": "Wed, 30 Apr 2025 09:02:17 +0000",
        "source": "NewYorkTimes",
        "source_country": "USA",
        "countries_mentioned": [
            "USA"
        ],
        "content": "When Pope Francis presided over a Mass that incorporated elements of Congolese tradition in St. Peter’s Basilica in 2019, it was seen as a sign of his enduring commitment to Roman Catholics across Africa.\n\nWhen he visited African migrants in southern Italy and later kissed the feet of South Sudan’s two competing warlords, his actions drew more attention to his focus on a continent where the number of Catholics is growing faster than anywhere else in the world.\n\n“Being from Latin America, he felt for our predicaments as a third-world continent struggling in a world controlled from far away,” said Cardinal John Onaiyekan, the former archbishop of Abuja, Nigeria, who voted in the 2013 conclave that elected Francis.\n\nAs Cardinal Onaiyekan and his peers prepare to meet in the Sistine Chapel next week to elect the new pope after Francis’ death, the question of how Africa’s rising Catholic population might shape the next papacy and the church’s future has become more timely than ever.",
        "news_type": "Social Issues & Human Rights"
    },
    {
        "title": "Families Are Split as Pakistan Deports Thousands of Afghan Refugees",
        "link": "https://www.nytimes.com/2025/04/30/world/asia/afghan-pakistan-deportations.html",
        "description": "Many undocumented Afghan migrants have Pakistani spouses and have lived in the country for years. Nevertheless, the government says they must leave.",
        "published_date": "Wed, 30 Apr 2025 04:01:07 +0000",
        "source": "NewYorkTimes",
        "source_country": "USA",
        "countries_mentioned": [
            "USA"
        ],
        "content": "Every night in Karachi, a bustling port city in Pakistan, Fatima Bibi goes to bed in fear. The sound of police sirens from the streets outside makes her anxious. She wonders whether a knock at the door might tear her family apart.\n\nHer husband, Sher Zada, is an Afghan refugee. His family fled conflict in Afghanistan when he was just a boy, in 1992, and Pakistan is the only home he knows. Ms. Bibi’s family long hoped that despite Mr. Zada’s undocumented status, his close ties to the country and marriage to a Pakistani national would eventually help him secure permanent residency, if not citizenship.\n\nBut to the Pakistani government, it is officially past time for Mr. Zada to leave.\n\nOn March 31, a government-imposed deadline expired for many Afghans in Pakistan to find another country of refuge. Those without legal status who remain in Pakistan, like Mr. Zada, now face repatriation. Less than three weeks after the deadline’s expiration, the Pakistani minister of state for interior, Talal Chaudhry, announced at a news conference that more than 80,000 Afghans had already been expelled.\n\nThe deportations could subject the refugees to perilous conditions under the heavy hand of Taliban rule in Afghanistan. And, if they are married to Pakistanis, it could mean leaving their families behind.",
        "news_type": "Social Issues & Human Rights"
    },
    {
        "title": "U.K. Joins U.S. in Strike Against Houthis in Yemen",
        "link": "https://www.nytimes.com/2025/04/30/world/middleeast/uk-us-yemen-houthis-strikes.html",
        "description": "There was no immediate comment from the American military about the joint operation, the first since President Trump took office.",
        "published_date": "Wed, 30 Apr 2025 09:52:00 +0000",
        "source": "NewYorkTimes",
        "source_country": "USA",
        "countries_mentioned": [
            "USA"
        ],
        "content": "Britain’s military said it had carried out a joint operation with U.S. forces against the Houthi militia in Yemen for the first time since President Trump re-entered the White House and stepped up attacks on the Iran-backed group.\n\nThere was no immediate comment from the American military about the operation, which the British Defense Ministry said early Wednesday was carried out overnight “to degrade Houthi capabilities and prevent further attacks against U.K. and international shipping.”\n\nTyphoon jets using precision guided bombs took part in the mission, the ministry said in a statement. The target was “a cluster of buildings, used by the Houthis to manufacture drones of the type used to attack ships in the Red Sea and Gulf of Aden, located some 15 miles south of Sana,” the statement added, referring to the Yemeni capital.\n\nThe ministry gave no details about potential casualties or damage, but said that there had been careful planning to reduce risk to civilians or nonmilitary infrastructure.",
        "news_type": "Military & Defense"
    },
    {
        "title": "Victoria’s hot seats LIVE updates: Peter Dutton visits anti-Monique Ryan pub; Frydenberg condemns antisemitic stunt at appearance with Hamer",
        "link": "https://www.smh.com.au/politics/federal/victoria-s-hot-seats-live-updates-cost-of-living-in-focus-in-final-week-of-campaigning-20250425-p5lu8k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "description": "Pre-poll antics in Kooyong have just ratcheted up another notch, with the Liberal Party now threatening to take Boroondara council to court.",
        "published_date": "Wed, 30 Apr 2025 22:00:43 +1000",
        "source": "The Sydney Morning Herald",
        "source_country": "Australia",
        "countries_mentioned": [
            "India",
            "Australia"
        ],
        "content": "Spend any time in the electorate of Goldstein and it’s hard to avoid the attack ads targeting teal independent MP Zoe Daniel.\n\nThere’s the giant billboard opposite the Kingston City Hall authorised by Australians for Prosperity, featuring a photo of Daniel’s head in a balloon.\n\n“All hot air: Vote for change,” the ad states. “Blocked: Local voices. Disinterested: In local crime. Zero Delivery: On cost of living.”\n\nAt the pre-polling booths, flyers are being handed out with the headline: “Repeal the Teal”. They state: “Teals … Not open. Not accountable. Not independent. Not worth it. Put Zoe Daniel last.”\n\nEarlier in the campaign I spotted trucks with mobile billboards from another lobby group, Better Australia, driving around the electorate and parked prominently, including outside the Jewish community forum organised by members of the Jewish community at the Brighton Hebrew Congregation.\n\nFlyers distributed by Better Australia state: “Don’t trust the Teals this time!” They also criticise Daniel for signing a letter calling for Australia to reinstate funding for UNRWA in February 2024 and claim she has ignored warnings from Jewish and other communities about rising hate and antisemitism. UNRWA is the United Nations’ relief agency assisting Palestinians.\n\nBetter Australia has defended its members wearing yellow vests in Kooyong.\n\nAs my colleague Rachael Dexter has reported in Kooyong, Better Australia has also come under scrutiny for its members wearing yellow vests at the pre-polling booths which say “Community Advisor” and look very similar to the official vests worn by Australian Electoral Commission staff.\n\nA spokesman for the Liberal Party said neither it nor Tim Wilson, the party’s candidate for Goldstein, have engaged Australians for Prosperity, Repeal the Teal or Better Australia.\n\nI thought it was worthwhile taking a look at exactly who these groups are, and who is behind them.\n\nYou can get in touch about any ads you see in the electorate or information on the lobby groups behind them using the form below.\n\nWho are Australians for Prosperity?\n\nAustralians for Prosperity is a lobby group headed by former Liberal MP Jason Falinski, a friend of Wilson, the Liberal candidate for Goldstein.\n\nA Liberal Party spokesman described Falinski and Wilson’s relationship as that of “former parliamentary colleagues”. However, Falinksi told The Age they are “good friends”.\n\nThe pair came under scrutiny when, as MPs in 2019, they used a taxpayer-funded inquiry into Labor’s franking credits policy to raise funds for the Liberals.\n\nFormer federal MP Jason Falinski now heads Australians for Prosperity. Credit: Dominic Lorrimer\n\nLetters to self-managed super fund trustees from Falinski, who was then part of parliament’s Standing Committee on Economics, using the inquiry to entice voters to donate to the Liberal Party in exchange for an audience with Wilson, who was then the committee chair.\n\nFalinski and Wilson also wrote a joint column for the Australian Financial Review from 2022 to 2024. Both lost their seats at the 2022 election.\n\nFalinski says he has contacted Wilson “from time to time” over the course of the election campaign just to check in on how he is going, but “we don’t talk tactics”. He says he is not co-ordinating the Australians for Prosperity campaign with Wilson, nor with the Liberal Party.\n\nBefore Falinski took over running Australians for Prosperity, Julian Simmons, the former Liberal MP for the Brisbane seat of Ryan, was the executive director of the group.\n\nSimmonds was this month appointed acting chief executive of Economic Development Queensland by Queensland’s new Liberal National state government. He began in that position on April 22 and references to him have been removed from the Australians for Prosperity website.\n\nAustralians for Prosperity has received significant funding from the coal industry, and electoral records show it received $725,000 in donations from Coal Australia.\n\nFalinski says Australians for Prosperity is not a lobby group for the coal industry and the majority of its funding comes from “ordinary Australians”, including some high net-worth individuals who made their money in manufacturing and farming, and a property heiress.\n\nHe says the teals’ links to Climate 200 should also be subject to scrutiny.\n\nWho are Repeal the Teal?\n\nRepeal the Teal is a lobby group founded by the Jewish activist network, J-United, which is affiliated with the right-wing lobby group Advance Australia. The campaign has been active in other teal-held electorates, including Kooyong.\n\nThe campaign is also busy on social media, as Advance Australia has spent $255,676 in the past 90 days in Victoria on advertising with Meta, the owner of Instagram and Facebook.\n\nRepeal the Teal’s materials are authorised by Harriet Warlow-Shill, a Melbourne lawyer who hosted an online event in March called “Does my teal support terror? One woman’s journey to find out”.\n\nWarlow-Shill says the Repeal the Teal campaign is not linked to the Liberal Party and she is no longer a Liberal Party member.\n\n“I resigned from the party on 27 February, 2025 to ensure this is a stand-alone effort by myself and a few other ladies,” she says. “We have no prior experience running campaigns.”\n\nA Repeal the Teal flyer.\n\nWho are Better Australia?\n\nBetter Australia is incorporated in NSW and was formerly known as “Better NSW Incorporated” before changing its name in January.\n\nIt is a spin-off of Better Council, which targeted the Greens during last year’s local council elections in NSW, and has now turned its focus to teal-held seats including Goldstein.\n\nA company search shows Sophie Calland is Better Australia’s public officer, and in an email, she says the group is an “independent non-partisan community initiative”.\n\nA truck with Better Australia advertising.\n\n“We believe a minority government comprising of Greens and teal ‘independents’ will be incredibly destructive for everyday Australians,” Callan says in the email.\n\n“Former minority governments have led to stalling legislation and dramatic swings in government policy that do not align with what the public has voted for. It means whoever is in power must negotiate with extreme or elite voices that do not represent the public.”\n\nCalland says Better Australia isn’t affiliated with any political party, although she is a member of the Labor Party.\n\n“We are registered as a significant third-party entity for the upcoming 2025 federal election,” she says.\n\nCalland says she has had no contact with Wilson during the campaign.\n\n“But Better Australia’s local volunteers in Goldstein are doing everything they can to ensure that voters don’t get tricked by the teals in the election,” she says.\n\nBetter Australia also has an extensive online presence, having spent $66,010 in Victoria in the past 90 days on advertising with Meta, the owner of Facebook and Instagram.",
        "news_type": "Political"
    },
    {
        "title": "When will Mam return to the Broncos?",
        "link": "https://www.smh.com.au/sport/nrl/when-will-mam-return-to-the-broncos-20250430-p5lvjd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "description": "Darren Lockyer and Ezra Mam discuss when Ezra Mam will return to the Brisbane Broncos.",
        "published_date": "Wed, 30 Apr 2025 21:57:51 +1000",
        "source": "The Sydney Morning Herald",
        "source_country": "Australia",
        "countries_mentioned": [
            "Australia"
        ],
        "content": "When will Mam return to the Broncos?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "news_type": "Social Issues & Human Rights"
    },
    {
        "title": "Your May hit list: The hot, new and just-reviewed places to check out this month",
        "link": "https://www.smh.com.au/goodfood/sydney-eating-out/your-may-hit-list-the-hot-new-and-just-reviewed-places-to-check-out-this-month-20250429-p5lv6h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "description": "From a food truck serving some of Sydney’s best tacos to a reborn 60-year-old family-run restaurant, here’s where to eat and drink in Sydney this month.",
        "published_date": "Wed, 30 Apr 2025 21:42:38 +1000",
        "source": "The Sydney Morning Herald",
        "source_country": "Australia",
        "countries_mentioned": [
            "Australia"
        ],
        "content": "Collection\n\nYour May hit list: The hot, new and just-reviewed places to check out this month\n\nFrom a petrol-station food truck serving some of Sydney’s best tacos to a reborn 60-year-old family-run restaurant, here’s where (and what) to eat and drink in Sydney this month.",
        "news_type": "Economic & Business"
    },
    {
        "title": "Gus backs Des to fix the Titans' problems",
        "link": "https://www.smh.com.au/sport/nrl/gus-backs-des-to-fix-the-titans-problems-20250430-p5lvjb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "description": "Phil Gould reveals why he does not believe Des Hasler will be axed as head coach of the Gold Coast Titans.",
        "published_date": "Wed, 30 Apr 2025 21:22:53 +1000",
        "source": "The Sydney Morning Herald",
        "source_country": "Australia",
        "countries_mentioned": [
            "Australia"
        ],
        "content": "Gus backs Des to fix the Titans' problems\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "news_type": "Social Issues & Human Rights"
    },
    {
        "title": "Aiden needs abetting",
        "link": "https://www.smh.com.au/national/nsw/aiden-needs-abetting-20250430-p5lva5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "description": "Vera’s a real case.",
        "published_date": "Wed, 30 Apr 2025 21:00:00 +1000",
        "source": "The Sydney Morning Herald",
        "source_country": "Australia",
        "countries_mentioned": [
            "USA",
            "Australia"
        ],
        "content": "“So sad. No more Vera,” laments Robert Hosking of Paddington. “But it was the penultimate episode that caught my attention, when her longtime associate gets a nasty bashing by the baddy. All I could think was: ‘Oh my God, they killed Kenny!’”\n\n“When I moved to Sydney in the ’70s, I used to see a bearded man wheeling a mysterious wooden box on wheels around the Hyde Park area,” writes Donald Hawes of Peel. “There was even a wooden ramp built over the park steps near Museum Station, just wide enough for his vehicle. It was only when his death was announced that I discovered that he was a knife sharpener (C8) and local identity.”\n\nJohn Boddington of Dalton remembers a similar local identity: “His name was Harold Wright (‘The Sharpening King’) and his extraordinary sharpening wagon is now in the National Museum. I have a strong suspicion that Heath Robinson had a hand in the design. I can recall seeing Harold’s wagon as a small boy a long time ago and longing to have a bash at turning all the stuff on.”\n\n“While I try to keep my Ukrainian stories light-hearted, Doug McLaughlin’s memories of subs bombing Sydney in WWII (C8) have certainly triggered some recent trauma,” admits Chris Keane. “A few days ago I was at home in Seattle when my phone started blowing up with messages from ‘my’ kids in Ukraine. Their previously unscathed city was being actively targeted with Russian missiles and drones. Over the course of a fraught hour I was inundated with messages like ‘I’m really scared’, ‘it’s very close, the ground is shaking and everyone is crying’ and ‘in case I don’t see you again, thanks for everything’. Of course, right now as I write, I’ve started crying again. Perhaps Doug can provide more details about when the nightmares will dissipate?”\n\nThe lobster discussion (C8) goes offshore with former New York knife fancier Ellen Kassel of Collaroy again on point: “Honeymoon – sailing down Maine. Lobster, lobster, lobster. Day three of honeymoon – big bad rash all over! Didn’t know which new thing in my life was causing it. Thankfully, it was the lobsters.”",
        "news_type": "Social Issues & Human Rights"
    },
    {
        "title": " Clive Palmer&#039;s Trumpets blowing nothing but hot air",
        "link": "https://independentaustralia.net/politics/politics-display/clive-palmers-trumpets-blowing-nothing-but-hot-air,19681?utm_source=rss&utm_medium=rss&utm_campaign=IA_Feed",
        "description": " <a href=\"https://independentaustralia.net/politics/politics-display/clive-palmers-trumpets-blowing-nothing-but-hot-air,19681?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\" title=\"View Information: Clive Palmer&#039;s Trumpets blowing nothing but hot air\">\r\n\t\t\t\t\t<img src=\"https://independentaustralia.net/i//article/img/article-19681-thumb.jpg\" width=\"65\" height=\"65\" alt=\"Clive Palmer&#039;s Trumpets blowing nothing but hot air\" style=\"margin:0 10px 3px 0;float:left;vertical-align:top;border:1px solid #ccc;\"/></a> Presided over by Mr Malice himself, Clive Palmer, Trumpet of Patriots (T.O.P.) is the bastard child of self-serving compromise. <a href=\"https://independentaustralia.net/politics/politics-display/clive-palmers-trumpets-blowing-nothing-but-hot-air,19681?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\">read now...</a>",
        "published_date": "Tue, 29 Apr 2025 17:00:00 +1000",
        "source": "Independent Australia",
        "source_country": "Australia",
        "countries_mentioned": [
            "USA",
            "Australia"
        ],
        "content": "Clive Palmer (left) and Trumpets leader Suellen Wrightson aren't likely to make a dent in this year's election (Screenshots via YouTube - edited)\n\nInvestigations editor Ross Jones takes a closer look at Clive Palmer's latest indulgence, Trumpet of Patriots.\n\nPRESIDED OVER BY Mr Malice himself, Clive Palmer, Trumpet of Patriots (T.O.P.) is the bastard child of self-serving compromise.\n\nIn an opaque deal involving a management consultant (credited with forming the unregistered political party T.O.P. and coming up with the bizarre name), a moribund but still registered political party (the Federation Party), a non-party (United Australia Party) — and maybe some wheel grease.\n\nPalmer de-registered his United Australia Party in September 2022.\n\nThe party said it was to save on admin costs as it lay in hiatus for the 2025 Election, but a former candidate went public to allege:\n\n“They deregistered to avoid any accountability, to avoid any transparency and to avoid any liability.”\n\nDespite having access to the best advice money can buy, Palmer’s attempt to re-register UAP was knocked back by the High Court last February.\n\nFoiled. And Senator Ralph Babet is stranded in his Victorian Senate seat.\n\nIf, as many, including Sydney Criminal Lawyers, suggest, Palmer needs a dog in the election race, 'because he wants to safeguard the billions of dollars in profit that come from the mining, iron, nickel and local holdings', he needed to act fast.\n\nThere was no way Palmer was going to be able to round up 1,500 bona fide members to get a party registered with the Australian Electoral Comission (AEC) in time for the 2025 Election (or perhaps anytime), but he had a mate, Nick Duffield, a Trumpist management consultant who had started the whole Trumpet of Patriots thing.\n\nDuffield had whipped up a bit of initial enthusiasm. Not enough to form a political party but enough to convince the right-wing Christians and, importantly, AEC-registered The Australian Federation Party that a merger might not be a bad idea.\n\nOn 3 December 2024, the AEC recognised a name change from Australian Federation Party to Trumpet of Patriots.\n\nExactly when and how Malice and Duffield did this whole deal is opaque, but they pulled it off, the lurid yellow advertising with its preposterous claims being the evidence.\n\nAccording to its website:\n\n‘The Trumpet of Patriots will preference Labor and the Liberals last in the 2025 Federal Election to end the two-party duopoly and make Australia great.’\n\nThis is where the average Trumpet of Patriots voter might become confused — who to preference?’\n\nThere is a plethora of choice for those who like to pick their poison.\n\nFrom the simple racism and xenophobia of One Nation to the “Up yours!” of Craig Kelly and the Libertarians, from the anti-woke of HEART to the Drag Queen Storytime of Family First, T.O.P. voters will be swooning with choice.\n\nThe thing is, it just doesn’t matter because there will be bugger-all T.O.P. voters. Friends and relatives of the many T.O.P. candidates plus a few sundry suckers if they’re lucky. T.O.P.’s preferences will be minuscule and won’t trouble the scorer.\n\nNone of its candidates has a chance.\n\nMany of the current crop of candidates hope they can do a Ralph Babet, some probably fantasise about it at night. Surf Clive’s money to Canberra. Like winning Deal or No Deal.\n\nPalmer’s old UAP got 4.1 per cent overall last time around in 2021 at a cost of $125 million, but Trumpet is not UAP.\n\nFor starters, there is the name. Over the last few months, its spiritual beacon has gone from hero to sub-zero, from saviour to threat. It can’t be escaped, it is right there at the start of the name.\n\nThen there is the logo. The thing holding the trumpet has got blowhard baked right in, referential to its owner, maybe. A malignant Teletubbie was the model, frightening in a too-much-medication kind of way.\n\nBut most of all, there is ennui.\n\nAustralians have seen this all before. P.U.P., UAP, T.O.P. — always the same. Massive ad spends, lurid graphics, a squillion unknown candidates, fantastical claims.\n\nThe playbook worked well the first time around.\n\nIn the first Palmer United Party (P.U.P.) iteration, back in the 2013 Election, Malice himself became Member for Fairfax, famous for sleeping in the Chamber. The party also catapulted Dio Wang, Glenn Lazarus and Jacqui Lambie to the Senate.\n\nDio and Glen fell by the wayside, but Jacqui went on to a successful political future after she parted company with Clive.\n\nPalmer deregistered P.U.P. in 2016 but then, in 2018, registered the United Australia Party.\n\nSecond time round, in 2018 as the United Australia Party, Palmer fell a bit short of P.U.P.’s 2013 performance.\n\nThe party failed to win any electoral contest. Lots of money, no cigars.\n\nThird time, in 2021, again as UAP — “Meh”.\n\nAgain, a lot of money, ads everywhere, but this time some success with one Victorian Senator, Ralph Babet, a real estate agent from the wide development lands just out of Melbourne’s east, around Berwick. Ralph is a right-wing warrior who, thankfully, has had little influence on the body politic to date.\n\nWould you buy a property from this man?\n\nNow, in 2025, Palmer’s fourth go with Trumpet of Patriots, same tired formula.\n\nRemember UAP’s 2021 advertising when Craig Kelly was going to be Australia’s next prime minister?\n\nDidn’t happen, Craig ended up defecting to the Libertarians, a move that will surely strangle any hopes for that party.\n\nSpare a thought for Trumpet’s alleged leader and next prime minister, former Cessnock Councillor Suellen Wrightson.\n\nShe is running in Hunter, a seat held by Labour since basically forever.\n\nSuellen is listed in the ‘Other’ column on the ballot paper alongside other fringe parties of various stripes.\n\nHappily for her, there will probably be a vacancy coming up with the Libertarians after this election.\n\nRoss Jones is IA's investigations editor and the author of 'Ashbygate: The Plot to Destroy Australia's Speaker'.\n\nRelated Articles",
        "news_type": "Political"
    },
    {
        "title": " Coalition&#039;s resurrection hopes slump as punters dump Temu Trump",
        "link": "https://independentaustralia.net/politics/politics-display/coalitions-resurrection-hopes-slump-as-punters-dump-temu-trump,19644?utm_source=rss&utm_medium=rss&utm_campaign=IA_Feed",
        "description": " <a href=\"https://independentaustralia.net/politics/politics-display/coalitions-resurrection-hopes-slump-as-punters-dump-temu-trump,19644?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\" title=\"View Information: Coalition&#039;s resurrection hopes slump as punters dump Temu Trump\">\r\n\t\t\t\t\t<img src=\"https://independentaustralia.net/i//article/img/article-19644-thumb.jpg\" width=\"65\" height=\"65\" alt=\"Coalition&#039;s resurrection hopes slump as punters dump Temu Trump\" style=\"margin:0 10px 3px 0;float:left;vertical-align:top;border:1px solid #ccc;\"/></a> It would take a miracle of messianic proportions for Peter Dutton to defy the odds and secure victory in the forthcoming Federal Election. <a href=\"https://independentaustralia.net/politics/politics-display/coalitions-resurrection-hopes-slump-as-punters-dump-temu-trump,19644?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\">read now...</a>",
        "published_date": "Thu, 17 Apr 2025 16:00:00 +1000",
        "source": "Independent Australia",
        "source_country": "Australia",
        "countries_mentioned": [
            "USA",
            "India",
            "Australia"
        ],
        "content": "It would take a miracle of messianic proportions for Peter Dutton to defy the odds and secure victory in the forthcoming Federal Election, says founder Dave Donovan.\n\nDESPITE being an alumnus of St Paul's Anglican School, located in the ominously prophetic suburb of Bald Hills in northern Brisbane, Peter Dutton is reportedly not particularly religious.\n\nIn any case, as he takes a break from a bruising fortnight of campaigning this long weekend, relaxing over a non-sacramental wine or two in one of his many houses, perhaps Dutton may pause to consider what this time of year, Easter, really represents — utterly implausible miracles. That even if you have been mocked, derided, crucified and killed stone dead, don't give up. If you keep on trying, you just never know. Be like Jesus and don't leave any stone unturned, especially one sealing you in a crypt.\n\nMaybe he might consider those things. But probably not. Because, to be fair, even the son of god might baulk at a job as big as resurrecting Peter Dutton's faltering electoral hopes. IA does not want to speak ill of the dead, naturally, but based on the first two weeks of the current electoral campaign, Peter Dutton is floundering worse than a half-eaten Friday prawn in an uncollected wheelie bin next Wednesday.\n\nTo briefly sum up the debacle, for a start, many people have taken to deriding Peter Dutton as Australia's “Temu Trump”. That is, a cheap, second-rate version of the real thing. But now with the original strongman becoming deeply disdained almost everywhere, Dutton’s halting impression of Trump is fast becoming even more distasteful.\n\nSomehow, incredibly, the Opposition Leader’s pratfalls, gaffes, hijinks and flagrant fibs are seen as even less charming than those of the Teflon Felon. Aussies, it seems, have made up their minds about Dutton. After watching the chaos wrought by Trump in America, they seem to have decided that you have to be very careful what you \"Wish\" for.\n\nIf Dutton had any sense at all – a proposition that even the most careful election watchers have so far found only faint evidence to support – he would stop sipping that unholy wine and get royally pissed.\n\nBut then again, you never know. Anything is possible for the Liberal Party faithful. And particularly in Australia, miracles can and do occur at Federal election time.\n\nNo, Peter Dutton is not the messiah. But he does have someone on his side who is almost as influential in this Down Underworld. The unholy “Sun God” himself, Rupert Murdoch, flanked by his many malignant minions. Against all the odds, for example, “Rupee” manifested the ascension of the \"Mad Monk\", Tony Abbott, and engineered the reanimation of “Lazarus with a Triple Bypass”, John Howard. Both utterly unelectable in the minds of almost all sane individuals, but nonetheless risen up via the fiendish interventions of the Sun’s many Heralds and his ever-trumpeting host.\n\nThe lesson here today is that nothing is certain under the Sun. Nothing is assured. Need we even mention “Pentecostal” Scott Morrison’s election “miracle” of 2019? Dearly beloved, this publication is, despite rather shamelessly referencing religious tropes throughout this seasonal editorial, staunchly and avowedly agnostic and secular. Nevertheless, we would like to casually mention that Morrison’s subsequent administration (amongst many other calamities) featured a literal plague of biblical proportions.\n\nTo state it baldly, IA considers that Peter Dutton would make a dreadful leader for Australia. Australia appears to agree.\n\nSeldom has the danger he poses to our nation been better communicated than by an excommunicated Murdoch scribe by the name of Tony Koch on X/Twitter.\n\n‘Dutton's failure is because he is a nasty, negative, standover bully who is not very bright. He relies on his size, his ugliness, to make people cower.’\n\nUnfortunately, Tony’s concludes that post by suggesting Dutton's many unsavoury attributes may preclude him from becoming Australia's next prime minister:\n\n‘Won't work old mate. The dogs are barking the numbers in your party for a replacement.’\n\nTony Koch is a good man and an idealist. But perhaps a trifle naive, because Tony Abbott was a literal pugilist who punched a hole in the wall beside a female political rival’s head, amongst other vile acts, as IA faithfully reported here.\n\nSadly, no behaviour is too untoward to disqualify someone for high political office. Not in America, as we have seen with the felon Trump, and especially not in Australia, where the Murdoch media and its fellow dissemblers hold a manifestly market-distorting near monopoly over metropolitan media circulation, and therefrom public opinion.\n\nIt is understandable to write off such obviously inadequate candidates for public office. It seems wildly counterintuitive that such people could garner public support — Donald Trump being an obvious example. He was written off against Clinton and again against Harris. But he won, despite the prevailing tide of opinion polls suggesting he was behind leading up to both elections.\n\nIn Australia, polls taken this week point to a range of outcomes, from solid trouncing to devastating defeat for Dutton’s pretenders on 3 May.\n\nFederal Two Party Preferred (2PP) polling this week (%):\n\nNews Poll (News Corp): 13 April: ALP 52 – L-NP 48\n\nRoy Morgan 14 April: ALP 54.5 – L-NP 45.5\n\nResolve (Nine) 15 April: ALP 53.5 – L-NP 46.5\n\nEssential (Guardian) 16 April: ALP 55 – L-NP 45\n\nAll this points towards a convincing win. But the polls also pointed to a similarly convincing win for Bill Shorten in the lead-up to the 2019 Election. So convincing, indeed, bookmakers Sportsbet paid out on a Labor victory on the day of the election, even before the polls had closed. Bill Shorten seemed assuredly on his way to victory for Labor in 2019, but he wasn’t.\n\nThis publication trusts the polls even less than we do bookies, which isn't much. But many people still adhere to the old adage, “follow the money”, putting their faith in the tote.\n\nThe current betting odds, according to bookies (Sportsbet, TAB, Ladbrokes), show Labor well ahead.\n\nBut the ALP may not win.\n\nEven though no first-term government from either side of politics has been thrown out of office after only serving a single term since 1931, the result is still uncertain.\n\nOpinion polls and expert opinions notwithstanding, Independent Australia’s laboriously made message this Easter is not to count your eggs before they’re laid.\n\nAnd one more thing. Elections are not just between two political parties. They are not a horse race or a war. In fact, our system of representative democracy is about individuals standing for election to represent their constituents.\n\nPeter Dutton, for example, might lead his party to victory on Saturday, May 3, but still lose his own seat. His seat of Dickson, north of Brisbane, is one of the most marginal seats in the country, and Temu Trump holds it by a mere 1.7%. Recent polls suggest he is behind in Dickson, which also has very credible candidates in Labor's Ali France, The Greens' Vinnie Batten and Independent Ellie Smith.\n\nThe bookies say Dutton will win anyway. But who knows? At Easter, even the impossible may be possible.\n\nBut this time, probably not. Because few, it seems, are keen to see a second coming of Peter Dutton.\n\nPeter Dutton dismisses 52-48 2PP to Labor polling in his seat of Dickson & insists he's up 5 points. His latest conspiracy theory is GetUp have become Teals who are really Greens & Labor members. He mentions teal coloured shirts but the IND colour is maroon in Dickson. #ausvotes pic.twitter.com/992DJiDBRQ — David Marler (@Qldaah) April 12, 2025\n\nThis is not the whole story! It's an abridged version. Subscribe HERE to read this article in full and receive regular updates directly to your inbox, from as little as 96c a week.\n\nFollow Dave Donovan on X/Twitter @davrosz and Bluesky @davrosz.bsky.social​​​​​. Follow Independent Australia on Bluesky @independentaus.bsky.social​​​​, X/Twitter @independentaus and Facebook HERE.\n\nRelated Articles",
        "news_type": "Political"
    },
    {
        "title": " Dutton rides MAGA wave as PM pitches promise",
        "link": "https://independentaustralia.net/politics/politics-display/dutton-rides-maga-wave-as-pm-pitches-promise,19684?utm_source=rss&utm_medium=rss&utm_campaign=IA_Feed",
        "description": " <a href=\"https://independentaustralia.net/politics/politics-display/dutton-rides-maga-wave-as-pm-pitches-promise,19684?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\" title=\"View Information: Dutton rides MAGA wave as PM pitches promise\">\r\n\t\t\t\t\t<img src=\"https://independentaustralia.net/i//article/img/article-19684-thumb.jpg\" width=\"65\" height=\"65\" alt=\"Dutton rides MAGA wave as PM pitches promise\" style=\"margin:0 10px 3px 0;float:left;vertical-align:top;border:1px solid #ccc;\"/></a> Days away from the Federal Election, Opposition Leader Peter Dutton has yet to offer the voting public any reason to elect him. <a href=\"https://independentaustralia.net/politics/politics-display/dutton-rides-maga-wave-as-pm-pitches-promise,19684?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\">read now...</a>",
        "published_date": "Wed, 30 Apr 2025 12:00:00 +1000",
        "source": "Independent Australia",
        "source_country": "Australia",
        "countries_mentioned": [
            "USA",
            "Australia"
        ],
        "content": "Days away from the Federal Election, Opposition Leader Peter Dutton has yet to offer the voting public any reason to elect him, writes Dr Alex Vickery-Howe.\n\nSOME TIME AGO, when Peter Dutton was first made Leader of the Opposition in Australia, I expressed strong doubts. In 2022, the prospects of a Coalition leader swinging even further to the right, when the Teal Independents had demonstrated that centre-right voters believe in and care deeply about catastrophic climate change, seemed slim at best.\n\nMy doubts were focused on Dutton’s refusal to build policy based on science and common sense, and his dogged quest to drag his party away from an electable centre and further to the right. I also called him ‘spooky’ and I won’t apologise for that.\n\nI believe most human beings deserve the presumption of goodwill, but Dutton lost that for me way back in 2015 when he made a sickening quip about Pacific Island nations facing the brunt of climate disaster. That callous one-liner told all Australians that Dutton does believe in climate science; he just doesn’t empathise with those affected.\n\nFriends would say I have a sick sense of humour. An acerbic sense of humour. But there’s a time and a place. Dutton didn’t choose either well. He claimed he “made a mistake” and I agree that he did. I would say his mistake was mocking those who stand to lose everything because self-proclaimed “climate sceptics”, which Dutton only pretends to be, refuse to comprehend the meaning of scientific consensus (a hint: it’s not a bunch of people in lab coats conspiring with NASA).\n\nDutton, on the other hand, would probably say his mistake was making his unwise comment in front of a boom mic that even then-PM Scott Morrison was sharp enough to notice.\n\nDutton’s “joke” should’ve disqualified him from leading the Coalition. His recent national security lie should disqualify him from the top job. Fabricating nonsense stories about foreign leaders does not a worthy prime minister make. I remain less confident now, however, than I did when I wrote that earlier article.\n\nIn 2025, the global mood has swung. Americans call this the “vibe shift”.\n\nIt’s no state secret that the fortunes of President Donald Trump are connected to Dutton’s chances at the polls. Trump has proven to be a renewed force, nurturing class resentment to once again occupy the White House. In response, Dutton has leapt upon buzzwords like “woke” to set his agenda. Clive Palmer is doing the same thing, of course, but Palmer can barely read an autocue.\n\nAt the beginning of the year, mimicking Trump may have seemed like a sound campaign strategy. Much to Dutton’s consternation, Trump has burned through his political capital in record time.\n\nThe Trump tariffs are wildly unpopular and self-evidently idiotic. Car factories and manufacturing plants are not likely to reappear, as if by sorcery, given that any self-respecting CEO is going to shy away from setting up in the U.S. under such an unpredictable and volatile administration. Trump proved the precariousness of investing in America’s future when he backflipped on his own policy.\n\nEven if the magic emanates from those tiny hands and domestic manufacturing does return, do we really believe that production lines in 2025 are going to be humancentric? Have we learned nothing from Amazon?\n\nTrump’s political capital was further incinerated when he kidnapped an innocent man and shipped him to El Salvador. Not even the bootlickers with fork tongues could support that level of cruelty. Not even Joe Rogan.\n\nI hope we still live in a world where that kind of brutalism and injustice is met with universal outrage, contempt and a desire to fight back and reclaim America’s sanity, if not her soul. I hope I see the day when Kilmar Ábrego García sues the American Government for its arrogance, its spite and its failure.\n\nFor Dutton, the sudden rise and fall of Trump in the global consciousness has necessitated a dance. First, he was all in on Team Trump. More recently, he has changed his tune. Will Dutton make sweeping cuts to the public service as Trump did? Or has that policy been scrapped? Will he force people back to work offline? Or was that another Dutton “mistake”? It’s hard to tell what you stand for when you’re too busy tapping your toes.\n\nDutton has, in fact, mimicked Trump accidentally by cosying up one minute and then retreating the next, with a shrug and an “I’ve never met the man” pivot that Trump himself has perfected from countless disastrous associations over the years.\n\nIt was with Trumpian baggage attached that Dutton approached the ABC debate against Prime Minister Anthony Albanese on 16 April. Poor Dutton spent the duration sweating, twisting and obfuscating. He didn’t have a clear platform. He didn’t have a message for the Australian people. He’s not even spooky anymore; he’s a little tragic.\n\nOn climate change, he deferred to science, but stopped short of acknowledging extreme weather events in his native Queensland. That won’t please the so-called “sceptics” and it won’t inspire anyone who can see what’s plainly happening. It was a non-position.\n\nOn the U.S. tariffs, he puffed and blustered about his ability to deliver exemptions, then conceded that he didn’t know Trump. How exactly is he going to negotiate more successfully than any other world leader when he has no idea what he’s walking into? So much hot air. So much flaccid machismo. Much like Trump with Putin.\n\nOn his lies about Indonesia, he apologised meekly, after refusing to do so in the lead up to the debate.\n\nDoing so gave Albanese a free kick:\n\n“You shouldn’t try to use international relations to support domestic politics.”\n\nTouché, Albo.\n\nBut where Dutton was at his most desperate – and this may be the lie that defines the Election – was when he linked the housing crisis with international students. This is one of the dumbest things a public figure in Australia has ever said. He started this prior to the debate and doubled down on the night. It’s nonsense and it needs to be called out.\n\nConservatives in opposition claim to be allies of the working people. All that “I’ll fight for you” rhetoric vanishes when they seize power. We’ve seen that in the chaos and incompetence of the contemporary United States. There is no reason to trust Dutton on this issue. The Coalition has never cared about struggling families. That’s the first reality “cheque” (don't try to bank on it).\n\nThe second reality check is that while foreign ownership should be addressed, the housing crisis in Australia has nothing whatsoever to do with international students or with immigration in general. It’s an easy lie that may well be attractive to people who enjoy lazy solutions, but it doesn’t hold up to scrutiny. Dutton is borrowing from the old John Howard playbook of demonising minorities to score cheap points.\n\nA more credible argument, mounted by the Prime Minister, is that we have a housing supply issue. This is a footnote to the story.\n\nNow let’s talk about the actual story...\n\nNegative gearing: the sword that Bill Shorten died on. It’s clear that neither major party is brave enough to pick up that sword again, but a system that fundamentally rewards investors and deprives younger Australians of the chance to enter the market is a system built on generational inequality.\n\nThat system won’t play well this election, as emerging generations now outnumber Boomer voters. The Australian Greens are touching this policy and that may make life interesting for Albanese if Labor is forced to enter into a partnership to form a minority government.\n\nMy hunch is that Dutton’s broad attacks against immigrants won’t land with the Australian electorate. It’s a stale and mean-spirited argument; a Coalition cliché that younger people are statistically less likely to adopt.\n\nGenerational warfare, on the other hand, will play very well for the Greens. Unlike the United States, where economic hardship and class divisions can be diverted into MAGA racism, Australia is a nation where the fault lines between Boomers, Gen X, Millennials and Gen Z carry much stronger cultural weight. Deep down, young people know their elders are hogging the Australian dream.\n\nMy money says the housing crisis will drive votes. Regardless, this election does represent a real choice.\n\nOn the Labor ticket: Medicare. Paid parental leave. Robust education – something Australia desperately needs – the science of climate change and renewable energy.\n\nOn the Coalition ticket: Scientific illiteracy. Denial of reality. Whinging. Blame. A nuclear power station Australia cannot afford. Diet Trump posturing with no substance behind it.\n\nI’m not sure the debate told us anything new. The likelihood of Australia waking up to a new PM will largely come down to the impact of the “vibe shift” and whether Trump has soured the ascendency of the far-right as badly, and as quickly, as pollsters indicate. My hopes are tempered by an awareness that we all live in bubbles and we all have dangerous blind spots.\n\nFor Australia, my hope is that we see through the populism, the scapegoating and the relentless negativity of the Coalition and move back to big, brave policy that actually helps people on the ground. It’s time to stop bickering at the edges and actually tackle the major issues facing Australians.\n\nAt a time when people in power are listening to Iron Man wannabe billionaires, attempting to drive people apart and creating wedges instead of putting people first, can someone please explain why every world leader is seemingly obsessed with golf?\n\nDr Alex Vickery-Howe is an award-winning playwright and social commentator. He teaches creative writing, screen and drama at Flinders University.\n\nRelated Articles",
        "news_type": "Political"
    },
    {
        "title": " AUSVOTES ECONOMIC FACTS #14: Labor victory a good investment",
        "link": "https://independentaustralia.net/politics/politics-display/ausvotes-economic-facts-14-labor-victory-a-good-investment,19683?utm_source=rss&utm_medium=rss&utm_campaign=IA_Feed",
        "description": " <a href=\"https://independentaustralia.net/politics/politics-display/ausvotes-economic-facts-14-labor-victory-a-good-investment,19683?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\" title=\"View Information: AUSVOTES ECONOMIC FACTS #14: Labor victory a good investment\">\r\n\t\t\t\t\t<img src=\"https://independentaustralia.net/i//article/img/article-19683-thumb.jpg\" width=\"65\" height=\"65\" alt=\"AUSVOTES ECONOMIC FACTS #14: Labor victory a good investment\" style=\"margin:0 10px 3px 0;float:left;vertical-align:top;border:1px solid #ccc;\"/></a> The economy is a dominant issue in the Election. From now until polling day, Independent Australia will outline some key facts on the economy that put the kybosh on many of the myths, lies and distortions being peddled in this Election campaign. <a href=\"https://independentaustralia.net/politics/politics-display/ausvotes-economic-facts-14-labor-victory-a-good-investment,19683?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\">read now...</a>",
        "published_date": "Wed, 30 Apr 2025 10:00:00 +1000",
        "source": "Independent Australia",
        "source_country": "Australia",
        "countries_mentioned": [
            "USA",
            "Australia"
        ],
        "content": "The economy is a dominant issue in the Election. From now until polling day, Independent Australia will outline some key facts on the economy that put the kybosh on many of the myths, lies and distortions being peddled in this Election campaign.\n\nThis is the 14th in a series of short articles by leading economist Stephen Koukoulas, which will be published daily up until the Federal Election on Saturday 3 May 2025.\n\nFACT 14: ARE INVESTORS KEEN TO SEE A LABOR WIN ON 3 MAY?\n\nAs the polls and betting markets confirm a high probability of a Labor win at the 3 May Election, there are some important trends unfolding in the markets for stocks, bonds and the Australian dollar.\n\nIt is a well-established fact that when making asset allocation decisions, investors react to and take account of news, risks and opportunities.\n\nObserve the recent turmoil in the U.S. on the back of the Trump tariff roller coaster and the market volatility.\n\nInvestors price the markets for stocks, bonds and currencies for each country based on a series of factors — domestic economic growth, monetary and fiscal policy settings, the outlook for government debt and, importantly, political risk.\n\nThe prospect of a dysfunctional government in any country or jurisdiction would see investors flee, forcing stock prices lower, government bond yields higher and the currency lower.\n\nIn recent weeks, as the prospects have risen for the return of the Albanese Labor Government, the ASX has risen solidly, government bond yields have fallen and the Australian dollar has risen.\n\nIndeed, the ASX200 has risen 9 per cent from the early April low, ten year government bond yields have fallen to a six month low and the Australian dollar has risen to regain U.S. 64 cents from levels around U.S. 59 cents less than a month ago when, perhaps coincidently, the Coalition was ahead in the polls.\n\nInvest in the facts!\n\nOther facts in this series:\n\nStephen Koukoulas is one of Australia’s most respected economists, a past chief economist of Citibank and senior economic advisor to an Australian Prime Minister. You can follow Stephen on Twitter/X @TheKouk.",
        "news_type": "Economic & Business"
    },
    {
        "title": " Bridging continents: How Amsterdam&#039;s vision can power Australia’s future",
        "link": "https://independentaustralia.net/business/business-display/bridging-continents-how-amsterdams-vision-can-power-australias-future,19682?utm_source=rss&utm_medium=rss&utm_campaign=IA_Feed",
        "description": " <a href=\"https://independentaustralia.net/business/business-display/bridging-continents-how-amsterdams-vision-can-power-australias-future,19682?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\" title=\"View Information: Bridging continents: How Amsterdam&#039;s vision can power Australia’s future\">\r\n\t\t\t\t\t<img src=\"https://independentaustralia.net/i//article/img/article-19682-thumb.jpg\" width=\"65\" height=\"65\" alt=\"Bridging continents: How Amsterdam&#039;s vision can power Australia’s future\" style=\"margin:0 10px 3px 0;float:left;vertical-align:top;border:1px solid #ccc;\"/></a> Australian states could have green, urban and citizen-centred cities just like Amsterdam in future. <a href=\"https://independentaustralia.net/business/business-display/bridging-continents-how-amsterdams-vision-can-power-australias-future,19682?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=IA_Feed\">read now...</a>",
        "published_date": "Wed, 30 Apr 2025 08:00:00 +1000",
        "source": "Independent Australia",
        "source_country": "Australia",
        "countries_mentioned": [
            "USA",
            "Australia"
        ],
        "content": "Australian states could have green, urban and citizen-centred cities just like Amsterdam in future, writes Paul Budde.\n\nOPEN INNOVATION PLATFORM Amsterdam InChange is a leading not-for-profit that brings together governments, businesses, researchers and citizens to co-create future-ready cities.\n\nIn August last year, I reported on my discussion with Frans Anton Vermast. A frequent representative at international smart city conferences, he is currently in Australia under the banner Amsterdam InChange. The name evolved from Amsterdam Smart City, as it was previously known.\n\nThis change reflects a broader shift — smart city thinking is no longer a niche; it is becoming central to mainstream urban development.\n\nOur discussion focused on the city’s transition toward a “smart, sustainable, and citizen-first” model — an approach that integrates innovation, environmental responsibility and people-centred governance.\n\nThis collaborative and inclusive model offers valuable lessons for Australian state investment agencies such as Trade and Investment Queensland (TIQ), Investment NSW, WA Investments, Invest NT, and Invest Victoria, as well as local and regional governments seeking to create more liveable, resilient and sustainable communities.\n\nSustainability: Circular thinking for a healthier planet\n\nAmsterdam’s ambition to become a fully circular economy by 2050, inspired by Doughnut Economics, offers a practical pathway for Australian cities facing climate and waste challenges.\n\nOpportunities exist for collaboration on sustainable construction, waste minimisation and green job creation — particularly in Queensland and New South Wales, where these principles could help launch new industries and protect local ecosystems.\n\nMobility: Reducing emissions, increasing access\n\nAmsterdam’s push for electric mobility and world-class cycling infrastructure shows how cities can thrive without relying on cars.\n\nThis is a promising model for WA Investments and Invest NT to consider for cities like Perth and Darwin. E-bike sharing schemes, integrated mobility apps and electric vehicle (EV) charging infrastructure could transform these urban areas into healthier, less congested and more accessible places.\n\nUrban development: Putting people at the heart\n\nThrough its Green Infrastructure Vision 2050, Amsterdam leads in designing climate-proof, liveable neighbourhoods — green corridors, biodiversity hubs and mixed-use zones that support wellbeing and social connection.\n\nInvest Victoria, for instance, could apply these principles to Melbourne’s evolving suburbs, turning underused land into vibrant, human-centred precincts.\n\nDigital services: empowering through technology\n\nAmsterdam’s citizen-focused digital strategy – emphasising trust, privacy and inclusion – demonstrates how digital tools can enable, rather than overwhelm. From secure digital identities to participatory online platforms, Amsterdam gives citizens a real voice in decision-making.\n\nSimilar initiatives could be championed by Investment NSW and TIQ to foster civic trust and improve service delivery, especially in regional or marginalised communities.\n\nKey lessons for investment\n\nSome key lessons from Amsterdam InChange for Australian investment agencies include:\n\nfostering open innovation ecosystems by supporting regional “living labs” that bring councils, universities, startups and citizens together;\n\nembedding circular economy principles in pilot projects across housing, construction and waste management;\n\ninvesting in low-emission, people-first mobility models suited to Australia’s unique geographies;\n\ndesigning urban spaces with climate resilience and community in mind, beyond real estate returns;\n\nbuilding digital services that prioritise privacy, trust and access, especially for those in remote areas; and\n\nletting citizens lead through co-creation, experience panels and participatory budgeting.\n\nWhy this matters: Tangible benefits for citizens\n\nThis is not just about visionary policy.\n\nThe real-world outcomes of such collaboration include:\n\ncleaner air and reduced emissions from sustainable transport;\n\ngreener, more connected cities with stronger communities;\n\neasier, safer access to services through digital inclusion;\n\ngrowth in green jobs and innovation sectors; and\n\nhealthier lifestyles supported by walkable, well-designed neighbourhoods.\n\nBy embracing the best and next practices and lessons of Amsterdam InChange, Australia’s state investment agencies can become drivers of globally relevant, locally tailored change. The result? Cities that aren’t just smart — they’re also fair, green and deeply human.\n\nAmsterdam’s model shows us that true innovation happens when everyone is invited to shape it, and when progress is measured not just in GDP, but in well-being.\n\nFrans Anton will be back in August this year when he will continue to present this vision to several organisations in Australia.\n\nPaul Budde is an IA columnist and managing director of independent telecommunications research consultancy, Paul Budde Consulting. You can follow Paul on Twitter/X @PaulBudde.\n\nRelated Articles",
        "news_type": "Economic & Business"
    },
    {
        "title": "Victoria’s hot seats LIVE updates: Peter Dutton visits anti-Monique Ryan pub; Frydenberg condemns antisemitic stunt at appearance with Hamer",
        "link": "https://www.theage.com.au/politics/federal/victoria-s-hot-seats-live-updates-cost-of-living-in-focus-in-final-week-of-campaigning-20250425-p5lu8k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "description": "Pre-poll antics in Kooyong have just ratcheted up another notch, with the Liberal Party now threatening to take Boroondara council to court.",
        "published_date": "Wed, 30 Apr 2025 22:00:43 +1000",
        "source": "The Age",
        "source_country": "Australia",
        "countries_mentioned": [
            "India",
            "Australia"
        ],
        "content": "Spend any time in the electorate of Goldstein and it’s hard to avoid the attack ads targeting teal independent MP Zoe Daniel.\n\nThere’s the giant billboard opposite the Kingston City Hall authorised by Australians for Prosperity, featuring a photo of Daniel’s head in a balloon.\n\n“All hot air: Vote for change,” the ad states. “Blocked: Local voices. Disinterested: In local crime. Zero Delivery: On cost of living.”\n\nAt the pre-polling booths, flyers are being handed out with the headline: “Repeal the Teal”. They state: “Teals … Not open. Not accountable. Not independent. Not worth it. Put Zoe Daniel last.”\n\nEarlier in the campaign I spotted trucks with mobile billboards from another lobby group, Better Australia, driving around the electorate and parked prominently, including outside the Jewish community forum organised by members of the Jewish community at the Brighton Hebrew Congregation.\n\nFlyers distributed by Better Australia state: “Don’t trust the Teals this time!” They also criticise Daniel for signing a letter calling for Australia to reinstate funding for UNRWA in February 2024 and claim she has ignored warnings from Jewish and other communities about rising hate and antisemitism. UNRWA is the United Nations’ relief agency assisting Palestinians.\n\nBetter Australia has defended its members wearing yellow vests in Kooyong.\n\nAs my colleague Rachael Dexter has reported in Kooyong, Better Australia has also come under scrutiny for its members wearing yellow vests at the pre-polling booths which say “Community Advisor” and look very similar to the official vests worn by Australian Electoral Commission staff.\n\nA spokesman for the Liberal Party said neither it nor Tim Wilson, the party’s candidate for Goldstein, have engaged Australians for Prosperity, Repeal the Teal or Better Australia.\n\nI thought it was worthwhile taking a look at exactly who these groups are, and who is behind them.\n\nYou can get in touch about any ads you see in the electorate or information on the lobby groups behind them using the form below.\n\nWho are Australians for Prosperity?\n\nAustralians for Prosperity is a lobby group headed by former Liberal MP Jason Falinski, a friend of Wilson, the Liberal candidate for Goldstein.\n\nA Liberal Party spokesman described Falinski and Wilson’s relationship as that of “former parliamentary colleagues”. However, Falinksi told The Age they are “good friends”.\n\nThe pair came under scrutiny when, as MPs in 2019, they used a taxpayer-funded inquiry into Labor’s franking credits policy to raise funds for the Liberals.\n\nFormer federal MP Jason Falinski now heads Australians for Prosperity. Credit: Dominic Lorrimer\n\nLetters to self-managed super fund trustees from Falinski, who was then part of parliament’s Standing Committee on Economics, using the inquiry to entice voters to donate to the Liberal Party in exchange for an audience with Wilson, who was then the committee chair.\n\nFalinski and Wilson also wrote a joint column for the Australian Financial Review from 2022 to 2024. Both lost their seats at the 2022 election.\n\nFalinski says he has contacted Wilson “from time to time” over the course of the election campaign just to check in on how he is going, but “we don’t talk tactics”. He says he is not co-ordinating the Australians for Prosperity campaign with Wilson, nor with the Liberal Party.\n\nBefore Falinski took over running Australians for Prosperity, Julian Simmons, the former Liberal MP for the Brisbane seat of Ryan, was the executive director of the group.\n\nSimmonds was this month appointed acting chief executive of Economic Development Queensland by Queensland’s new Liberal National state government. He began in that position on April 22 and references to him have been removed from the Australians for Prosperity website.\n\nAustralians for Prosperity has received significant funding from the coal industry, and electoral records show it received $725,000 in donations from Coal Australia.\n\nFalinski says Australians for Prosperity is not a lobby group for the coal industry and the majority of its funding comes from “ordinary Australians”, including some high net-worth individuals who made their money in manufacturing and farming, and a property heiress.\n\nHe says the teals’ links to Climate 200 should also be subject to scrutiny.\n\nWho are Repeal the Teal?\n\nRepeal the Teal is a lobby group founded by the Jewish activist network, J-United, which is affiliated with the right-wing lobby group Advance Australia. The campaign has been active in other teal-held electorates, including Kooyong.\n\nThe campaign is also busy on social media, as Advance Australia has spent $255,676 in the past 90 days in Victoria on advertising with Meta, the owner of Instagram and Facebook.\n\nRepeal the Teal’s materials are authorised by Harriet Warlow-Shill, a Melbourne lawyer who hosted an online event in March called “Does my teal support terror? One woman’s journey to find out”.\n\nWarlow-Shill says the Repeal the Teal campaign is not linked to the Liberal Party and she is no longer a Liberal Party member.\n\n“I resigned from the party on 27 February, 2025 to ensure this is a stand-alone effort by myself and a few other ladies,” she says. “We have no prior experience running campaigns.”\n\nA Repeal the Teal flyer.\n\nWho are Better Australia?\n\nBetter Australia is incorporated in NSW and was formerly known as “Better NSW Incorporated” before changing its name in January.\n\nIt is a spin-off of Better Council, which targeted the Greens during last year’s local council elections in NSW, and has now turned its focus to teal-held seats including Goldstein.\n\nA company search shows Sophie Calland is Better Australia’s public officer, and in an email, she says the group is an “independent non-partisan community initiative”.\n\nA truck with Better Australia advertising.\n\n“We believe a minority government comprising of Greens and teal ‘independents’ will be incredibly destructive for everyday Australians,” Callan says in the email.\n\n“Former minority governments have led to stalling legislation and dramatic swings in government policy that do not align with what the public has voted for. It means whoever is in power must negotiate with extreme or elite voices that do not represent the public.”\n\nCalland says Better Australia isn’t affiliated with any political party, although she is a member of the Labor Party.\n\n“We are registered as a significant third-party entity for the upcoming 2025 federal election,” she says.\n\nCalland says she has had no contact with Wilson during the campaign.\n\n“But Better Australia’s local volunteers in Goldstein are doing everything they can to ensure that voters don’t get tricked by the teals in the election,” she says.\n\nBetter Australia also has an extensive online presence, having spent $66,010 in Victoria in the past 90 days on advertising with Meta, the owner of Facebook and Instagram.",
        "news_type": "Political"
    },
    {
        "title": "When will Mam return to the Broncos?",
        "link": "https://www.theage.com.au/sport/nrl/when-will-mam-return-to-the-broncos-20250430-p5lvjd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "description": "Darren Lockyer and Ezra Mam discuss when Ezra Mam will return to the Brisbane Broncos.",
        "published_date": "Wed, 30 Apr 2025 21:57:51 +1000",
        "source": "The Age",
        "source_country": "Australia",
        "countries_mentioned": [
            "Australia"
        ],
        "content": "When will Mam return to the Broncos?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "news_type": "Social Issues & Human Rights"
    },
    {
        "title": "Your May hit list: The hot, new and just-reviewed places to check out this month",
        "link": "https://www.theage.com.au/goodfood/sydney-eating-out/your-may-hit-list-the-hot-new-and-just-reviewed-places-to-check-out-this-month-20250429-p5lv6h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "description": "From a food truck serving some of Sydney’s best tacos to a reborn 60-year-old family-run restaurant, here’s where to eat and drink in Sydney this month.",
        "published_date": "Wed, 30 Apr 2025 21:42:38 +1000",
        "source": "The Age",
        "source_country": "Australia",
        "countries_mentioned": [
            "Australia"
        ],
        "content": "Collection\n\nYour May hit list: The hot, new and just-reviewed places to check out this month\n\nFrom a petrol-station food truck serving some of Sydney’s best tacos to a reborn 60-year-old family-run restaurant, here’s where (and what) to eat and drink in Sydney this month.",
        "news_type": "Social Issues & Human Rights"
    },
    {
        "title": "Gus backs Des to fix the Titans' problems",
        "link": "https://www.theage.com.au/sport/nrl/gus-backs-des-to-fix-the-titans-problems-20250430-p5lvjb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "description": "Phil Gould reveals why he does not believe Des Hasler will be axed as head coach of the Gold Coast Titans.",
        "published_date": "Wed, 30 Apr 2025 21:22:53 +1000",
        "source": "The Age",
        "source_country": "Australia",
        "countries_mentioned": [
            "Australia"
        ],
        "content": "Gus backs Des to fix the Titans' problems\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "news_type": "Social Issues & Human Rights"
    },
    {
        "title": "Aiden needs abetting",
        "link": "https://www.theage.com.au/national/nsw/aiden-needs-abetting-20250430-p5lva5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "description": "Vera’s a real case.",
        "published_date": "Wed, 30 Apr 2025 21:00:00 +1000",
        "source": "The Age",
        "source_country": "Australia",
        "countries_mentioned": [
            "USA",
            "Australia"
        ],
        "content": "“So sad. No more Vera,” laments Robert Hosking of Paddington. “But it was the penultimate episode that caught my attention, when her longtime associate gets a nasty bashing by the baddy. All I could think was: ‘Oh my God, they killed Kenny!’”\n\n“When I moved to Sydney in the ’70s, I used to see a bearded man wheeling a mysterious wooden box on wheels around the Hyde Park area,” writes Donald Hawes of Peel. “There was even a wooden ramp built over the park steps near Museum Station, just wide enough for his vehicle. It was only when his death was announced that I discovered that he was a knife sharpener (C8) and local identity.”\n\nJohn Boddington of Dalton remembers a similar local identity: “His name was Harold Wright (‘The Sharpening King’) and his extraordinary sharpening wagon is now in the National Museum. I have a strong suspicion that Heath Robinson had a hand in the design. I can recall seeing Harold’s wagon as a small boy a long time ago and longing to have a bash at turning all the stuff on.”\n\n“While I try to keep my Ukrainian stories light-hearted, Doug McLaughlin’s memories of subs bombing Sydney in WWII (C8) have certainly triggered some recent trauma,” admits Chris Keane. “A few days ago I was at home in Seattle when my phone started blowing up with messages from ‘my’ kids in Ukraine. Their previously unscathed city was being actively targeted with Russian missiles and drones. Over the course of a fraught hour I was inundated with messages like ‘I’m really scared’, ‘it’s very close, the ground is shaking and everyone is crying’ and ‘in case I don’t see you again, thanks for everything’. Of course, right now as I write, I’ve started crying again. Perhaps Doug can provide more details about when the nightmares will dissipate?”\n\nThe lobster discussion (C8) goes offshore with former New York knife fancier Ellen Kassel of Collaroy again on point: “Honeymoon – sailing down Maine. Lobster, lobster, lobster. Day three of honeymoon – big bad rash all over! Didn’t know which new thing in my life was causing it. Thankfully, it was the lobsters.”",
        "news_type": "Social Issues & Human Rights"
    }
]